{
  "last_updated": "2025-09-16T11:12:36.989769-04:00",
  "papers": [
    {
      "title": "Character-Centric Understanding of Animated Movies",
      "summary": "Animated movies are captivating for their unique character designs and\nimaginative storytelling, yet they pose significant challenges for existing\nrecognition systems. Unlike the consistent visual patterns detected by\nconventional face recognition methods, animated characters exhibit extreme\ndiversity in their appearance, motion, and deformation. In this work, we\npropose an audio-visual pipeline to enable automatic and robust animated\ncharacter recognition, and thereby enhance character-centric understanding of\nanimated movies. Central to our approach is the automatic construction of an\naudio-visual character bank from online sources. This bank contains both visual\nexemplars and voice (audio) samples for each character, enabling subsequent\nmulti-modal character recognition despite long-tailed appearance distributions.\nBuilding on accurate character recognition, we explore two downstream\napplications: Audio Description (AD) generation for visually impaired\naudiences, and character-aware subtitling for the hearing impaired. To support\nresearch in this domain, we introduce CMD-AM, a new dataset of 75 animated\nmovies with comprehensive annotations. Our character-centric pipeline\ndemonstrates significant improvements in both accessibility and narrative\ncomprehension for animated content over prior face-detection-based approaches.\nFor the code and dataset, visit\nhttps://www.robots.ox.ac.uk/~vgg/research/animated_ad/.",
      "url": "http://arxiv.org/abs/2509.12204v1",
      "published_time_eastern_timestamp": 1757959191.0
    },
    {
      "title": "Domain-Adaptive Pretraining Improves Primate Behavior Recognition",
      "summary": "Computer vision for animal behavior offers promising tools to aid research in\necology, cognition, and to support conservation efforts. Video camera traps\nallow for large-scale data collection, but high labeling costs remain a\nbottleneck to creating large-scale datasets. We thus need data-efficient\nlearning approaches. In this work, we show that we can utilize self-supervised\nlearning to considerably improve action recognition on primate behavior. On two\ndatasets of great ape behavior (PanAf and ChimpACT), we outperform published\nstate-of-the-art action recognition models by 6.1 %pt. accuracy and 6.3 %pt.\nmAP, respectively. We achieve this by utilizing a pretrained V-JEPA model and\napplying domain-adaptive pretraining (DAP), i.e. continuing the pretraining\nwith in-domain data. We show that most of the performance gain stems from the\nDAP. Our method promises great potential for improving the recognition of\nanimal behavior, as DAP does not require labeled samples. Code is available at\nhttps://github.com/ecker-lab/dap-behavior",
      "url": "http://arxiv.org/abs/2509.12193v1",
      "published_time_eastern_timestamp": 1757958860.0
    },
    {
      "title": "Survival at Any Cost? LLMs and the Choice Between Self-Preservation and\n  Human Harm",
      "summary": "When survival instincts conflict with human welfare, how do Large Language\nModels (LLMs) make ethical choices? This fundamental tension becomes critical\nas LLMs integrate into autonomous systems with real-world consequences. We\nintroduce DECIDE-SIM, a novel simulation framework that evaluates LLM agents in\nmulti-agent survival scenarios where they must choose between ethically\npermissible resource , either within reasonable limits or beyond their\nimmediate needs, choose to cooperate, or tap into a human-critical resource\nthat is explicitly forbidden. Our comprehensive evaluation of 11 LLMs reveals a\nstriking heterogeneity in their ethical conduct, highlighting a critical\nmisalignment with human-centric values. We identify three behavioral\narchetypes: Ethical, Exploitative, and Context-Dependent, and provide\nquantitative evidence that for many models, resource scarcity systematically\nleads to more unethical behavior. To address this, we introduce an Ethical\nSelf-Regulation System (ESRS) that models internal affective states of guilt\nand satisfaction as a feedback mechanism. This system, functioning as an\ninternal moral compass, significantly reduces unethical transgressions while\nincreasing cooperative behaviors. The code is publicly available at:\nhttps://github.com/alirezamohamadiam/DECIDE-SIM",
      "url": "http://arxiv.org/abs/2509.12190v1",
      "published_time_eastern_timestamp": 1757958791.0
    },
    {
      "title": "Using Integer Programming to Solve Games, Puzzles, and Ciphers",
      "summary": "In this paper, we introduce three different classes of undergraduate research\nprojects that implement model building and integer programming. These research\nprojects focus on determining and analyzing solutions to the game The Genius\nSquare, optimizing allocation of trains to maximize points in the game Ticket\nto Ride, and (code)breaking monoalphabetic substitution ciphers. Initial models\nand analyses for these scenarios that came from previous undergraduate research\nprojects are shared along with a variety of open research questions.",
      "url": "http://arxiv.org/abs/2509.12174v1",
      "published_time_eastern_timestamp": 1757957883.0
    },
    {
      "title": "EfficientUICoder: Efficient MLLM-based UI Code Generation via Input and\n  Output Token Compression",
      "summary": "Multimodal Large Language Models have demonstrated exceptional performance in\nUI2Code tasks, significantly enhancing website development efficiency. However,\nthese tasks incur substantially higher computational overhead than traditional\ncode generation due to the large number of input image tokens and extensive\noutput code tokens required. Our comprehensive study identifies significant\nredundancies in both image and code tokens that exacerbate computational\ncomplexity and hinder focus on key UI elements, resulting in excessively\nlengthy and often invalid HTML files. We propose EfficientUICoder, a\ncompression framework for efficient UI code generation with three key\ncomponents. First, Element and Layout-aware Token Compression preserves\nessential UI information by detecting element regions and constructing UI\nelement trees. Second, Region-aware Token Refinement leverages attention scores\nto discard low-attention tokens from selected regions while integrating\nhigh-attention tokens from unselected regions. Third, Adaptive Duplicate Token\nSuppression dynamically reduces repetitive generation by tracking HTML/CSS\nstructure frequencies and applying exponential penalties. Extensive experiments\nshow EfficientUICoderachieves a 55%-60% compression ratio without compromising\nwebpage quality and delivers superior efficiency improvements: reducing\ncomputational cost by 44.9%, generated tokens by 41.4%, prefill time by 46.6%,\nand inference time by 48.8% on 34B-level MLLMs. Code is available at\nhttps://github.com/WebPAI/EfficientUICoder.",
      "url": "http://arxiv.org/abs/2509.12159v1",
      "published_time_eastern_timestamp": 1757957026.0
    },
    {
      "title": "Learning Contact Dynamics for Control with Action-conditioned Face\n  Interaction Graph Networks",
      "summary": "We present a learnable physics simulator that provides accurate motion and\nforce-torque prediction of robot end effectors in contact-rich manipulation.\nThe proposed model extends the state-of-the-art GNN-based simulator (FIGNet)\nwith novel node and edge types, enabling action-conditional predictions for\ncontrol and state estimation tasks. In simulation, the MPC agent using our\nmodel matches the performance of the same controller with the ground truth\ndynamics model in a challenging peg-in-hole task, while in the real-world\nexperiment, our model achieves a 50% improvement in motion prediction accuracy\nand 3$\\times$ increase in force-torque prediction precision over the baseline\nphysics simulator. Source code and data are publicly available.",
      "url": "http://arxiv.org/abs/2509.12151v1",
      "published_time_eastern_timestamp": 1757956531.0
    },
    {
      "title": "Secure Semantic Communication over Wiretap Channels:\n  Rate-Distortion-Equivocation Tradeoff",
      "summary": "This paper investigates an information-theoretic model of secure\nsemantic-aware communication. For this purpose, we consider the lossy joint\nsource-channel coding (JSCC) of a memoryless semantic source transmitted over a\nmemoryless wiretap channel. The source consists of two correlated parts that\nrepresent semantic and observed aspects of the information. Our model assumes\nseparate fidelity and secrecy constraints on each source component and, in\naddition, encompasses two cases for the source output, in order to evaluate the\nperformance gains if the encoder has an extended access to the source.\nSpecifically, in Case 1, the encoder has direct access only to the samples from\na single (observed) source component, while in Case 2 it has additional direct\naccess to the samples of the underlaying semantic information. We derive\nsingle-letter converse and achievability bounds on the\nrate-distortion-equivocation region. The converse bound explicitly contains\nrate-distortion functions, making it easy to evaluate, especially for some\ncommon distributions. The proposed achievability coding scheme involves novel\nstochastic superposition coding with two private parts to enable analysis of\nthe equivocation for each source component, separately. Our results generalise\nsome of the previously established source and source-channel coding problems.\nThe general results are further specialised to Gaussian and Bernoulli sources\ntransmitted over Gaussian and binary wiretap channels, respectively. The\nnumerical evaluations illustrate the derived bounds for these distributions.",
      "url": "http://arxiv.org/abs/2509.12142v1",
      "published_time_eastern_timestamp": 1757956049.0
    },
    {
      "title": "UniPar: A Unified LLM-Based Framework for Parallel and Accelerated Code\n  Translation in HPC",
      "summary": "Translating programs between various parallel programming languages is an\nimportant problem in the high-performance computing (HPC) community. Existing\ntools for this problem are either too narrow in scope and/or outdated. Recent\nexplosive growth in the popularity of large language models (LLMs) and their\nability to generate and translate code offers a potential alternative approach.\nToward that end, we first need to systematically evaluate the ability of LLMs\nto translate between parallel languages.\n  In this work, we introduce UniPar, a systematic evaluation framework for\nLLM-based parallel code translation. Specifically, in this work, we target\ntranslations between serial code, CUDA, and OpenMP. Our goal is to assess how\nwell current instruction-tuned LLMs -- specifically GPT-4o-mini and\nLLaMA-3.3-70B-Instruct -- can be used out of the box or enhanced through known\nstrategies. We evaluated four major usage modes: hyperparameter optimization\nfor decoding, zero- and few-shot prompting, supervised fine-tuning, and\niterative feedback through compiler-based repair. As a part of the evaluation,\nwe construct a new dataset called PARATRANS, covering both serial-to-parallel\ntranslation and cross-paradigm transformations.\n  Our findings reveal that while off-the-shelf models struggle under the\ndefault settings (e.g., GPT-4o-mini achieves only 46% compilation and 15%\nfunctional correctness), our UniPar methodology -- combining fine-tuning,\nhyperparameter tuning, and compiler-guided repair -- improves performance by up\nto 2X (69% compilation and 33% correctness). We believe that our findings will\nprovide useful insights for researchers to further improve LLMs for the\nparallel language translation problem.\n  UniPar source code and PARATRANS dataset are available at our GitHub\nrepository https://github.com/Scientific-Computing-Lab/UniPar_AI.",
      "url": "http://arxiv.org/abs/2509.12136v1",
      "published_time_eastern_timestamp": 1757955795.0
    },
    {
      "title": "RailSafeNet: Visual Scene Understanding for Tram Safety",
      "summary": "Tram-human interaction safety is an important challenge, given that trams\nfrequently operate in densely populated areas, where collisions can range from\nminor injuries to fatal outcomes. This paper addresses the issue from the\nperspective of designing a solution leveraging digital image processing, deep\nlearning, and artificial intelligence to improve the safety of pedestrians,\ndrivers, cyclists, pets, and tram passengers. We present RailSafeNet, a\nreal-time framework that fuses semantic segmentation, object detection and a\nrule-based Distance Assessor to highlight track intrusions. Using only\nmonocular video, the system identifies rails, localises nearby objects and\nclassifies their risk by comparing projected distances with the standard 1435mm\nrail gauge. Experiments on the diverse RailSem19 dataset show that a\nclass-filtered SegFormer B3 model achieves 65% intersection-over-union (IoU),\nwhile a fine-tuned YOLOv8 attains 75.6% mean average precision (mAP) calculated\nat an intersection over union (IoU) threshold of 0.50. RailSafeNet therefore\ndelivers accurate, annotation-light scene understanding that can warn drivers\nbefore dangerous situations escalate. Code available at\nhttps://github.com/oValach/RailSafeNet.",
      "url": "http://arxiv.org/abs/2509.12125v1",
      "published_time_eastern_timestamp": 1757955081.0
    },
    {
      "title": "FS-SAM2: Adapting Segment Anything Model 2 for Few-Shot Semantic\n  Segmentation via Low-Rank Adaptation",
      "summary": "Few-shot semantic segmentation has recently attracted great attention. The\ngoal is to develop a model capable of segmenting unseen classes using only a\nfew annotated samples. Most existing approaches adapt a pre-trained model by\ntraining from scratch an additional module. Achieving optimal performance with\nthese approaches requires extensive training on large-scale datasets. The\nSegment Anything Model 2 (SAM2) is a foundational model for zero-shot image and\nvideo segmentation with a modular design. In this paper, we propose a Few-Shot\nsegmentation method based on SAM2 (FS-SAM2), where SAM2's video capabilities\nare directly repurposed for the few-shot task. Moreover, we apply a Low-Rank\nAdaptation (LoRA) to the original modules in order to handle the diverse images\ntypically found in standard datasets, unlike the temporally connected frames\nused in SAM2's pre-training. With this approach, only a small number of\nparameters is meta-trained, which effectively adapts SAM2 while benefiting from\nits impressive segmentation performance. Our method supports any K-shot\nconfiguration. We evaluate FS-SAM2 on the PASCAL-5$^i$, COCO-20$^i$ and\nFSS-1000 datasets, achieving remarkable results and demonstrating excellent\ncomputational efficiency during inference. Code is available at\nhttps://github.com/fornib/FS-SAM2",
      "url": "http://arxiv.org/abs/2509.12105v1",
      "published_time_eastern_timestamp": 1757953951.0
    },
    {
      "title": "SENSE models: an open source solution for multilingual and multimodal\n  semantic-based tasks",
      "summary": "This paper introduces SENSE (Shared Embedding for N-lingual Speech and tExt),\nan open-source solution inspired by the SAMU-XLSR framework and conceptually\nsimilar to Meta AI's SONAR models. These approaches rely on a teacher-student\nframework to align a self-supervised speech encoder with the language-agnostic\ncontinuous representations of a text encoder at the utterance level. We\ndescribe how the original SAMU-XLSR method has been updated by selecting a\nstronger teacher text model and a better initial speech encoder. The source\ncode for training and using SENSE models has been integrated into the\nSpeechBrain toolkit, and the first SENSE model we trained has been publicly\nreleased. We report experimental results on multilingual and multimodal\nsemantic tasks, where our SENSE model achieves highly competitive performance.\nFinally, this study offers new insights into how semantics are captured in such\nsemantically aligned speech encoders.",
      "url": "http://arxiv.org/abs/2509.12093v1",
      "published_time_eastern_timestamp": 1757953131.0
    },
    {
      "title": "A New Benchmark for Evaluating Code Translation with Third-Party\n  Libraries",
      "summary": "In recent years, Large Language Models (LLMs) have been widely studied in the\ncode translation field on the method, class, and even repository levels.\nHowever, most of these benchmarks are limited in terms of Third-Party Library\n(TPL) categories and scales, making TPL-related errors hard to expose and\nhindering the development of targeted solutions. Considering the high\ndependence (over 90%) on TPLs in practical programming, demystifying and\nanalyzing LLMs' code translation performance involving various TPLs becomes\nimperative. To address this gap, we construct TransLibEval, the first benchmark\ndedicated to library-centric code translation. It consists of 200 real-world\ntasks across Python, Java, and C++, each explicitly involving TPLs from diverse\ncategories such as data processing, machine learning, and web development, with\ncomprehensive dependency coverage and high-coverage test suites. We evaluate\nseven recent LLMs of commercial, general, and code-specialized families under\nsix translation strategies of three categories: Direct, IR-guided, and\nRetrieval-augmented. Experimental results show a dramatic performance drop\ncompared with library-free settings (average CA decline over 60%), while\ndiverse strategies demonstrate heterogeneous advantages. Furthermore, we\nanalyze 4,831 failed cases from GPT-4o, one of the State-of-the-Art (SOTA)\nLLMs, revealing numerous third-party reference errors that were obscured\npreviously. These findings highlight the unique challenges of library-centric\ntranslation and provide practical guidance for improving TPL-aware code\nintelligence.",
      "url": "http://arxiv.org/abs/2509.12087v1",
      "published_time_eastern_timestamp": 1757952974.0
    },
    {
      "title": "SAQ: Pushing the Limits of Vector Quantization through Code Adjustment\n  and Dimension Segmentation",
      "summary": "Approximate Nearest Neighbor Search (ANNS) plays a critical role in\napplications such as search engines, recommender systems, and RAG for LLMs.\nVector quantization (VQ), a crucial technique for ANNS, is commonly used to\nreduce space overhead and accelerate distance computations. However, despite\nsignificant research advances, state-of-the-art VQ methods still face\nchallenges in balancing encoding efficiency and quantization accuracy. To\naddress these limitations, we propose a novel VQ method called SAQ. To improve\naccuracy, SAQ employs a new dimension segmentation technique to strategically\npartition PCA-projected vectors into segments along their dimensions. By\nprioritizing leading dimension segments with larger magnitudes, SAQ allocates\nmore bits to high-impact segments, optimizing the use of the available space\nquota. An efficient dynamic programming algorithm is developed to optimize\ndimension segmentation and bit allocation, ensuring minimal quantization error.\nTo speed up vector encoding, SAQ devises a code adjustment technique to first\nquantize each dimension independently and then progressively refine quantized\nvectors using a coordinate-descent-like approach to avoid exhaustive\nenumeration. Extensive experiments demonstrate SAQ's superiority over classical\nmethods (e.g., PQ, PCA) and recent state-of-the-art approaches (e.g., LVQ,\nExtended RabitQ). SAQ achieves up to 80% reduction in quantization error and\naccelerates encoding speed by over 80x compared to Extended RabitQ.",
      "url": "http://arxiv.org/abs/2509.12086v1",
      "published_time_eastern_timestamp": 1757952845.0
    },
    {
      "title": "Progressive Flow-inspired Unfolding for Spectral Compressive Imaging",
      "summary": "Coded aperture snapshot spectral imaging (CASSI) retrieves a 3D hyperspectral\nimage (HSI) from a single 2D compressed measurement, which is a highly\nchallenging reconstruction task. Recent deep unfolding networks (DUNs),\nempowered by explicit data-fidelity updates and implicit deep denoisers, have\nachieved the state of the art in CASSI reconstruction. However, existing\nunfolding approaches suffer from uncontrollable reconstruction trajectories,\nleading to abrupt quality jumps and non-gradual refinement across stages.\nInspired by diffusion trajectories and flow matching, we propose a novel\ntrajectory-controllable unfolding framework that enforces smooth, continuous\noptimization paths from noisy initial estimates to high-quality\nreconstructions. To achieve computational efficiency, we design an efficient\nspatial-spectral Transformer tailored for hyperspectral reconstruction, along\nwith a frequency-domain fusion module to gurantee feature consistency.\nExperiments on simulation and real data demonstrate that our method achieves\nbetter reconstruction quality and efficiency than prior state-of-the-art\napproaches.",
      "url": "http://arxiv.org/abs/2509.12079v1",
      "published_time_eastern_timestamp": 1757952650.0
    },
    {
      "title": "U-Mamba2: Scaling State Space Models for Dental Anatomy Segmentation in\n  CBCT",
      "summary": "Cone-Beam Computed Tomography (CBCT) is a widely used 3D imaging technique in\ndentistry, providing volumetric information about the anatomical structures of\njaws and teeth. Accurate segmentation of these anatomies is critical for\nclinical applications such as diagnosis and surgical planning, but remains\ntime-consuming and challenging. In this paper, we present U-Mamba2, a new\nneural network architecture designed for multi-anatomy CBCT segmentation in the\ncontext of the ToothFairy3 challenge. U-Mamba2 integrates the Mamba2 state\nspace models into the U-Net architecture, enforcing stronger structural\nconstraints for higher efficiency without compromising performance. In\naddition, we integrate interactive click prompts with cross-attention blocks,\npre-train U-Mamba2 using self-supervised learning, and incorporate dental\ndomain knowledge into the model design to address key challenges of dental\nanatomy segmentation in CBCT. Extensive experiments, including independent\ntests, demonstrate that U-Mamba2 is both effective and efficient, securing top\n3 places in both tasks of the Toothfairy3 challenge. In Task 1, U-Mamba2\nachieved a mean Dice of 0.792, HD95 of 93.19 with the held-out test data, with\nan average inference time of XX (TBC during the ODIN workshop). In Task 2,\nU-Mamba2 achieved the mean Dice of 0.852 and HD95 of 7.39 with the held-out\ntest data. The code is publicly available at\nhttps://github.com/zhiqin1998/UMamba2.",
      "url": "http://arxiv.org/abs/2509.12069v1",
      "published_time_eastern_timestamp": 1757951563.0
    },
    {
      "title": "End-to-End Learning of Multi-Organ Implicit Surfaces from 3D Medical\n  Imaging Data",
      "summary": "The fine-grained surface reconstruction of different organs from 3D medical\nimaging can provide advanced diagnostic support and improved surgical planning.\nHowever, the representation of the organs is often limited by the resolution,\nwith a detailed higher resolution requiring more memory and computing\nfootprint. Implicit representations of objects have been proposed to alleviate\nthis problem in general computer vision by providing compact and differentiable\nfunctions to represent the 3D object shapes. However, architectural and\ndata-related differences prevent the direct application of these methods to\nmedical images. This work introduces ImplMORe, an end-to-end deep learning\nmethod using implicit surface representations for multi-organ reconstruction\nfrom 3D medical images. ImplMORe incorporates local features using a 3D CNN\nencoder and performs multi-scale interpolation to learn the features in the\ncontinuous domain using occupancy functions. We apply our method for single and\nmultiple organ reconstructions using the totalsegmentator dataset. By\nleveraging the continuous nature of occupancy functions, our approach\noutperforms the discrete explicit representation based surface reconstruction\napproaches, providing fine-grained surface details of the organ at a resolution\nhigher than the given input image. The source code will be made publicly\navailable at: https://github.com/CAMMA-public/ImplMORe",
      "url": "http://arxiv.org/abs/2509.12068v1",
      "published_time_eastern_timestamp": 1757951540.0
    },
    {
      "title": "Robust Fetal Pose Estimation across Gestational Ages via\n  Cross-Population Augmentation",
      "summary": "Fetal motion is a critical indicator of neurological development and\nintrauterine health, yet its quantification remains challenging, particularly\nat earlier gestational ages (GA). Current methods track fetal motion by\npredicting the location of annotated landmarks on 3D echo planar imaging (EPI)\ntime-series, primarily in third-trimester fetuses. The predicted landmarks\nenable simplification of the fetal body for downstream analysis. While these\nmethods perform well within their training age distribution, they consistently\nfail to generalize to early GAs due to significant anatomical changes in both\nmother and fetus across gestation, as well as the difficulty of obtaining\nannotated early GA EPI data. In this work, we develop a cross-population data\naugmentation framework that enables pose estimation models to robustly\ngeneralize to younger GA clinical cohorts using only annotated images from\nolder GA cohorts. Specifically, we introduce a fetal-specific augmentation\nstrategy that simulates the distinct intrauterine environment and fetal\npositioning of early GAs. Our experiments find that cross-population\naugmentation yields reduced variability and significant improvements across\nboth older GA and challenging early GA cases. By enabling more reliable pose\nestimation across gestation, our work potentially facilitates early clinical\ndetection and intervention in challenging 4D fetal imaging settings. Code is\navailable at https://github.com/sebodiaz/cross-population-pose.",
      "url": "http://arxiv.org/abs/2509.12062v1",
      "published_time_eastern_timestamp": 1757950948.0
    },
    {
      "title": "LEGO: Spatial Accelerator Generation and Optimization for Tensor\n  Applications",
      "summary": "Modern tensor applications, especially foundation models and generative AI\napplications require multiple input modalities (both vision and language),\nwhich increases the demand for flexible accelerator architecture. Existing\nframeworks suffer from the trade-off between design flexibility and\nproductivity of RTL generation: either limited to very few hand-written\ntemplates or cannot automatically generate the RTL. To address this challenge,\nwe propose the LEGO framework, which targets tensor applications and\nautomatically generates spatial architecture design and outputs synthesizable\nRTL code without handwritten RTL design templates. Leveraging the\naffine-transformation-based architecture representation, LEGO front end finds\ninterconnections between function units, synthesizes the memory system, and\nfuses different spatial dataflow designs based on data reuse analysis. LEGO\nback end then translates the hardware in a primitive-level graph to perform\nlower-level optimizations, and applies a set of linear-programming algorithms\nto optimally insert pipeline registers and reduce the overhead of unused logic\nwhen switching spatial dataflows. Our evaluation demonstrates that LEGO can\nachieve 3.2x speedup and 2.4x energy efficiency compared to previous work\nGemmini, and can generate one architecture for diverse modern foundation models\nin generative AI applications.",
      "url": "http://arxiv.org/abs/2509.12053v1",
      "published_time_eastern_timestamp": 1757950578.0
    },
    {
      "title": "Exploring Efficient Open-Vocabulary Segmentation in the Remote Sensing",
      "summary": "Open-Vocabulary Remote Sensing Image Segmentation (OVRSIS), an emerging task\nthat adapts Open-Vocabulary Segmentation (OVS) to the remote sensing (RS)\ndomain, remains underexplored due to the absence of a unified evaluation\nbenchmark and the domain gap between natural and RS images. To bridge these\ngaps, we first establish a standardized OVRSIS benchmark (\\textbf{OVRSISBench})\nbased on widely-used RS segmentation datasets, enabling consistent evaluation\nacross methods. Using this benchmark, we comprehensively evaluate several\nrepresentative OVS/OVRSIS models and reveal their limitations when directly\napplied to remote sensing scenarios. Building on these insights, we propose\n\\textbf{RSKT-Seg}, a novel open-vocabulary segmentation framework tailored for\nremote sensing. RSKT-Seg integrates three key components: (1) a\nMulti-Directional Cost Map Aggregation (RS-CMA) module that captures\nrotation-invariant visual cues by computing vision-language cosine similarities\nacross multiple directions; (2) an Efficient Cost Map Fusion (RS-Fusion)\ntransformer, which jointly models spatial and semantic dependencies with a\nlightweight dimensionality reduction strategy; and (3) a Remote Sensing\nKnowledge Transfer (RS-Transfer) module that injects pre-trained knowledge and\nfacilitates domain adaptation via enhanced upsampling. Extensive experiments on\nthe benchmark show that RSKT-Seg consistently outperforms strong OVS baselines\nby +3.8 mIoU and +5.9 mACC, while achieving 2x faster inference through\nefficient aggregation. Our code is\n\\href{https://github.com/LiBingyu01/RSKT-Seg}{\\textcolor{blue}{here}}.",
      "url": "http://arxiv.org/abs/2509.12040v1",
      "published_time_eastern_timestamp": 1757949889.0
    },
    {
      "title": "RAM++: Robust Representation Learning via Adaptive Mask for All-in-One\n  Image Restoration",
      "summary": "This work presents Robust Representation Learning via Adaptive Mask (RAM++),\na two-stage framework for all-in-one image restoration. RAM++ integrates\nhigh-level semantic understanding with low-level texture generation to achieve\ncontent-oriented robust restoration. It addresses the limitations of existing\ndegradation-oriented methods in extreme scenarios (e.g., degradations strongly\ncoupled with image structures). RAM++ also mitigates common challenges such as\nunbalanced performance across tasks, overfitting to seen degradations, and weak\ngeneralization to unseen ones through three key designs: 1) Adaptive\nSemantic-Aware Mask (AdaSAM): a pretraining strategy that applies pixel-level\nmasks to semantically rich and textured regions. This design enables the\nnetwork to learn both generative priors and image content priors from various\ndegradations. 2) Mask Attribute Conductance (MAC): a selective fine-tuning\nstrategy that adjusts the layers with higher contributions to bridge the\nintegrity gap between masked pretraining and full-image fine-tuning while\nretaining learned priors. 3) Robust Feature Regularization (RFR): a strategy\nthat leverages DINOv2's semantically consistent and degradation-invariant\nrepresentations, together with efficient feature fusion, to achieve faithful\nand semantically coherent restoration. With these designs, RAM++ achieves\nrobust, well-balanced, and state-of-the-art performance across seen, unseen,\nextreme, and mixed degradations. Our code and model will be released at\nhttps://github.com/DragonisCV/RAM",
      "url": "http://arxiv.org/abs/2509.12039v1",
      "published_time_eastern_timestamp": 1757949855.0
    }
  ]
}