{
  "last_updated": "2025-09-20T17:09:10.696309-04:00",
  "papers": [
    {
      "title": "Lost in Translation? Vocabulary Alignment for Source-Free Domain\n  Adaptation in Open-Vocabulary Semantic Segmentation",
      "summary": "We introduce VocAlign, a novel source-free domain adaptation framework\nspecifically designed for VLMs in open-vocabulary semantic segmentation. Our\nmethod adopts a student-teacher paradigm enhanced with a vocabulary alignment\nstrategy, which improves pseudo-label generation by incorporating additional\nclass concepts. To ensure efficiency, we use Low-Rank Adaptation (LoRA) to\nfine-tune the model, preserving its original capabilities while minimizing\ncomputational overhead. In addition, we propose a Top-K class selection\nmechanism for the student model, which significantly reduces memory\nrequirements while further improving adaptation performance. Our approach\nachieves a notable 6.11 mIoU improvement on the CityScapes dataset and\ndemonstrates superior performance on zero-shot segmentation benchmarks, setting\na new standard for source-free adaptation in the open-vocabulary setting.",
      "url": "http://arxiv.org/abs/2509.15225v1",
      "published_time_eastern_timestamp": 1758218398.0
    },
    {
      "title": "Calibration-Aware Prompt Learning for Medical Vision-Language Models",
      "summary": "Medical Vision-Language Models (Med-VLMs) have demonstrated remarkable\nperformance across diverse medical imaging tasks by leveraging large-scale\nimage-text pretraining. However, their confidence calibration is largely\nunexplored, and so remains a significant challenge. As such, miscalibrated\npredictions can lead to overconfident errors, undermining clinical trust and\ndecision-making reliability. To address this, we introduce CalibPrompt, the\nfirst framework to calibrate Med-VLMs during prompt tuning. CalibPrompt\noptimizes a small set of learnable prompts with carefully designed calibration\nobjectives under scarce labeled data regime. First, we study a regularizer that\nattempts to align the smoothed accuracy with the predicted model confidences.\nSecond, we introduce an angular separation loss to maximize textual feature\nproximity toward improving the reliability in confidence estimates of\nmultimodal Med-VLMs. Extensive experiments on four publicly available Med-VLMs\nand five diverse medical imaging datasets reveal that CalibPrompt consistently\nimproves calibration without drastically affecting clean accuracy. Our code is\navailable at https://github.com/iabh1shekbasu/CalibPrompt.",
      "url": "http://arxiv.org/abs/2509.15226v1",
      "published_time_eastern_timestamp": 1758218398.0
    },
    {
      "title": "Depth AnyEvent: A Cross-Modal Distillation Paradigm for Event-Based\n  Monocular Depth Estimation",
      "summary": "Event cameras capture sparse, high-temporal-resolution visual information,\nmaking them particularly suitable for challenging environments with high-speed\nmotion and strongly varying lighting conditions. However, the lack of large\ndatasets with dense ground-truth depth annotations hinders learning-based\nmonocular depth estimation from event data. To address this limitation, we\npropose a cross-modal distillation paradigm to generate dense proxy labels\nleveraging a Vision Foundation Model (VFM). Our strategy requires an event\nstream spatially aligned with RGB frames, a simple setup even available\noff-the-shelf, and exploits the robustness of large-scale VFMs. Additionally,\nwe propose to adapt VFMs, either a vanilla one like Depth Anything v2 (DAv2),\nor deriving from it a novel recurrent architecture to infer depth from\nmonocular event cameras. We evaluate our approach with synthetic and real-world\ndatasets, demonstrating that i) our cross-modal paradigm achieves competitive\nperformance compared to fully supervised methods without requiring expensive\ndepth annotations, and ii) our VFM-based models achieve state-of-the-art\nperformance.",
      "url": "http://arxiv.org/abs/2509.15224v1",
      "published_time_eastern_timestamp": 1758218391.0
    },
    {
      "title": "ScaleCUA: Scaling Open-Source Computer Use Agents with Cross-Platform\n  Data",
      "summary": "Vision-Language Models (VLMs) have enabled computer use agents (CUAs) that\noperate GUIs autonomously, showing great potential, yet progress is limited by\nthe lack of large-scale, open-source computer use data and foundation models.\nIn this work, we introduce ScaleCUA, a step toward scaling open-source CUAs. It\noffers a large-scale dataset spanning 6 operating systems and 3 task domains,\nbuilt via a closed-loop pipeline uniting automated agents with human experts.\nTrained on this scaled-up data, ScaleCUA can operate seamlessly across\nplatforms. Specifically, it delivers strong gains over baselines (+26.6 on\nWebArena-Lite-v2, +10.7 on ScreenSpot-Pro) and sets new state-of-the-art\nresults (94.4% on MMBench-GUI L1-Hard, 60.6% on OSWorld-G, 47.4% on\nWebArena-Lite-v2). These findings underscore the power of data-driven scaling\nfor general-purpose computer use agents. We will release data, models, and code\nto advance future research: https://github.com/OpenGVLab/ScaleCUA.",
      "url": "http://arxiv.org/abs/2509.15221v1",
      "published_time_eastern_timestamp": 1758218362.0
    },
    {
      "title": "Lightweight and Accurate Multi-View Stereo with Confidence-Aware\n  Diffusion Model",
      "summary": "To reconstruct the 3D geometry from calibrated images, learning-based\nmulti-view stereo (MVS) methods typically perform multi-view depth estimation\nand then fuse depth maps into a mesh or point cloud. To improve the\ncomputational efficiency, many methods initialize a coarse depth map and then\ngradually refine it in higher resolutions. Recently, diffusion models achieve\ngreat success in generation tasks. Starting from a random noise, diffusion\nmodels gradually recover the sample with an iterative denoising process. In\nthis paper, we propose a novel MVS framework, which introduces diffusion models\nin MVS. Specifically, we formulate depth refinement as a conditional diffusion\nprocess. Considering the discriminative characteristic of depth estimation, we\ndesign a condition encoder to guide the diffusion process. To improve\nefficiency, we propose a novel diffusion network combining lightweight 2D U-Net\nand convolutional GRU. Moreover, we propose a novel confidence-based sampling\nstrategy to adaptively sample depth hypotheses based on the confidence\nestimated by diffusion model. Based on our novel MVS framework, we propose two\nnovel MVS methods, DiffMVS and CasDiffMVS. DiffMVS achieves competitive\nperformance with state-of-the-art efficiency in run-time and GPU memory.\nCasDiffMVS achieves state-of-the-art performance on DTU, Tanks & Temples and\nETH3D. Code is available at: https://github.com/cvg/diffmvs.",
      "url": "http://arxiv.org/abs/2509.15220v1",
      "published_time_eastern_timestamp": 1758218359.0
    },
    {
      "title": "LNE-Blocking: An Efficient Framework for Contamination Mitigation\n  Evaluation on Large Language Models",
      "summary": "The problem of data contamination is now almost inevitable during the\ndevelopment of large language models (LLMs), with the training data commonly\nintegrating those evaluation benchmarks even unintentionally. This problem\nsubsequently makes it hard to benchmark LLMs fairly. Instead of constructing\ncontamination-free datasets (quite hard), we propose a novel framework,\n\\textbf{LNE-Blocking}, to restore model performance prior to contamination on\npotentially leaked datasets. Our framework consists of two components:\ncontamination detection and disruption operation. For the prompt, the framework\nfirst uses the contamination detection method, \\textbf{LNE}, to assess the\nextent of contamination in the model. Based on this, it adjusts the intensity\nof the disruption operation, \\textbf{Blocking}, to elicit non-memorized\nresponses from the model. Our framework is the first to efficiently restore the\nmodel's greedy decoding performance. This comes with a strong performance on\nmultiple datasets with potential leakage risks, and it consistently achieves\nstable recovery results across different models and varying levels of data\ncontamination. We release the code at https://github.com/RuijieH/LNE-Blocking\nto facilitate research.",
      "url": "http://arxiv.org/abs/2509.15218v1",
      "published_time_eastern_timestamp": 1758218356.0
    },
    {
      "title": "Out-of-Sight Trajectories: Tracking, Fusion, and Prediction",
      "summary": "Trajectory prediction is a critical task in computer vision and autonomous\nsystems, playing a key role in autonomous driving, robotics, surveillance, and\nvirtual reality. Existing methods often rely on complete and noise-free\nobservational data, overlooking the challenges associated with out-of-sight\nobjects and the inherent noise in sensor data caused by limited camera\ncoverage, obstructions, and the absence of ground truth for denoised\ntrajectories. These limitations pose safety risks and hinder reliable\nprediction in real-world scenarios. In this extended work, we present\nadvancements in Out-of-Sight Trajectory (OST), a novel task that predicts the\nnoise-free visual trajectories of out-of-sight objects using noisy sensor data.\nBuilding on our previous research, we broaden the scope of Out-of-Sight\nTrajectory Prediction (OOSTraj) to include pedestrians and vehicles, extending\nits applicability to autonomous driving, robotics, surveillance, and virtual\nreality. Our enhanced Vision-Positioning Denoising Module leverages camera\ncalibration to establish a vision-positioning mapping, addressing the lack of\nvisual references, while effectively denoising noisy sensor data in an\nunsupervised manner. Through extensive evaluations on the Vi-Fi and JRDB\ndatasets, our approach achieves state-of-the-art performance in both trajectory\ndenoising and prediction, significantly surpassing previous baselines.\nAdditionally, we introduce comparisons with traditional denoising methods, such\nas Kalman filtering, and adapt recent trajectory prediction models to our task,\nproviding a comprehensive benchmark. This work represents the first initiative\nto integrate vision-positioning projection for denoising noisy sensor\ntrajectories of out-of-sight agents, paving the way for future advances. The\ncode and preprocessed datasets are available at github.com/Hai-chao-Zhang/OST",
      "url": "http://arxiv.org/abs/2509.15219v1",
      "published_time_eastern_timestamp": 1758218356.0
    },
    {
      "title": "Geometric Image Synchronization with Deep Watermarking",
      "summary": "Synchronization is the task of estimating and inverting geometric\ntransformations (e.g., crop, rotation) applied to an image. This work\nintroduces SyncSeal, a bespoke watermarking method for robust image\nsynchronization, which can be applied on top of existing watermarking methods\nto enhance their robustness against geometric transformations. It relies on an\nembedder network that imperceptibly alters images and an extractor network that\npredicts the geometric transformation to which the image was subjected. Both\nnetworks are end-to-end trained to minimize the error between the predicted and\nground-truth parameters of the transformation, combined with a discriminator to\nmaintain high perceptual quality. We experimentally validate our method on a\nwide variety of geometric and valuemetric transformations, demonstrating its\neffectiveness in accurately synchronizing images. We further show that our\nsynchronization can effectively upgrade existing watermarking methods to\nwithstand geometric transformations to which they were previously vulnerable.",
      "url": "http://arxiv.org/abs/2509.15208v1",
      "published_time_eastern_timestamp": 1758218214.0
    },
    {
      "title": "FlowRL: Matching Reward Distributions for LLM Reasoning",
      "summary": "We propose FlowRL: matching the full reward distribution via flow balancing\ninstead of maximizing rewards in large language model (LLM) reinforcement\nlearning (RL). Recent advanced reasoning models adopt reward-maximizing methods\n(\\eg, PPO and GRPO), which tend to over-optimize dominant reward signals while\nneglecting less frequent but valid reasoning paths, thus reducing diversity. In\ncontrast, we transform scalar rewards into a normalized target distribution\nusing a learnable partition function, and then minimize the reverse KL\ndivergence between the policy and the target distribution. We implement this\nidea as a flow-balanced optimization method that promotes diverse exploration\nand generalizable reasoning trajectories. We conduct experiments on math and\ncode reasoning tasks: FlowRL achieves a significant average improvement of\n$10.0\\%$ over GRPO and $5.1\\%$ over PPO on math benchmarks, and performs\nconsistently better on code reasoning tasks. These results highlight reward\ndistribution-matching as a key step toward efficient exploration and diverse\nreasoning in LLM reinforcement learning.",
      "url": "http://arxiv.org/abs/2509.15207v1",
      "published_time_eastern_timestamp": 1758218196.0
    },
    {
      "title": "Circuit-based chatacterization of finite-temperature quantum phases and\n  self-correcting quantum memory",
      "summary": "Quantum phases at zero temperature can be characterized as equivalence\nclasses under local unitary transformations: two ground states within a gapped\nphase can be transformed into each other via a local unitary circuit. We\ngeneralize this circuit-based characterization of phases to systems at\nfinite-temperature thermal equilibrium described by Gibbs states. We construct\na channel circuit that approximately transforms one Gibbs state into another\nprovided the two are connected by a path in parameter space along which a\ncertain correlation-decay condition holds. For finite-dimensional systems of\nlinear size $L$ and approximation error $\\epsilon$, the locality of the circuit\nis ${\\rm polylog}({\\rm poly}(L)/\\epsilon)$. The correlation-decay condition,\nwhich we specify, is expected to be satisfied in the interior of many\nnoncritical thermal phases, including those displaying discrete symmetry\nbreaking and topological order. As an application, we show that any system in\nthe same thermal phase as a zero-temperature topological code coherently\npreserves quantum information for a macroscopically long time, establishing\nself-correction as a universal property of thermal phases. As part of the\nproof, we provide explicit encoding and decoding channel circuits to encode\ninformation into, and decode it from, a system in thermal equilibrium.",
      "url": "http://arxiv.org/abs/2509.15204v1",
      "published_time_eastern_timestamp": 1758218115.0
    }
  ]
}