{
  "last_updated": "2025-08-07T21:04:55.800815-04:00",
  "papers": [
    {
      "title": "SEAgent: Self-Evolving Computer Use Agent with Autonomous Learning from\n  Experience",
      "summary": "Repurposing large vision-language models (LVLMs) as computer use agents\n(CUAs) has led to substantial breakthroughs, primarily driven by human-labeled\ndata. However, these models often struggle with novel and specialized software,\nparticularly in scenarios lacking human annotations. To address this challenge,\nwe propose SEAgent, an agentic self-evolving framework enabling CUAs to\nautonomously evolve through interactions with unfamiliar software.\nSpecifically, SEAgent empowers computer-use agents to autonomously master novel\nsoftware environments via experiential learning, where agents explore new\nsoftware, learn through iterative trial-and-error, and progressively tackle\nauto-generated tasks organized from simple to complex. To achieve this goal, we\ndesign a World State Model for step-wise trajectory assessment, along with a\nCurriculum Generator that generates increasingly diverse and challenging tasks.\nThe agent's policy is updated through experiential learning, comprised of\nadversarial imitation of failure actions and Group Relative Policy Optimization\n(GRPO) on successful ones. Furthermore, we introduce a specialist-to-generalist\ntraining strategy that integrates individual experiential insights from\nspecialist agents, facilitating the development of a stronger generalist CUA\ncapable of continuous autonomous evolution. This unified agent ultimately\nachieves performance surpassing ensembles of individual specialist agents on\ntheir specialized software. We validate the effectiveness of SEAgent across\nfive novel software environments within OS-World. Our approach achieves a\nsignificant improvement of 23.2% in success rate, from 11.3% to 34.5%, over a\ncompetitive open-source CUA, i.e., UI-TARS.",
      "url": "http://arxiv.org/abs/2508.04700v1",
      "published_time_eastern_timestamp": 1754503126.0
    },
    {
      "title": "Finite 2-group gauge theory and its 3+1D lattice realization",
      "summary": "In this work, we employ the Tannaka-Krein reconstruction to compute the\nquantum double $\\mathcal D(\\mathcal G)$ of a finite 2-group $\\mathcal G$ as a\nHopf monoidal category. We also construct a 3+1D lattice model from the\nDijkgraaf-Witten TQFT functor for the 2-group $\\mathcal G$, generalizing\nKitaev's 2+1D quantum double model. Notably, the string-like local operators in\nthis lattice model are shown to form $\\mathcal D(\\mathcal G)$. Specializing to\n$\\mathcal G = \\mathbb{Z}_2$, we demonstrate that the topological defects in the\n3+1D toric code model are modules over $\\mathcal D(\\mathbb{Z}_2)$.",
      "url": "http://arxiv.org/abs/2508.04693v1",
      "published_time_eastern_timestamp": 1754502976.0
    },
    {
      "title": "From MAS to MARS: Coordination Failures and Reasoning Trade-offs in\n  Hierarchical Multi-Agent Robotic Systems within a Healthcare Scenario",
      "summary": "Multi-agent robotic systems (MARS) build upon multi-agent systems by\nintegrating physical and task-related constraints, increasing the complexity of\naction execution and agent coordination. However, despite the availability of\nadvanced multi-agent frameworks, their real-world deployment on robots remains\nlimited, hindering the advancement of MARS research in practice. To bridge this\ngap, we conducted two studies to investigate performance trade-offs of\nhierarchical multi-agent frameworks in a simulated real-world multi-robot\nhealthcare scenario. In Study 1, using CrewAI, we iteratively refine the\nsystem's knowledge base, to systematically identify and categorize coordination\nfailures (e.g., tool access violations, lack of timely handling of failure\nreports) not resolvable by providing contextual knowledge alone. In Study 2,\nusing AutoGen, we evaluate a redesigned bidirectional communication structure\nand further measure the trade-offs between reasoning and non-reasoning models\noperating within the same robotic team setting. Drawing from our empirical\nfindings, we emphasize the tension between autonomy and stability and the\nimportance of edge-case testing to improve system reliability and safety for\nfuture real-world deployment. Supplementary materials, including codes, task\nagent setup, trace outputs, and annotated examples of coordination failures and\nreasoning behaviors, are available at:\nhttps://byc-sophie.github.io/mas-to-mars/.",
      "url": "http://arxiv.org/abs/2508.04691v1",
      "published_time_eastern_timestamp": 1754502850.0
    },
    {
      "title": "Time-dependent response of protoplanetary disk temperature to an FU\n  Ori-type luminosity outburst",
      "summary": "Context. The most prominent cases of young star variability are accretion\noutbursts in FU Ori-type systems. The high power of such outbursts causes\ndramatic changes in the physical and chemical structure of a surrounding\nprotoplanetary disk. As characteristic thermal timescales in the disk are\ncomparable to the duration of the outburst, the response of its thermal\nstructure is inherently time dependent.\n  Aims. We analyzed how the disk thermal structure evolves under the\nsubstantial-yet transient-eating of the outburst. To cover different possible\nphysical mechanisms driving the outburst, we examined two scenarios: one in\nwhich the increased accretion rate is confined to a compact sub-au inner region\nand the other where it affects the entire disk.\n  Methods. To model the disk temperature response to the outburst we performed\ntime-dependent radiation transfer using the HURAKAN code. The disk structure\nand the luminosity profile roughly correspond to those of the FU Ori system\nitself, which went into outburst about 90 years ago and reached a luminosity of\n450 L_Sun.\n  Results. We find that optically thick disk regions require several years to\nbecome fully heated during the outburst and a decade to cool after it. The\nupper layers and outer parts of the disk, which are optically thin to thermal\nradiation, are heated and cooled almost instantaneously. This creates an\nunusual radial temperature profile during the early heating phase with minima\nat several au both for the fully active and compact active disk scenarios. At\nthe cooling phase, upper layers being colder than the midplane for both\nscenarios. Near- and mid-infrared SEDs demonstrate a significant and almost\ninstantaneous rise by 1 - 2 orders of magnitude during the outburst, while the\nmillimeter flux shows a change of only a factor of a few, and is slightly\ndelayed with respect to the central region luminosity profile.",
      "url": "http://arxiv.org/abs/2508.04686v1",
      "published_time_eastern_timestamp": 1754502589.0
    },
    {
      "title": "GeRe: Towards Efficient Anti-Forgetting in Continual Learning of LLM via\n  General Samples Replay",
      "summary": "The continual learning capability of large language models (LLMs) is crucial\nfor advancing artificial general intelligence. However, continual fine-tuning\nLLMs across various domains often suffers from catastrophic forgetting,\ncharacterized by: 1) significant forgetting of their general capabilities, and\n2) sharp performance declines in previously learned tasks. To simultaneously\naddress both issues in a simple yet stable manner, we propose General Sample\nReplay (GeRe), a framework that use usual pretraining texts for efficient\nanti-forgetting. Beyond revisiting the most prevalent replay-based practices\nunder GeRe, we further leverage neural states to introduce a enhanced\nactivation states constrained optimization method using threshold-based margin\n(TM) loss, which maintains activation state consistency during replay learning.\nWe are the first to validate that a small, fixed set of pre-collected general\nreplay samples is sufficient to resolve both concerns--retaining general\ncapabilities while promoting overall performance across sequential tasks.\nIndeed, the former can inherently facilitate the latter. Through controlled\nexperiments, we systematically compare TM with different replay strategies\nunder the GeRe framework, including vanilla label fitting, logit imitation via\nKL divergence and feature imitation via L1/L2 losses. Results demonstrate that\nTM consistently improves performance and exhibits better robustness. Our work\npaves the way for efficient replay of LLMs for the future. Our code and data\nare available at https://github.com/Qznan/GeRe.",
      "url": "http://arxiv.org/abs/2508.04676v1",
      "published_time_eastern_timestamp": 1754502142.0
    },
    {
      "title": "How are CS students using resources and AI tools for coding tasks?",
      "summary": "A survey of 26 CS students reveals that AI coding assistants are mainly used\nfor writing code (second to online searches) while AI chatbots are the top\nresource for debugging. Participants with different coding experience prefer\nonline help over direct human help from peers and instructors.",
      "url": "http://arxiv.org/abs/2508.04667v1",
      "published_time_eastern_timestamp": 1754501755.0
    },
    {
      "title": "PixCuboid: Room Layout Estimation from Multi-view Featuremetric\n  Alignment",
      "summary": "Coarse room layout estimation provides important geometric cues for many\ndownstream tasks. Current state-of-the-art methods are predominantly based on\nsingle views and often assume panoramic images. We introduce PixCuboid, an\noptimization-based approach for cuboid-shaped room layout estimation, which is\nbased on multi-view alignment of dense deep features. By training with the\noptimization end-to-end, we learn feature maps that yield large convergence\nbasins and smooth loss landscapes in the alignment. This allows us to\ninitialize the room layout using simple heuristics.\n  For the evaluation we propose two new benchmarks based on ScanNet++ and\n2D-3D-Semantics, with manually verified ground truth 3D cuboids. In thorough\nexperiments we validate our approach and significantly outperform the\ncompetition. Finally, while our network is trained with single cuboids, the\nflexibility of the optimization-based approach allow us to easily extend to\nmulti-room estimation, e.g. larger apartments or offices. Code and model\nweights are available at https://github.com/ghanning/PixCuboid.",
      "url": "http://arxiv.org/abs/2508.04659v1",
      "published_time_eastern_timestamp": 1754501270.0
    },
    {
      "title": "X-SAM: From Segment Anything to Any Segmentation",
      "summary": "Large Language Models (LLMs) demonstrate strong capabilities in broad\nknowledge representation, yet they are inherently deficient in pixel-level\nperceptual understanding. Although the Segment Anything Model (SAM) represents\na significant advancement in visual-prompt-driven image segmentation, it\nexhibits notable limitations in multi-mask prediction and category-specific\nsegmentation tasks, and it cannot integrate all segmentation tasks within a\nunified model architecture. To address these limitations, we present X-SAM, a\nstreamlined Multimodal Large Language Model (MLLM) framework that extends the\nsegmentation paradigm from \\textit{segment anything} to \\textit{any\nsegmentation}. Specifically, we introduce a novel unified framework that\nenables more advanced pixel-level perceptual comprehension for MLLMs.\nFurthermore, we propose a new segmentation task, termed Visual GrounDed (VGD)\nsegmentation, which segments all instance objects with interactive visual\nprompts and empowers MLLMs with visual grounded, pixel-wise interpretative\ncapabilities. To enable effective training on diverse data sources, we present\na unified training strategy that supports co-training across multiple datasets.\nExperimental results demonstrate that X-SAM achieves state-of-the-art\nperformance on a wide range of image segmentation benchmarks, highlighting its\nefficiency for multimodal, pixel-level visual understanding. Code is available\nat https://github.com/wanghao9610/X-SAM.",
      "url": "http://arxiv.org/abs/2508.04655v1",
      "published_time_eastern_timestamp": 1754500750.0
    },
    {
      "title": "LLM Collaboration With Multi-Agent Reinforcement Learning",
      "summary": "A large amount of work has been done in Multi-Agent Systems (MAS) for\nmodeling and solving problems with multiple interacting agents. However, most\nLLMs are pretrained independently and not specifically optimized for\ncoordination. Existing LLM fine-tuning frameworks rely on individual rewards,\nwhich require complex reward designs for each agent to encourage collaboration.\nTo address these challenges, we model LLM collaboration as a cooperative\nMulti-Agent Reinforcement Learning (MARL) problem. We develop a multi-agent,\nmulti-turn algorithm, Multi-Agent Group Relative Policy Optimization (MAGRPO),\nto solve it, building on current RL approaches for LLMs as well as MARL\ntechniques. Our experiments on LLM writing and coding collaboration demonstrate\nthat fine-tuning MAS with MAGRPO enables agents to generate high-quality\nresponses efficiently through effective cooperation. Our approach opens the\ndoor to using other MARL methods for LLMs and highlights the associated\nchallenges.",
      "url": "http://arxiv.org/abs/2508.04652v1",
      "published_time_eastern_timestamp": 1754500705.0
    },
    {
      "title": "IFDECORATOR: Wrapping Instruction Following Reinforcement Learning with\n  Verifiable Rewards",
      "summary": "Reinforcement Learning with Verifiable Rewards (RLVR) improves instruction\nfollowing capabilities of large language models (LLMs), but suffers from\ntraining inefficiency due to inadequate difficulty assessment. Moreover, RLVR\nis prone to over-optimization, where LLMs exploit verification shortcuts\nwithout aligning to the actual intent of user instructions. We introduce\nInstruction Following Decorator (IFDecorator}, a framework that wraps RLVR\ntraining into a robust and sample-efficient pipeline. It consists of three\ncomponents: (1) a cooperative-adversarial data flywheel that co-evolves\ninstructions and hybrid verifications, generating progressively more\nchallenging instruction-verification pairs; (2) IntentCheck, a bypass module\nenforcing intent alignment; and (3) trip wires, a diagnostic mechanism that\ndetects reward hacking via trap instructions, which trigger and capture\nshortcut exploitation behaviors. Our Qwen2.5-32B-Instruct-IFDecorator achieves\n87.43% accuracy on IFEval, outperforming larger proprietary models such as\nGPT-4o. Additionally, we demonstrate substantial improvements on FollowBench\nwhile preserving general capabilities. Our trip wires show significant\nreductions in reward hacking rates. We will release models, code, and data for\nfuture research.",
      "url": "http://arxiv.org/abs/2508.04632v1",
      "published_time_eastern_timestamp": 1754499654.0
    },
    {
      "title": "HiD-VAE: Interpretable Generative Recommendation via Hierarchical and\n  Disentangled Semantic IDs",
      "summary": "Recommender systems are indispensable for helping users navigate the immense\nitem catalogs of modern online platforms. Recently, generative recommendation\nhas emerged as a promising paradigm, unifying the conventional\nretrieve-and-rank pipeline into an end-to-end model capable of dynamic\ngeneration. However, existing generative methods are fundamentally constrained\nby their unsupervised tokenization, which generates semantic IDs suffering from\ntwo critical flaws: (1) they are semantically flat and uninterpretable, lacking\na coherent hierarchy, and (2) they are prone to representation entanglement\n(i.e., ``ID collisions''), which harms recommendation accuracy and diversity.\nTo overcome these limitations, we propose HiD-VAE, a novel framework that\nlearns hierarchically disentangled item representations through two core\ninnovations. First, HiD-VAE pioneers a hierarchically-supervised quantization\nprocess that aligns discrete codes with multi-level item tags, yielding more\nuniform and disentangled IDs. Crucially, the trained codebooks can predict\nhierarchical tags, providing a traceable and interpretable semantic path for\neach recommendation. Second, to combat representation entanglement, HiD-VAE\nincorporates a novel uniqueness loss that directly penalizes latent space\noverlap. This mechanism not only resolves the critical ID collision problem but\nalso promotes recommendation diversity by ensuring a more comprehensive\nutilization of the item representation space. These high-quality, disentangled\nIDs provide a powerful foundation for downstream generative models. Extensive\nexperiments on three public benchmarks validate HiD-VAE's superior performance\nagainst state-of-the-art methods. The code is available at\nhttps://anonymous.4open.science/r/HiD-VAE-84B2.",
      "url": "http://arxiv.org/abs/2508.04618v1",
      "published_time_eastern_timestamp": 1754498705.0
    },
    {
      "title": "OmniDepth: Bridging Monocular and Stereo Reasoning with Latent Alignment",
      "summary": "Monocular and stereo depth estimation offer complementary strengths:\nmonocular methods capture rich contextual priors but lack geometric precision,\nwhile stereo approaches leverage epipolar geometry yet struggle with\nambiguities such as reflective or textureless surfaces. Despite post-hoc\nsynergies, these paradigms remain largely disjoint in practice. We introduce\nOmniDepth, a unified framework that bridges both through iterative\nbidirectional alignment of their latent representations. At its core, a novel\ncross-attentive alignment mechanism dynamically synchronizes monocular\ncontextual cues with stereo hypothesis representations during stereo reasoning.\nThis mutual alignment resolves stereo ambiguities (e.g., specular surfaces) by\ninjecting monocular structure priors while refining monocular depth with stereo\ngeometry within a single network. Extensive experiments demonstrate\nstate-of-the-art results: \\textbf{OmniDepth reduces zero-shot generalization\nerror by $\\!>\\!40\\%$ on Middlebury and ETH3D}, while addressing longstanding\nfailures on transparent and reflective surfaces. By harmonizing multi-view\ngeometry with monocular context, OmniDepth enables robust 3D perception that\ntranscends modality-specific limitations. Codes available at\nhttps://github.com/aeolusguan/OmniDepth.",
      "url": "http://arxiv.org/abs/2508.04611v1",
      "published_time_eastern_timestamp": 1754497882.0
    },
    {
      "title": "$NavA^3$: Understanding Any Instruction, Navigating Anywhere, Finding\n  Anything",
      "summary": "Embodied navigation is a fundamental capability of embodied intelligence,\nenabling robots to move and interact within physical environments. However,\nexisting navigation tasks primarily focus on predefined object navigation or\ninstruction following, which significantly differs from human needs in\nreal-world scenarios involving complex, open-ended scenes. To bridge this gap,\nwe introduce a challenging long-horizon navigation task that requires\nunderstanding high-level human instructions and performing spatial-aware object\nnavigation in real-world environments. Existing embodied navigation methods\nstruggle with such tasks due to their limitations in comprehending high-level\nhuman instructions and localizing objects with an open vocabulary. In this\npaper, we propose $NavA^3$, a hierarchical framework divided into two stages:\nglobal and local policies. In the global policy, we leverage the reasoning\ncapabilities of Reasoning-VLM to parse high-level human instructions and\nintegrate them with global 3D scene views. This allows us to reason and\nnavigate to regions most likely to contain the goal object. In the local\npolicy, we have collected a dataset of 1.0 million samples of spatial-aware\nobject affordances to train the NaviAfford model (PointingVLM), which provides\nrobust open-vocabulary object localization and spatial awareness for precise\ngoal identification and navigation in complex environments. Extensive\nexperiments demonstrate that $NavA^3$ achieves SOTA results in navigation\nperformance and can successfully complete longhorizon navigation tasks across\ndifferent robot embodiments in real-world settings, paving the way for\nuniversal embodied navigation. The dataset and code will be made available.\nProject website: https://NavigationA3.github.io/.",
      "url": "http://arxiv.org/abs/2508.04598v1",
      "published_time_eastern_timestamp": 1754497054.0
    },
    {
      "title": "Knowledge to Sight: Reasoning over Visual Attributes via Knowledge\n  Decomposition for Abnormality Grounding",
      "summary": "In this work, we address the problem of grounding abnormalities in medical\nimages, where the goal is to localize clinical findings based on textual\ndescriptions. While generalist Vision-Language Models (VLMs) excel in natural\ngrounding tasks, they often struggle in the medical domain due to rare,\ncompositional, and domain-specific terms that are poorly aligned with visual\npatterns. Specialized medical VLMs address this challenge via large-scale\ndomain pretraining, but at the cost of substantial annotation and computational\nresources. To overcome these limitations, we propose \\textbf{Knowledge to Sight\n(K2Sight)}, a framework that introduces structured semantic supervision by\ndecomposing clinical concepts into interpretable visual attributes, such as\nshape, density, and anatomical location. These attributes are distilled from\ndomain ontologies and encoded into concise instruction-style prompts, which\nguide region-text alignment during training. Unlike conventional report-level\nsupervision, our approach explicitly bridges domain knowledge and spatial\nstructure, enabling data-efficient training of compact models. We train compact\nmodels with 0.23B and 2B parameters using only 1.5\\% of the data required by\nstate-of-the-art medical VLMs. Despite their small size and limited training\ndata, these models achieve performance on par with or better than 7B+ medical\nVLMs, with up to 9.82\\% improvement in $mAP_{50}$. Code and models:\n\\href{https://lijunrio.github.io/K2Sight/}{\\textcolor{SOTAPink}{https://lijunrio.github.io/K2Sight/}}.",
      "url": "http://arxiv.org/abs/2508.04572v1",
      "published_time_eastern_timestamp": 1754495684.0
    },
    {
      "title": "DDTracking: A Deep Generative Framework for Diffusion MRI Tractography\n  with Streamline Local-Global Spatiotemporal Modeling",
      "summary": "This paper presents DDTracking, a novel deep generative framework for\ndiffusion MRI tractography that formulates streamline propagation as a\nconditional denoising diffusion process. In DDTracking, we introduce a\ndual-pathway encoding network that jointly models local spatial encoding\n(capturing fine-scale structural details at each streamline point) and global\ntemporal dependencies (ensuring long-range consistency across the entire\nstreamline). Furthermore, we design a conditional diffusion model module, which\nleverages the learned local and global embeddings to predict streamline\npropagation orientations for tractography in an end-to-end trainable manner. We\nconduct a comprehensive evaluation across diverse, independently acquired dMRI\ndatasets, including both synthetic and clinical data. Experiments on two\nwell-established benchmarks with ground truth (ISMRM Challenge and\nTractoInferno) demonstrate that DDTracking largely outperforms current\nstate-of-the-art tractography methods. Furthermore, our results highlight\nDDTracking's strong generalizability across heterogeneous datasets, spanning\nvarying health conditions, age groups, imaging protocols, and scanner types.\nCollectively, DDTracking offers anatomically plausible and robust tractography,\npresenting a scalable, adaptable, and end-to-end learnable solution for broad\ndMRI applications. Code is available at:\nhttps://github.com/yishengpoxiao/DDtracking.git",
      "url": "http://arxiv.org/abs/2508.04568v1",
      "published_time_eastern_timestamp": 1754495471.0
    },
    {
      "title": "Analyzing and Mitigating Object Hallucination: A Training Bias\n  Perspective",
      "summary": "As scaling up training data has significantly improved the general multimodal\ncapabilities of Large Vision-Language Models (LVLMs), they still suffer from\nthe hallucination issue, generating text that is inconsistent with the visual\ninput. This phenomenon motivates us to systematically investigate the role of\ntraining data in hallucination. We introduce a new benchmark, POPEv2, which\nconsists of counterfactual images collected from the training data of LVLMs\nwith certain objects masked. Through comprehensive evaluation on POPEv2, we\nfind that current LVLMs suffer from training bias: they fail to fully leverage\ntheir training data and hallucinate more frequently on images seen during\ntraining. Specifically, they perform poorly on counterfactual images, often\nincorrectly answering ``Yes'' to questions about masked objects. To understand\nthis issue, we conduct probing experiments on the models' internal components,\nrevealing that this training bias is primarily located in the language modeling\n(LM) head. Based on these findings, we propose Obliviate, an efficient and\nlightweight unlearning method designed to mitigate object hallucination via\ntraining bias unlearning. Obliviate identifies the discrepancy between\nground-truth labels and model outputs on the training data as a proxy for bias\nand adopts a parameter- and data-efficient fine-tuning strategy that only\nupdates the LM head. Extensive experiments demonstrate the effectiveness of our\napproach. While only reusing the training data and updating approximately 2\\%\nof the parameters, Obliviate significantly reduces hallucination across both\ndiscriminative and generative tasks. Furthermore, it demonstrates strong\nscalability with respect to both model size (2B to 72B) and training data\nvolume, and exhibits promising generalization to hallucination types beyond\nobject-level hallucination. Our code and data will be publicly released.",
      "url": "http://arxiv.org/abs/2508.04567v1",
      "published_time_eastern_timestamp": 1754495462.0
    },
    {
      "title": "MSC: A Marine Wildlife Video Dataset with Grounded Segmentation and\n  Clip-Level Captioning",
      "summary": "Marine videos present significant challenges for video understanding due to\nthe dynamics of marine objects and the surrounding environment, camera motion,\nand the complexity of underwater scenes. Existing video captioning datasets,\ntypically focused on generic or human-centric domains, often fail to generalize\nto the complexities of the marine environment and gain insights about marine\nlife. To address these limitations, we propose a two-stage marine\nobject-oriented video captioning pipeline. We introduce a comprehensive video\nunderstanding benchmark that leverages the triplets of video, text, and\nsegmentation masks to facilitate visual grounding and captioning, leading to\nimproved marine video understanding and analysis, and marine video generation.\nAdditionally, we highlight the effectiveness of video splitting in order to\ndetect salient object transitions in scene changes, which significantly enrich\nthe semantics of captioning content. Our dataset and code have been released at\nhttps://msc.hkustvgd.com.",
      "url": "http://arxiv.org/abs/2508.04549v1",
      "published_time_eastern_timestamp": 1754494464.0
    },
    {
      "title": "Hierarchical Event Memory for Accurate and Low-latency Online Video\n  Temporal Grounding",
      "summary": "In this paper, we tackle the task of online video temporal grounding (OnVTG),\nwhich requires the model to locate events related to a given text query within\na video stream. Unlike regular video temporal grounding, OnVTG requires the\nmodel to make predictions without observing future frames. As online videos are\nstreaming inputs and can go on indefinitely, it is impractical and inefficient\nto store all historical inputs. The existing OnVTG models employ memory to\nstore recent historical video frame features and predict scores indicating\nwhether the current frame corresponds to the start or end time of the target\nevent. However, these methods lack effective event modeling and cannot retain\nlong-term historical information, leading to low performance. To tackle these\nchallenges, we propose a hierarchical event memory for OnVTG. We propose an\nevent-based OnVTG framework that makes predictions based on event proposals\nthat model event-level information with various durations. To preserve\nhistorically valuable event information, we introduce a hierarchical event\nmemory that retains historical events, allowing the model to access both recent\nand long-term information. To enable the real-time prediction, we further\npropose a future prediction branch that predicts whether the target event will\noccur shortly and further regresses the start time of the event. We achieve\nstate-of-the-art performance on the TACoS, ActivityNet Captions, and MAD\ndatasets. Code is available at https://github.com/minghangz/OnVTG.",
      "url": "http://arxiv.org/abs/2508.04546v1",
      "published_time_eastern_timestamp": 1754494429.0
    },
    {
      "title": "InceptoFormer: A Multi-Signal Neural Framework for Parkinson's Disease\n  Severity Evaluation from Gait",
      "summary": "We present InceptoFormer, a multi-signal neural framework designed for\nParkinson's Disease (PD) severity evaluation via gait dynamics analysis. Our\narchitecture introduces a 1D adaptation of the Inception model, which we refer\nto as Inception1D, along with a Transformer-based framework to stage PD\nseverity according to the Hoehn and Yahr (H&Y) scale. The Inception1D component\ncaptures multi-scale temporal features by employing parallel 1D convolutional\nfilters with varying kernel sizes, thereby extracting features across multiple\ntemporal scales. The transformer component efficiently models long-range\ndependencies within gait sequences, providing a comprehensive understanding of\nboth local and global patterns. To address the issue of class imbalance in PD\nseverity staging, we propose a data structuring and preprocessing strategy\nbased on oversampling to enhance the representation of underrepresented\nseverity levels. The overall design enables to capture fine-grained temporal\nvariations and global dynamics in gait signal, significantly improving\nclassification performance for PD severity evaluation. Through extensive\nexperimentation, InceptoFormer achieves an accuracy of 96.6%, outperforming\nexisting state-of-the-art methods in PD severity assessment. The source code\nfor our implementation is publicly available at\nhttps://github.com/SafwenNaimi/InceptoFormer",
      "url": "http://arxiv.org/abs/2508.04540v1",
      "published_time_eastern_timestamp": 1754494031.0
    },
    {
      "title": "RAIDX: A Retrieval-Augmented Generation and GRPO Reinforcement Learning\n  Framework for Explainable Deepfake Detection",
      "summary": "The rapid advancement of AI-generation models has enabled the creation of\nhyperrealistic imagery, posing ethical risks through widespread misinformation.\nCurrent deepfake detection methods, categorized as face specific detectors or\ngeneral AI-generated detectors, lack transparency by framing detection as a\nclassification task without explaining decisions. While several LLM-based\napproaches offer explainability, they suffer from coarse-grained analyses and\ndependency on labor-intensive annotations. This paper introduces RAIDX\n(Retrieval-Augmented Image Deepfake Detection and Explainability), a novel\ndeepfake detection framework integrating Retrieval-Augmented Generation (RAG)\nand Group Relative Policy Optimization (GRPO) to enhance detection accuracy and\ndecision explainability. Specifically, RAIDX leverages RAG to incorporate\nexternal knowledge for improved detection accuracy and employs GRPO to\nautonomously generate fine-grained textual explanations and saliency maps,\neliminating the need for extensive manual annotations. Experiments on multiple\nbenchmarks demonstrate RAIDX's effectiveness in identifying real or fake, and\nproviding interpretable rationales in both textual descriptions and saliency\nmaps, achieving state-of-the-art detection performance while advancing\ntransparency in deepfake identification. RAIDX represents the first unified\nframework to synergize RAG and GRPO, addressing critical gaps in accuracy and\nexplainability. Our code and models will be publicly available.",
      "url": "http://arxiv.org/abs/2508.04524v1",
      "published_time_eastern_timestamp": 1754492896.0
    }
  ]
}