{
  "last_updated": "2025-10-01T05:13:42.574213-04:00",
  "papers": [
    {
      "title": "Stitch: Training-Free Position Control in Multimodal Diffusion\n  Transformers",
      "summary": "Text-to-Image (T2I) generation models have advanced rapidly in recent years,\nbut accurately capturing spatial relationships like \"above\" or \"to the right\nof\" poses a persistent challenge. Earlier methods improved spatial relationship\nfollowing with external position control. However, as architectures evolved to\nenhance image quality, these techniques became incompatible with modern models.\nWe propose Stitch, a training-free method for incorporating external position\ncontrol into Multi-Modal Diffusion Transformers (MMDiT) via\nautomatically-generated bounding boxes. Stitch produces images that are both\nspatially accurate and visually appealing by generating individual objects\nwithin designated bounding boxes and seamlessly stitching them together. We\nfind that targeted attention heads capture the information necessary to isolate\nand cut out individual objects mid-generation, without needing to fully\ncomplete the image. We evaluate Stitch on PosEval, our benchmark for\nposition-based T2I generation. Featuring five new tasks that extend the concept\nof Position beyond the basic GenEval task, PosEval demonstrates that even top\nmodels still have significant room for improvement in position-based\ngeneration. Tested on Qwen-Image, FLUX, and SD3.5, Stitch consistently enhances\nbase models, even improving FLUX by 218% on GenEval's Position task and by 206%\non PosEval. Stitch achieves state-of-the-art results with Qwen-Image on\nPosEval, improving over previous models by 54%, all accomplished while\nintegrating position control into leading models training-free. Code is\navailable at https://github.com/ExplainableML/Stitch.",
      "url": "http://arxiv.org/abs/2509.26644v1",
      "published_time_eastern_timestamp": 1759255191.0
    },
    {
      "title": "TTT3R: 3D Reconstruction as Test-Time Training",
      "summary": "Modern Recurrent Neural Networks have become a competitive architecture for\n3D reconstruction due to their linear-time complexity. However, their\nperformance degrades significantly when applied beyond the training context\nlength, revealing limited length generalization. In this work, we revisit the\n3D reconstruction foundation models from a Test-Time Training perspective,\nframing their designs as an online learning problem. Building on this\nperspective, we leverage the alignment confidence between the memory state and\nincoming observations to derive a closed-form learning rate for memory updates,\nto balance between retaining historical information and adapting to new\nobservations. This training-free intervention, termed TTT3R, substantially\nimproves length generalization, achieving a $2\\times$ improvement in global\npose estimation over baselines, while operating at 20 FPS with just 6 GB of GPU\nmemory to process thousands of images. Code available in\nhttps://rover-xingyu.github.io/TTT3R",
      "url": "http://arxiv.org/abs/2509.26645v1",
      "published_time_eastern_timestamp": 1759255191.0
    },
    {
      "title": "AccidentBench: Benchmarking Multimodal Understanding and Reasoning in\n  Vehicle Accidents and Beyond",
      "summary": "Rapid advances in multimodal models demand benchmarks that rigorously\nevaluate understanding and reasoning in safety-critical, dynamic real-world\nsettings. We present AccidentBench, a large-scale benchmark that combines\nvehicle accident scenarios with Beyond domains, safety-critical settings in air\nand water that emphasize spatial and temporal reasoning (e.g., navigation,\norientation, multi-vehicle motion). The benchmark contains approximately 2000\nvideos and over 19000 human-annotated question--answer pairs spanning multiple\nvideo lengths (short/medium/long) and difficulty levels (easy/medium/hard).\nTasks systematically probe core capabilities: temporal, spatial, and intent\nunderstanding and reasoning. By unifying accident-centric traffic scenes with\nbroader safety-critical scenarios in air and water, AccidentBench offers a\ncomprehensive, physically grounded testbed for evaluating models under\nreal-world variability. Evaluations of state-of-the-art models (e.g.,\nGemini-2.5 Pro and GPT-5) show that even the strongest models achieve only\nabout 18% accuracy on the hardest tasks and longest videos, revealing\nsubstantial gaps in real-world temporal, spatial, and intent reasoning.\nAccidentBench is designed to expose these critical gaps and drive the\ndevelopment of multimodal models that are safer, more robust, and better\naligned with real-world safety-critical challenges. The code and dataset are\navailable at: https://github.com/SafeRL-Lab/AccidentBench",
      "url": "http://arxiv.org/abs/2509.26636v1",
      "published_time_eastern_timestamp": 1759255153.0
    },
    {
      "title": "Branching Out: Broadening AI Measurement and Evaluation with Measurement\n  Trees",
      "summary": "This paper introduces \\textit{measurement trees}, a novel class of metrics\ndesigned to combine various constructs into an interpretable multi-level\nrepresentation of a measurand. Unlike conventional metrics that yield single\nvalues, vectors, surfaces, or categories, measurement trees produce a\nhierarchical directed graph in which each node summarizes its children through\nuser-defined aggregation methods. In response to recent calls to expand the\nscope of AI system evaluation, measurement trees enhance metric transparency\nand facilitate the integration of heterogeneous evidence, including, e.g.,\nagentic, business, energy-efficiency, sociotechnical, or security signals. We\npresent definitions and examples, demonstrate practical utility through a\nlarge-scale measurement exercise, and provide accompanying open-source Python\ncode. By operationalizing a transparent approach to measurement of complex\nconstructs, this work offers a principled foundation for broader and more\ninterpretable AI evaluation.",
      "url": "http://arxiv.org/abs/2509.26632v1",
      "published_time_eastern_timestamp": 1759255139.0
    },
    {
      "title": "Recursive Self-Aggregation Unlocks Deep Thinking in Large Language\n  Models",
      "summary": "Test-time scaling methods improve the capabilities of large language models\n(LLMs) by increasing the amount of compute used during inference to make a\nprediction. Inference-time compute can be scaled in parallel by choosing among\nmultiple independent solutions or sequentially through self-refinement. We\npropose Recursive Self-Aggregation (RSA), a test-time scaling method inspired\nby evolutionary methods that combines the benefits of both parallel and\nsequential scaling. Each step of RSA refines a population of candidate\nreasoning chains through aggregation of subsets to yield a population of\nimproved solutions, which are then used as the candidate pool for the next\niteration. RSA exploits the rich information embedded in the reasoning chains\n-- not just the final answers -- and enables bootstrapping from partially\ncorrect intermediate steps within different chains of thought. Empirically, RSA\ndelivers substantial performance gains with increasing compute budgets across\ndiverse tasks, model families and sizes. Notably, RSA enables\nQwen3-4B-Instruct-2507 to achieve competitive performance with larger reasoning\nmodels, including DeepSeek-R1 and o3-mini (high), while outperforming purely\nparallel and sequential scaling strategies across AIME-25, HMMT-25, Reasoning\nGym, LiveCodeBench-v6, and SuperGPQA. We further demonstrate that training the\nmodel to combine solutions via a novel aggregation-aware reinforcement learning\napproach yields significant performance gains. Code available at\nhttps://github.com/HyperPotatoNeo/RSA.",
      "url": "http://arxiv.org/abs/2509.26626v1",
      "published_time_eastern_timestamp": 1759255083.0
    },
    {
      "title": "Learning to See Before Seeing: Demystifying LLM Visual Priors from\n  Language Pre-training",
      "summary": "Large Language Models (LLMs), despite being trained on text alone,\nsurprisingly develop rich visual priors. These priors allow latent visual\ncapabilities to be unlocked for vision tasks with a relatively small amount of\nmultimodal data, and in some cases, to perform visual tasks without ever having\nseen an image. Through systematic analysis, we reveal that visual priors-the\nimplicit, emergent knowledge about the visual world acquired during language\npre-training-are composed of separable perception and reasoning priors with\nunique scaling trends and origins. We show that an LLM's latent visual\nreasoning ability is predominantly developed by pre-training on\nreasoning-centric data (e.g., code, math, academia) and scales progressively.\nThis reasoning prior acquired from language pre-training is transferable and\nuniversally applicable to visual reasoning. In contrast, a perception prior\nemerges more diffusely from broad corpora, and perception ability is more\nsensitive to the vision encoder and visual instruction tuning data. In\nparallel, text describing the visual world proves crucial, though its\nperformance impact saturates rapidly. Leveraging these insights, we propose a\ndata-centric recipe for pre-training vision-aware LLMs and verify it in 1T\ntoken scale pre-training. Our findings are grounded in over 100 controlled\nexperiments consuming 500,000 GPU-hours, spanning the full MLLM construction\npipeline-from LLM pre-training to visual alignment and supervised multimodal\nfine-tuning-across five model scales, a wide range of data categories and\nmixtures, and multiple adaptation setups. Along with our main findings, we\npropose and investigate several hypotheses, and introduce the Multi-Level\nExistence Bench (MLE-Bench). Together, this work provides a new way of\ndeliberately cultivating visual priors from language pre-training, paving the\nway for the next generation of multimodal LLMs.",
      "url": "http://arxiv.org/abs/2509.26625v1",
      "published_time_eastern_timestamp": 1759255064.0
    },
    {
      "title": "HART: Human Aligned Reconstruction Transformer",
      "summary": "We introduce HART, a unified framework for sparse-view human reconstruction.\nGiven a small set of uncalibrated RGB images of a person as input, it outputs a\nwatertight clothed mesh, the aligned SMPL-X body mesh, and a Gaussian-splat\nrepresentation for photorealistic novel-view rendering. Prior methods for\nclothed human reconstruction either optimize parametric templates, which\noverlook loose garments and human-object interactions, or train implicit\nfunctions under simplified camera assumptions, limiting applicability in real\nscenes. In contrast, HART predicts per-pixel 3D point maps, normals, and body\ncorrespondences, and employs an occlusion-aware Poisson reconstruction to\nrecover complete geometry, even in self-occluded regions. These predictions\nalso align with a parametric SMPL-X body model, ensuring that reconstructed\ngeometry remains consistent with human structure while capturing loose clothing\nand interactions. These human-aligned meshes initialize Gaussian splats to\nfurther enable sparse-view rendering. While trained on only 2.3K synthetic\nscans, HART achieves state-of-the-art results: Chamfer Distance improves by\n18-23 percent for clothed-mesh reconstruction, PA-V2V drops by 6-27 percent for\nSMPL-X estimation, LPIPS decreases by 15-27 percent for novel-view synthesis on\na wide range of datasets. These results suggest that feed-forward transformers\ncan serve as a scalable model for robust human reconstruction in real-world\nsettings. Code and models will be released.",
      "url": "http://arxiv.org/abs/2509.26621v1",
      "published_time_eastern_timestamp": 1759254962.0
    },
    {
      "title": "DA$^2$: Depth Anything in Any Direction",
      "summary": "Panorama has a full FoV (360$^\\circ\\times$180$^\\circ$), offering a more\ncomplete visual description than perspective images. Thanks to this\ncharacteristic, panoramic depth estimation is gaining increasing traction in 3D\nvision. However, due to the scarcity of panoramic data, previous methods are\noften restricted to in-domain settings, leading to poor zero-shot\ngeneralization. Furthermore, due to the spherical distortions inherent in\npanoramas, many approaches rely on perspective splitting (e.g., cubemaps),\nwhich leads to suboptimal efficiency. To address these challenges, we propose\n$\\textbf{DA}$$^{\\textbf{2}}$: $\\textbf{D}$epth $\\textbf{A}$nything in\n$\\textbf{A}$ny $\\textbf{D}$irection, an accurate, zero-shot generalizable, and\nfully end-to-end panoramic depth estimator. Specifically, for scaling up\npanoramic data, we introduce a data curation engine for generating high-quality\npanoramic depth data from perspective, and create $\\sim$543K panoramic\nRGB-depth pairs, bringing the total to $\\sim$607K. To further mitigate the\nspherical distortions, we present SphereViT, which explicitly leverages\nspherical coordinates to enforce the spherical geometric consistency in\npanoramic image features, yielding improved performance. A comprehensive\nbenchmark on multiple datasets clearly demonstrates DA$^{2}$'s SoTA\nperformance, with an average 38% improvement on AbsRel over the strongest\nzero-shot baseline. Surprisingly, DA$^{2}$ even outperforms prior in-domain\nmethods, highlighting its superior zero-shot generalization. Moreover, as an\nend-to-end solution, DA$^{2}$ exhibits much higher efficiency over fusion-based\napproaches. Both the code and the curated panoramic data will be released.\nProject page: https://depth-any-in-any-dir.github.io/.",
      "url": "http://arxiv.org/abs/2509.26618v1",
      "published_time_eastern_timestamp": 1759254937.0
    },
    {
      "title": "Video Object Segmentation-Aware Audio Generation",
      "summary": "Existing multimodal audio generation models often lack precise user control,\nwhich limits their applicability in professional Foley workflows. In\nparticular, these models focus on the entire video and do not provide precise\nmethods for prioritizing a specific object within a scene, generating\nunnecessary background sounds, or focusing on the wrong objects. To address\nthis gap, we introduce the novel task of video object segmentation-aware audio\ngeneration, which explicitly conditions sound synthesis on object-level\nsegmentation maps. We present SAGANet, a new multimodal generative model that\nenables controllable audio generation by leveraging visual segmentation masks\nalong with video and textual cues. Our model provides users with fine-grained\nand visually localized control over audio generation. To support this task and\nfurther research on segmentation-aware Foley, we propose Segmented Music Solos,\na benchmark dataset of musical instrument performance videos with segmentation\ninformation. Our method demonstrates substantial improvements over current\nstate-of-the-art methods and sets a new standard for controllable,\nhigh-fidelity Foley synthesis. Code, samples, and Segmented Music Solos are\navailable at https://saganet.notion.site",
      "url": "http://arxiv.org/abs/2509.26604v1",
      "published_time_eastern_timestamp": 1759254581.0
    },
    {
      "title": "DeepScientist: Advancing Frontier-Pushing Scientific Findings\n  Progressively",
      "summary": "While previous AI Scientist systems can generate novel findings, they often\nlack the focus to produce scientifically valuable contributions that address\npressing human-defined challenges. We introduce DeepScientist, a system\ndesigned to overcome this by conducting goal-oriented, fully autonomous\nscientific discovery over month-long timelines. It formalizes discovery as a\nBayesian Optimization problem, operationalized through a hierarchical\nevaluation process consisting of \"hypothesize, verify, and analyze\". Leveraging\na cumulative Findings Memory, this loop intelligently balances the exploration\nof novel hypotheses with exploitation, selectively promoting the most promising\nfindings to higher-fidelity levels of validation. Consuming over 20,000 GPU\nhours, the system generated about 5,000 unique scientific ideas and\nexperimentally validated approximately 1100 of them, ultimately surpassing\nhuman-designed state-of-the-art (SOTA) methods on three frontier AI tasks by\n183.7\\%, 1.9\\%, and 7.9\\%. This work provides the first large-scale evidence of\nan AI achieving discoveries that progressively surpass human SOTA on scientific\ntasks, producing valuable findings that genuinely push the frontier of\nscientific discovery. To facilitate further research into this process, we will\nopen-source all experimental logs and system code at\nhttps://github.com/ResearAI/DeepScientist/.",
      "url": "http://arxiv.org/abs/2509.26603v1",
      "published_time_eastern_timestamp": 1759254572.0
    }
  ]
}