{
  "last_updated": "2025-10-08T20:54:18.546923-04:00",
  "papers": [
    {
      "title": "Human3R: Everyone Everywhere All at Once",
      "summary": "We present Human3R, a unified, feed-forward framework for online 4D\nhuman-scene reconstruction, in the world frame, from casually captured\nmonocular videos. Unlike previous approaches that rely on multi-stage\npipelines, iterative contact-aware refinement between humans and scenes, and\nheavy dependencies, e.g., human detection, depth estimation, and SLAM\npre-processing, Human3R jointly recovers global multi-person SMPL-X bodies\n(\"everyone\"), dense 3D scene (\"everywhere\"), and camera trajectories in a\nsingle forward pass (\"all-at-once\"). Our method builds upon the 4D online\nreconstruction model CUT3R, and uses parameter-efficient visual prompt tuning,\nto strive to preserve CUT3R's rich spatiotemporal priors, while enabling direct\nreadout of multiple SMPL-X bodies. Human3R is a unified model that eliminates\nheavy dependencies and iterative refinement. After being trained on the\nrelatively small-scale synthetic dataset BEDLAM for just one day on one GPU, it\nachieves superior performance with remarkable efficiency: it reconstructs\nmultiple humans in a one-shot manner, along with 3D scenes, in one stage, at\nreal-time speed (15 FPS) with a low memory footprint (8 GB). Extensive\nexperiments demonstrate that Human3R delivers state-of-the-art or competitive\nperformance across tasks, including global human motion estimation, local human\nmesh recovery, video depth estimation, and camera pose estimation, with a\nsingle unified model. We hope that Human3R will serve as a simple yet strong\nbaseline, be easily extended for downstream applications.Code available in\nhttps://fanegg.github.io/Human3R",
      "url": "http://arxiv.org/abs/2510.06219v1",
      "published_time_eastern_timestamp": 1759859992.0
    },
    {
      "title": "EgoNight: Towards Egocentric Vision Understanding at Night with a\n  Challenging Benchmark",
      "summary": "Most existing benchmarks for egocentric vision understanding focus primarily\non daytime scenarios, overlooking the low-light conditions that are inevitable\nin real-world applications. To investigate this gap, we present EgoNight, the\nfirst comprehensive benchmark for nighttime egocentric vision, with visual\nquestion answering (VQA) as the core task. A key feature of EgoNight is the\nintroduction of day-night aligned videos, which enhance night annotation\nquality using the daytime data and reveal clear performance gaps between\nlighting conditions. To achieve this, we collect both synthetic videos rendered\nby Blender and real-world recordings, ensuring that scenes and actions are\nvisually and temporally aligned. Leveraging these paired videos, we construct\nEgoNight-VQA, supported by a novel day-augmented night auto-labeling engine and\nrefinement through extensive human verification. Each QA pair is double-checked\nby annotators for reliability. In total, EgoNight-VQA contains 3658 QA pairs\nacross 90 videos, spanning 12 diverse QA types, with more than 300 hours of\nhuman work. Evaluations of state-of-the-art multimodal large language models\n(MLLMs) reveal substantial performance drops when transferring from day to\nnight, underscoring the challenges of reasoning under low-light conditions.\nBeyond VQA, EgoNight also introduces two auxiliary tasks, day-night\ncorrespondence retrieval and egocentric depth estimation at night, that further\nexplore the boundaries of existing models. We believe EgoNight-VQA provides a\nstrong foundation for advancing application-driven egocentric vision research\nand for developing models that generalize across illumination domains. All the\ndata and code will be made available upon acceptance.",
      "url": "http://arxiv.org/abs/2510.06218v1",
      "published_time_eastern_timestamp": 1759859987.0
    },
    {
      "title": "Tensor time series change-point detection in cryptocurrency network data",
      "summary": "Financial fraud has been growing exponentially in recent years. The rise of\ncryptocurrencies as an investment asset has simultaneously seen a parallel\ngrowth in cryptocurrency scams. To detect possible cryptocurrency fraud, and in\nparticular market manipulation, previous research focused on the detection of\nchanges in the network of trades; however, market manipulators are now trading\nacross multiple cryptocurrency platforms, making their detection more\ndifficult. Hence, it is important to consider the identification of changes\nacross several trading networks or a `network of networks' over time. To this\nend, in this article, we propose a new change-point detection method in the\nnetwork structure of tensor-variate data. This new method, labeled TenSeg,\nfirst employs a tensor decomposition, and second detects multiple change-points\nin the second-order (cross-covariance or network) structure of the decomposed\ndata. It allows for change-point detection in the presence of frequent changes\nof possibly small magnitudes and is computationally fast. We apply our method\nto several simulated datasets and to a cryptocurrency dataset, which consists\nof network tensor-variate data from the Ethereum blockchain. We demonstrate\nthat our approach substantially outperforms other state-of-the-art change-point\ntechniques, and the detected change-points in the Ethereum data set coincide\nwith changes across several trading networks or a `network of networks' over\ntime. Finally, all the relevant \\textsf{R} code implementing the method in the\narticle are available on https://github.com/Anastasiou-Andreas/TenSeg.",
      "url": "http://arxiv.org/abs/2510.06211v1",
      "published_time_eastern_timestamp": 1759859917.0
    },
    {
      "title": "EmbodiedCoder: Parameterized Embodied Mobile Manipulation via Modern\n  Coding Model",
      "summary": "Recent advances in control robot methods, from end-to-end\nvision-language-action frameworks to modular systems with predefined\nprimitives, have advanced robots' ability to follow natural language\ninstructions. Nonetheless, many approaches still struggle to scale to diverse\nenvironments, as they often rely on large annotated datasets and offer limited\ninterpretability.In this work, we introduce EmbodiedCoder, a training-free\nframework for open-world mobile robot manipulation that leverages coding models\nto directly generate executable robot trajectories. By grounding high-level\ninstructions in code, EmbodiedCoder enables flexible object geometry\nparameterization and manipulation trajectory synthesis without additional data\ncollection or fine-tuning.This coding-based paradigm provides a transparent and\ngeneralizable way to connect perception with manipulation. Experiments on real\nmobile robots show that EmbodiedCoder achieves robust performance across\ndiverse long-term tasks and generalizes effectively to novel objects and\nenvironments.Our results demonstrate an interpretable approach for bridging\nhigh-level reasoning and low-level control, moving beyond fixed primitives\ntoward versatile robot intelligence. See the project page at:\nhttps://anonymous.4open.science/w/Embodied-Coder/",
      "url": "http://arxiv.org/abs/2510.06207v1",
      "published_time_eastern_timestamp": 1759859882.0
    },
    {
      "title": "Modulation Discovery with Differentiable Digital Signal Processing",
      "summary": "Modulations are a critical part of sound design and music production,\nenabling the creation of complex and evolving audio. Modern synthesizers\nprovide envelopes, low frequency oscillators (LFOs), and more parameter\nautomation tools that allow users to modulate the output with ease. However,\ndetermining the modulation signals used to create a sound is difficult, and\nexisting sound-matching / parameter estimation systems are often\nuninterpretable black boxes or predict high-dimensional framewise parameter\nvalues without considering the shape, structure, and routing of the underlying\nmodulation curves. We propose a neural sound-matching approach that leverages\nmodulation extraction, constrained control signal parameterizations, and\ndifferentiable digital signal processing (DDSP) to discover the modulations\npresent in a sound. We demonstrate the effectiveness of our approach on highly\nmodulated synthetic and real audio samples, its applicability to different DDSP\nsynth architectures, and investigate the trade-off it incurs between\ninterpretability and sound-matching accuracy. We make our code and audio\nsamples available and provide the trained DDSP synths in a VST plugin.",
      "url": "http://arxiv.org/abs/2510.06204v1",
      "published_time_eastern_timestamp": 1759859784.0
    },
    {
      "title": "Latent Speech-Text Transformer",
      "summary": "Auto-regressive speech-text models are typically pre-trained on a large\nnumber of interleaved sequences of text tokens and raw speech encoded as speech\ntokens using vector quantization. These models have demonstrated\nstate-of-the-art performance in speech-to-speech understanding and generation\nbenchmarks, together with promising scaling laws, primarily enabled by the\nrepresentational alignment between text and speech. Nevertheless, they suffer\nfrom shortcomings, partly owing to the disproportionately longer sequences of\nspeech tokens in contrast to textual tokens. This results in a large compute\nimbalance between modalities during pre-training as well as during inference,\nand a potential hindrance to effectively aligning speech and text, ultimately\ntranslating to several orders of magnitude slower scaling laws. We introduce\nthe Latent Speech-Text Transformer (LST), which makes pre-training speech-text\nmodels more data-efficient by dynamically and inexpensively aggregating speech\ntokens into latent speech patches. These patches serve as higher-level units\nthat can either align with corresponding textual units to aid capability\ntransfer or even encapsulate common speech sequences like silences to be more\ncompute-efficient. We show that LST outperforms vanilla approaches on\nspeech-to-speech as well as text-to-text benchmarks in both data- and\ncompute-controlled settings, the former indicating more effective\nrepresentational alignment and the latter indicating steeper scaling laws for\nspeech-text models. On HellaSwag story completion, LST achieves 6.5% absolute\ngain in speech accuracy under compute-controlled training and 5.3% under\ndata-controlled training, while also improving text performance. We will\nrelease our models, code, and the evaluation data to facilitate further\nresearch.",
      "url": "http://arxiv.org/abs/2510.06195v1",
      "published_time_eastern_timestamp": 1759859528.0
    },
    {
      "title": "Overlap-aware segmentation for topological reconstruction of obscured\n  objects",
      "summary": "The separation of overlapping objects presents a significant challenge in\nscientific imaging. While deep learning segmentation-regression algorithms can\npredict pixel-wise intensities, they typically treat all regions equally rather\nthan prioritizing overlap regions where attribution is most ambiguous. Recent\nadvances in instance segmentation show that weighting regions of pixel overlap\nin training can improve segmentation boundary predictions in regions of\noverlap, but this idea has not yet been extended to segmentation regression. We\naddress this with Overlap-Aware Segmentation of ImageS (OASIS): a new\nsegmentation-regression framework with a weighted loss function designed to\nprioritize regions of object-overlap during training, enabling extraction of\npixel intensities and topological features from heavily obscured objects. We\ndemonstrate OASIS in the context of the MIGDAL experiment, which aims to\ndirectly image the Migdal effect--a rare process where electron emission is\ninduced by nuclear scattering--in a low-pressure optical time projection\nchamber. This setting poses an extreme test case, as the target for\nreconstruction is a faint electron recoil track which is often heavily-buried\nwithin the orders-of-magnitude brighter nuclear recoil track. Compared to\nunweighted training, OASIS improves median intensity reconstruction errors from\n-32% to -14% for low-energy electron tracks (4-5 keV) and improves topological\nintersection-over-union scores from 0.828 to 0.855. These performance gains\ndemonstrate OASIS's ability to recover obscured signals in overlap-dominated\nregions. The framework provides a generalizable methodology for scientific\nimaging where pixels represent physical quantities and overlap obscures\nfeatures of interest. All code is openly available to facilitate cross-domain\nadoption.",
      "url": "http://arxiv.org/abs/2510.06194v1",
      "published_time_eastern_timestamp": 1759859521.0
    },
    {
      "title": "On Powerful Ways to Generate: Autoregression, Diffusion, and Beyond",
      "summary": "This paper formally studies generation processes, including auto-regressive\nnext-token prediction and masked diffusion, that abstract beyond architectural\nspecifics. At this level of abstraction, we quantify their benefits and\nlimitations through measurable criteria such as computational hardness and\nlearnability. In particular, we demonstrate that allowing generation to proceed\nbeyond autoregression and current masked diffusion, with capabilities to\nrewrite and length-variable edit, can bring significant theoretical and\nempirical advantages, with important implications for frontier LLMs that aspire\nto tackle increasingly hard problems and work universally across domains beyond\nnatural language, such as coding and science.",
      "url": "http://arxiv.org/abs/2510.06190v1",
      "published_time_eastern_timestamp": 1759859370.0
    },
    {
      "title": "Automated Program Repair of Uncompilable Student Code",
      "summary": "A significant portion of student programming submissions in CS1 learning\nenvironments are uncompilable, limiting their use in student modeling and\ndownstream knowledge tracing. Traditional modeling pipelines often exclude\nthese cases, discarding observations of student learning. This study\ninvestigates automated program repair as a strategy to recover uncompilable\ncode while preserving students' structural intent for use in student modeling.\nWithin this framework, we assess large language models (LLMs) as repair agents,\nincluding GPT-5 (OpenAI), Claude 3.5 Haiku (Anthropic), and Gemini 2.5 Flash\n(Google), under high- and low-context prompting conditions. Repairs were\nevaluated for compilability, edit distance, and preservation of students'\noriginal structure and logic. We find that while all three LLMs are capable of\nproducing compilable repairs, their behavior diverges in how well they preserve\nstudents' control flow and code structure, which affects their pedagogical\nutility. By recovering uncompilable submissions, this work enables richer and\nmore comprehensive analyses of learners' coding processes and development over\ntime.",
      "url": "http://arxiv.org/abs/2510.06187v1",
      "published_time_eastern_timestamp": 1759859193.0
    },
    {
      "title": "RECODE-H: A Benchmark for Research Code Development with Interactive\n  Human Feedback",
      "summary": "Large language models (LLMs) show the promise in supporting scientific\nresearch implementation, yet their ability to generate correct and executable\ncode remains limited. Existing works largely adopt one-shot settings, ignoring\nthe iterative and feedback-driven nature of realistic workflows of scientific\nresearch development. To address this gap, we present RECODE-H, a benchmark of\n102 tasks from research papers and repositories that evaluates LLM agents\nthrough multi-turn interactions with LLM-simulated human feedback. It includes\nstructured instructions,unit tests, and a five-level feedback hierarchy to\nreflect realistic researcher-agent collaboration. We further present\nReCodeAgent, a framework that integrates feedback into iterative code\ngeneration. Experiments with leading LLMs, including GPT-5, Claude-Sonnet-4,\nDeepSeek-V3.1, and Gemini 2.5, show substantial performance gains with richer\nfeedback, while also highlighting ongoing challenges in the generation of\ncomplex research code. RECODE-H establishes a foundation for developing\nadaptive, feedback-driven LLM agents in scientific research implementation",
      "url": "http://arxiv.org/abs/2510.06186v1",
      "published_time_eastern_timestamp": 1759859135.0
    }
  ]
}