{
  "last_updated": "2025-07-25T02:19:40.058479-04:00",
  "papers": [
    {
      "title": "Layer-Aware Representation Filtering: Purifying Finetuning Data to\n  Preserve LLM Safety Alignment",
      "summary": "With rapid advancement and increasing accessibility of LLMs, fine-tuning\naligned models has become a critical step for adapting them to real-world\napplications, which makes the safety of this fine-tuning process more important\nthan ever. However, recent studies have highlighted a critical challenge: even\nwhen fine-tuning with seemingly benign downstream datasets, the safety of\naligned LLMs can be compromised, making them more susceptible to malicious\ninstructions. In this paper, we show that fine-tuning datasets often contain\nsamples with safety-degrading features that are not easily identifiable on the\nsurface. These samples can significantly degrade the safety alignment of LLMs\nduring fine-tuning. To address this issue, we propose LARF, a\n\\textbf{L}ayer-\\textbf{A}ware \\textbf{R}epresentation \\textbf{F}iltering\nmethod. This method identifies safety-sensitive layers within the LLM and\nleverages their representations to detect which data samples in the\npost-training dataset contain safety-degrading features. Experimental results\ndemonstrate that LARF can effectively identify benign data with\nsafety-degrading features. After removing such data, the safety alignment\ndegradation caused by fine-tuning is mitigated. Please see our code at\n\\href{https://github.com/LLLeoLi/LARF}{https://github.com/LLLeoLi/LARF}.",
      "url": "http://arxiv.org/abs/2507.18631v1",
      "published_time_eastern_timestamp": 1753379964.0
    },
    {
      "title": "3D Software Synthesis Guided by Constraint-Expressive Intermediate\n  Representation",
      "summary": "Graphical user interface (UI) software has undergone a fundamental\ntransformation from traditional two-dimensional (2D) desktop/web/mobile\ninterfaces to spatial three-dimensional (3D) environments. While existing work\nhas made remarkable success in automated 2D software generation, such as\nHTML/CSS and mobile app interface code synthesis, the generation of 3D software\nstill remains under-explored. Current methods for 3D software generation\nusually generate the 3D environments as a whole and cannot modify or control\nspecific elements in the software. Furthermore, these methods struggle to\nhandle the complex spatial and semantic constraints inherent in the real world.\nTo address the challenges, we present Scenethesis, a novel\nrequirement-sensitive 3D software synthesis approach that maintains formal\ntraceability between user specifications and generated 3D software. Scenethesis\nis built upon ScenethesisLang, a domain-specific language that serves as a\ngranular constraint-aware intermediate representation (IR) to bridge natural\nlanguage requirements and executable 3D software. It serves both as a\ncomprehensive scene description language enabling fine-grained modification of\n3D software elements and as a formal constraint-expressive specification\nlanguage capable of expressing complex spatial constraints. By decomposing 3D\nsoftware synthesis into stages operating on ScenethesisLang, Scenethesis\nenables independent verification, targeted modification, and systematic\nconstraint satisfaction. Our evaluation demonstrates that Scenethesis\naccurately captures over 80% of user requirements and satisfies more than 90%\nof hard constraints while handling over 100 constraints simultaneously.\nFurthermore, Scenethesis achieves a 42.8% improvement in BLIP-2 visual\nevaluation scores compared to the state-of-the-art method.",
      "url": "http://arxiv.org/abs/2507.18625v1",
      "published_time_eastern_timestamp": 1753379883.0
    },
    {
      "title": "An omnibus goodness-of-fit test based on trigonometric moments",
      "summary": "We present a versatile omnibus goodness-of-fit test based on the first two\ntrigonometric moments of probability-integral-transformed data, which rectifies\nthe covariance scaling errors made by Langholz and Kronmal [J. Amer. Statist.\nAssoc. 86 (1991), 1077--1084]. Once properly scaled, the quadratic-form\nstatistic asymptotically follows a $\\chi_2^2$ distribution under the null\nhypothesis. The covariance scalings and parameter estimators are provided for\n$32$ null distribution families, covering heavy-tailed, light-tailed,\nasymmetric, and bounded-support cases, so the test is ready to be applied\ndirectly. Using recent advances in non-degenerate multivariate $U$-statistics\nwith estimated nuisance parameters, we also showcase its asymptotic\ndistribution under local alternatives for three specific examples. Our\nprocedure shows excellent power; in particular, simulations testing the Laplace\nmodel against a range of $400$ alternatives reveal that it surpasses all $40$\nexisting tests for moderate to large sample sizes. A real-data application\ninvolving 48-hour-ahead surface temperature forecast errors further\ndemonstrates the practical utility of the test. To ensure full reproducibility,\nthe R code that generated our numerical results is publicly accessible online.",
      "url": "http://arxiv.org/abs/2507.18591v1",
      "published_time_eastern_timestamp": 1753377436.0
    },
    {
      "title": "AQuilt: Weaving Logic and Self-Inspection into Low-Cost, High-Relevance\n  Data Synthesis for Specialist LLMs",
      "summary": "Despite the impressive performance of large language models (LLMs) in general\ndomains, they often underperform in specialized domains. Existing approaches\ntypically rely on data synthesis methods and yield promising results by using\nunlabeled data to capture domain-specific features. However, these methods\neither incur high computational costs or suffer from performance limitations,\nwhile also demonstrating insufficient generalization across different tasks. To\naddress these challenges, we propose AQuilt, a framework for constructing\ninstruction-tuning data for any specialized domains from corresponding\nunlabeled data, including Answer, Question, Unlabeled data, Inspection, Logic,\nand Task type. By incorporating logic and inspection, we encourage reasoning\nprocesses and self-inspection to enhance model performance. Moreover,\ncustomizable task instructions enable high-quality data generation for any\ntask. As a result, we construct a dataset of 703k examples to train a powerful\ndata synthesis model. Experiments show that AQuilt is comparable to DeepSeek-V3\nwhile utilizing just 17% of the production cost. Further analysis demonstrates\nthat our generated data exhibits higher relevance to downstream tasks. Source\ncode, models, and scripts are available at https://github.com/Krueske/AQuilt.",
      "url": "http://arxiv.org/abs/2507.18584v1",
      "published_time_eastern_timestamp": 1753376607.0
    },
    {
      "title": "DR.EHR: Dense Retrieval for Electronic Health Record with Knowledge\n  Injection and Synthetic Data",
      "summary": "Electronic Health Records (EHRs) are pivotal in clinical practices, yet their\nretrieval remains a challenge mainly due to semantic gap issues. Recent\nadvancements in dense retrieval offer promising solutions but existing models,\nboth general-domain and biomedical-domain, fall short due to insufficient\nmedical knowledge or mismatched training corpora. This paper introduces\n\\texttt{DR.EHR}, a series of dense retrieval models specifically tailored for\nEHR retrieval. We propose a two-stage training pipeline utilizing MIMIC-IV\ndischarge summaries to address the need for extensive medical knowledge and\nlarge-scale training data. The first stage involves medical entity extraction\nand knowledge injection from a biomedical knowledge graph, while the second\nstage employs large language models to generate diverse training data. We train\ntwo variants of \\texttt{DR.EHR}, with 110M and 7B parameters, respectively.\nEvaluated on the CliniQ benchmark, our models significantly outperforms all\nexisting dense retrievers, achieving state-of-the-art results. Detailed\nanalyses confirm our models' superiority across various match and query types,\nparticularly in challenging semantic matches like implication and abbreviation.\nAblation studies validate the effectiveness of each pipeline component, and\nsupplementary experiments on EHR QA datasets demonstrate the models'\ngeneralizability on natural language questions, including complex ones with\nmultiple entities. This work significantly advances EHR retrieval, offering a\nrobust solution for clinical applications.",
      "url": "http://arxiv.org/abs/2507.18583v1",
      "published_time_eastern_timestamp": 1753376566.0
    },
    {
      "title": "System Report for CCL25-Eval Task 10: SRAG-MAV for Fine-Grained Chinese\n  Hate Speech Recognition",
      "summary": "This paper presents our system for CCL25-Eval Task 10, addressing\nFine-Grained Chinese Hate Speech Recognition (FGCHSR). We propose a novel\nSRAG-MAV framework that synergistically integrates task reformulation(TR),\nSelf-Retrieval-Augmented Generation (SRAG), and Multi-Round Accumulative Voting\n(MAV). Our method reformulates the quadruplet extraction task into triplet\nextraction, uses dynamic retrieval from the training set to create contextual\nprompts, and applies multi-round inference with voting to improve output\nstability and performance. Our system, based on the Qwen2.5-7B model, achieves\na Hard Score of 26.66, a Soft Score of 48.35, and an Average Score of 37.505 on\nthe STATE ToxiCN dataset, significantly outperforming baselines such as GPT-4o\n(Average Score 15.63) and fine-tuned Qwen2.5-7B (Average Score 35.365). The\ncode is available at https://github.com/king-wang123/CCL25-SRAG-MAV.",
      "url": "http://arxiv.org/abs/2507.18580v1",
      "published_time_eastern_timestamp": 1753376198.0
    },
    {
      "title": "HybridTM: Combining Transformer and Mamba for 3D Semantic Segmentation",
      "summary": "Transformer-based methods have demonstrated remarkable capabilities in 3D\nsemantic segmentation through their powerful attention mechanisms, but the\nquadratic complexity limits their modeling of long-range dependencies in\nlarge-scale point clouds. While recent Mamba-based approaches offer efficient\nprocessing with linear complexity, they struggle with feature representation\nwhen extracting 3D features. However, effectively combining these complementary\nstrengths remains an open challenge in this field. In this paper, we propose\nHybridTM, the first hybrid architecture that integrates Transformer and Mamba\nfor 3D semantic segmentation. In addition, we propose the Inner Layer Hybrid\nStrategy, which combines attention and Mamba at a finer granularity, enabling\nsimultaneous capture of long-range dependencies and fine-grained local\nfeatures. Extensive experiments demonstrate the effectiveness and\ngeneralization of our HybridTM on diverse indoor and outdoor datasets.\nFurthermore, our HybridTM achieves state-of-the-art performance on ScanNet,\nScanNet200, and nuScenes benchmarks. The code will be made available at\nhttps://github.com/deepinact/HybridTM.",
      "url": "http://arxiv.org/abs/2507.18575v1",
      "published_time_eastern_timestamp": 1753375730.0
    },
    {
      "title": "A 3D Cross-modal Keypoint Descriptor for MR-US Matching and Registration",
      "summary": "Intraoperative registration of real-time ultrasound (iUS) to preoperative\nMagnetic Resonance Imaging (MRI) remains an unsolved problem due to severe\nmodality-specific differences in appearance, resolution, and field-of-view. To\naddress this, we propose a novel 3D cross-modal keypoint descriptor for MRI-iUS\nmatching and registration. Our approach employs a patient-specific\nmatching-by-synthesis approach, generating synthetic iUS volumes from\npreoperative MRI. This enables supervised contrastive training to learn a\nshared descriptor space.\n  A probabilistic keypoint detection strategy is then employed to identify\nanatomically salient and modality-consistent locations. During training, a\ncurriculum-based triplet loss with dynamic hard negative mining is used to\nlearn descriptors that are i) robust to iUS artifacts such as speckle noise and\nlimited coverage, and ii) rotation-invariant . At inference, the method detects\nkeypoints in MR and real iUS images and identifies sparse matches, which are\nthen used to perform rigid registration. Our approach is evaluated using 3D\nMRI-iUS pairs from the ReMIND dataset. Experiments show that our approach\noutperforms state-of-the-art keypoint matching methods across 11 patients, with\nan average precision of $69.8\\%$. For image registration, our method achieves a\ncompetitive mean Target Registration Error of 2.39 mm on the ReMIND2Reg\nbenchmark.\n  Compared to existing iUS-MR registration approach, our framework is\ninterpretable, requires no manual initialization, and shows robustness to iUS\nfield-of-view variation. Code is available at\nhttps://github.com/morozovdd/CrossKEY.",
      "url": "http://arxiv.org/abs/2507.18551v1",
      "published_time_eastern_timestamp": 1753373948.0
    },
    {
      "title": "Deep Variational Free Energy Calculation of Hydrogen Hugoniot",
      "summary": "We develop a deep variational free energy framework to compute the equation\nof state of hydrogen in the warm dense matter region. This method parameterizes\nthe variational density matrix of hydrogen nuclei and electrons at finite\ntemperature using three deep generative models: a normalizing flow model that\nrepresents the Boltzmann distribution of the classical nuclei, an\nautoregressive transformer that models the distribution of electrons in excited\nstates, and a permutational equivariant flow model that constructs backflow\ncoordinates for electrons in Hartree-Fock orbitals. By jointly optimizing the\nthree neural networks to minimize the variational free energy, we obtain the\nequation of state and related thermodynamic properties of dense hydrogen. We\ncompare our results with other theoretical and experimental results on the\ndeuterium Hugoniot curve, aiming to resolve existing discrepancies. The\ncalculated results provide a valuable benchmark for deuterium in the warm dense\nmatter region.",
      "url": "http://arxiv.org/abs/2507.18540v1",
      "published_time_eastern_timestamp": 1753373233.0
    },
    {
      "title": "TTS-VAR: A Test-Time Scaling Framework for Visual Auto-Regressive\n  Generation",
      "summary": "Scaling visual generation models is essential for real-world content\ncreation, yet requires substantial training and computational expenses.\nAlternatively, test-time scaling has garnered growing attention due to resource\nefficiency and promising performance. In this work, we present TTS-VAR, the\nfirst general test-time scaling framework for visual auto-regressive (VAR)\nmodels, modeling the generation process as a path searching problem. To\ndynamically balance computational efficiency with exploration capacity, we\nfirst introduce an adaptive descending batch size schedule throughout the\ncausal generation process. Besides, inspired by VAR's hierarchical\ncoarse-to-fine multi-scale generation, our framework integrates two key\ncomponents: (i) At coarse scales, we observe that generated tokens are hard for\nevaluation, possibly leading to erroneous acceptance of inferior samples or\nrejection of superior samples. Noticing that the coarse scales contain\nsufficient structural information, we propose clustering-based diversity\nsearch. It preserves structural variety through semantic feature clustering,\nenabling later selection on samples with higher potential. (ii) In fine scales,\nresampling-based potential selection prioritizes promising candidates using\npotential scores, which are defined as reward functions incorporating\nmulti-scale generation history. Experiments on the powerful VAR model Infinity\nshow a notable 8.7% GenEval score improvement (from 0.69 to 0.75). Key insights\nreveal that early-stage structural features effectively influence final\nquality, and resampling efficacy varies across generation scales. Code is\navailable at https://github.com/ali-vilab/TTS-VAR.",
      "url": "http://arxiv.org/abs/2507.18537v1",
      "published_time_eastern_timestamp": 1753373095.0
    },
    {
      "title": "IntentVCNet: Bridging Spatio-Temporal Gaps for Intention-Oriented\n  Controllable Video Captioning",
      "summary": "Intent-oriented controlled video captioning aims to generate targeted\ndescriptions for specific targets in a video based on customized user intent.\nCurrent Large Visual Language Models (LVLMs) have gained strong instruction\nfollowing and visual comprehension capabilities. Although the LVLMs\ndemonstrated proficiency in spatial and temporal understanding respectively, it\nwas not able to perform fine-grained spatial control in time sequences in\ndirect response to instructions. This substantial spatio-temporal gap\ncomplicates efforts to achieve fine-grained intention-oriented control in\nvideo. Towards this end, we propose a novel IntentVCNet that unifies the\ntemporal and spatial understanding knowledge inherent in LVLMs to bridge the\nspatio-temporal gap from both prompting and model perspectives. Specifically,\nwe first propose a prompt combination strategy designed to enable LLM to model\nthe implicit relationship between prompts that characterize user intent and\nvideo sequences. We then propose a parameter efficient box adapter that\naugments the object semantic information in the global visual context so that\nthe visual token has a priori information about the user intent. The final\nexperiment proves that the combination of the two strategies can further\nenhance the LVLM's ability to model spatial details in video sequences, and\nfacilitate the LVLMs to accurately generate controlled intent-oriented\ncaptions. Our proposed method achieved state-of-the-art results in several open\nsource LVLMs and was the runner-up in the IntentVC challenge. Our code is\navailable on https://github.com/thqiu0419/IntentVCNet.",
      "url": "http://arxiv.org/abs/2507.18531v1",
      "published_time_eastern_timestamp": 1753372716.0
    },
    {
      "title": "A Deep Dive into Retrieval-Augmented Generation for Code Completion:\n  Experience on WeChat",
      "summary": "Code completion, a crucial task in software engineering that enhances\ndeveloper productivity, has seen substantial improvements with the rapid\nadvancement of large language models (LLMs). In recent years,\nretrieval-augmented generation (RAG) has emerged as a promising method to\nenhance the code completion capabilities of LLMs, which leverages relevant\ncontext from codebases without requiring model retraining. While existing\nstudies have demonstrated the effectiveness of RAG on public repositories and\nbenchmarks, the potential distribution shift between open-source and\nclosed-source codebases presents unique challenges that remain unexplored. To\nmitigate the gap, we conduct an empirical study to investigate the performance\nof widely-used RAG methods for code completion in the industrial-scale codebase\nof WeChat, one of the largest proprietary software systems. Specifically, we\nextensively explore two main types of RAG methods, namely identifier-based RAG\nand similarity-based RAG, across 26 open-source LLMs ranging from 0.5B to 671B\nparameters. For a more comprehensive analysis, we employ different retrieval\ntechniques for similarity-based RAG, including lexical and semantic retrieval.\nBased on 1,669 internal repositories, we achieve several key findings: (1) both\nRAG methods demonstrate effectiveness in closed-source repositories, with\nsimilarity-based RAG showing superior performance, (2) the effectiveness of\nsimilarity-based RAG improves with more advanced retrieval techniques, where\nBM25 (lexical retrieval) and GTE-Qwen (semantic retrieval) achieve superior\nperformance, and (3) the combination of lexical and semantic retrieval\ntechniques yields optimal results, demonstrating complementary strengths.\nFurthermore, we conduct a developer survey to validate the practical utility of\nRAG methods in real-world development environments.",
      "url": "http://arxiv.org/abs/2507.18515v1",
      "published_time_eastern_timestamp": 1753371391.0
    },
    {
      "title": "Explaining How Visual, Textual and Multimodal Encoders Share Concepts",
      "summary": "Sparse autoencoders (SAEs) have emerged as a powerful technique for\nextracting human-interpretable features from neural networks activations.\nPrevious works compared different models based on SAE-derived features but\nthose comparisons have been restricted to models within the same modality. We\npropose a novel indicator allowing quantitative comparison of models across SAE\nfeatures, and use it to conduct a comparative study of visual, textual and\nmultimodal encoders. We also propose to quantify the Comparative Sharedness of\nindividual features between different classes of models. With these two new\ntools, we conduct several studies on 21 encoders of the three types, with two\nsignificantly different sizes, and considering generalist and domain specific\ndatasets. The results allow to revisit previous studies at the light of\nencoders trained in a multimodal context and to quantify to which extent all\nthese models share some representations or features. They also suggest that\nvisual features that are specific to VLMs among vision encoders are shared with\ntext encoders, highlighting the impact of text pretraining. The code is\navailable at https://github.com/CEA-LIST/SAEshareConcepts",
      "url": "http://arxiv.org/abs/2507.18512v1",
      "published_time_eastern_timestamp": 1753371211.0
    },
    {
      "title": "Delving into Mapping Uncertainty for Mapless Trajectory Prediction",
      "summary": "Recent advances in autonomous driving are moving towards mapless approaches,\nwhere High-Definition (HD) maps are generated online directly from sensor data,\nreducing the need for expensive labeling and maintenance. However, the\nreliability of these online-generated maps remains uncertain. While\nincorporating map uncertainty into downstream trajectory prediction tasks has\nshown potential for performance improvements, current strategies provide\nlimited insights into the specific scenarios where this uncertainty is\nbeneficial. In this work, we first analyze the driving scenarios in which\nmapping uncertainty has the greatest positive impact on trajectory prediction\nand identify a critical, previously overlooked factor: the agent's kinematic\nstate. Building on these insights, we propose a novel Proprioceptive Scenario\nGating that adaptively integrates map uncertainty into trajectory prediction\nbased on forecasts of the ego vehicle's future kinematics. This lightweight,\nself-supervised approach enhances the synergy between online mapping and\ntrajectory prediction, providing interpretability around where uncertainty is\nadvantageous and outperforming previous integration methods. Additionally, we\nintroduce a Covariance-based Map Uncertainty approach that better aligns with\nmap geometry, further improving trajectory prediction. Extensive ablation\nstudies confirm the effectiveness of our approach, achieving up to 23.6%\nimprovement in mapless trajectory prediction performance over the\nstate-of-the-art method using the real-world nuScenes driving dataset. Our\ncode, data, and models are publicly available at\nhttps://github.com/Ethan-Zheng136/Map-Uncertainty-for-Trajectory-Prediction.",
      "url": "http://arxiv.org/abs/2507.18498v1",
      "published_time_eastern_timestamp": 1753369991.0
    },
    {
      "title": "Q-Former Autoencoder: A Modern Framework for Medical Anomaly Detection",
      "summary": "Anomaly detection in medical images is an important yet challenging task due\nto the diversity of possible anomalies and the practical impossibility of\ncollecting comprehensively annotated data sets. In this work, we tackle\nunsupervised medical anomaly detection proposing a modernized autoencoder-based\nframework, the Q-Former Autoencoder, that leverages state-of-the-art pretrained\nvision foundation models, such as DINO, DINOv2 and Masked Autoencoder. Instead\nof training encoders from scratch, we directly utilize frozen vision foundation\nmodels as feature extractors, enabling rich, multi-stage, high-level\nrepresentations without domain-specific fine-tuning. We propose the usage of\nthe Q-Former architecture as the bottleneck, which enables the control of the\nlength of the reconstruction sequence, while efficiently aggregating multiscale\nfeatures. Additionally, we incorporate a perceptual loss computed using\nfeatures from a pretrained Masked Autoencoder, guiding the reconstruction\ntowards semantically meaningful structures. Our framework is evaluated on four\ndiverse medical anomaly detection benchmarks, achieving state-of-the-art\nresults on BraTS2021, RESC, and RSNA. Our results highlight the potential of\nvision foundation model encoders, pretrained on natural images, to generalize\neffectively to medical image analysis tasks without further fine-tuning. We\nrelease the code and models at https://github.com/emirhanbayar/QFAE.",
      "url": "http://arxiv.org/abs/2507.18481v1",
      "published_time_eastern_timestamp": 1753368933.0
    },
    {
      "title": "Automated Code Review Using Large Language Models with Symbolic\n  Reasoning",
      "summary": "Code review is one of the key processes in the software development lifecycle\nand is essential to maintain code quality. However, manual code review is\nsubjective and time consuming. Given its rule-based nature, code review is well\nsuited for automation. In recent years, significant efforts have been made to\nautomate this process with the help of artificial intelligence. Recent\ndevelopments in Large Language Models (LLMs) have also emerged as a promising\ntool in this area, but these models often lack the logical reasoning\ncapabilities needed to fully understand and evaluate code. To overcome this\nlimitation, this study proposes a hybrid approach that integrates symbolic\nreasoning techniques with LLMs to automate the code review process. We tested\nour approach using the CodexGlue dataset, comparing several models, including\nCodeT5, CodeBERT, and GraphCodeBERT, to assess the effectiveness of combining\nsymbolic reasoning and prompting techniques with LLMs. Our results show that\nthis approach improves the accuracy and efficiency of automated code review.",
      "url": "http://arxiv.org/abs/2507.18476v1",
      "published_time_eastern_timestamp": 1753368627.0
    },
    {
      "title": "CRUISE: Cooperative Reconstruction and Editing in V2X Scenarios using\n  Gaussian Splatting",
      "summary": "Vehicle-to-everything (V2X) communication plays a crucial role in autonomous\ndriving, enabling cooperation between vehicles and infrastructure. While\nsimulation has significantly contributed to various autonomous driving tasks,\nits potential for data generation and augmentation in V2X scenarios remains\nunderexplored. In this paper, we introduce CRUISE, a comprehensive\nreconstruction-and-synthesis framework designed for V2X driving environments.\nCRUISE employs decomposed Gaussian Splatting to accurately reconstruct\nreal-world scenes while supporting flexible editing. By decomposing dynamic\ntraffic participants into editable Gaussian representations, CRUISE allows for\nseamless modification and augmentation of driving scenes. Furthermore, the\nframework renders images from both ego-vehicle and infrastructure views,\nenabling large-scale V2X dataset augmentation for training and evaluation. Our\nexperimental results demonstrate that: 1) CRUISE reconstructs real-world V2X\ndriving scenes with high fidelity; 2) using CRUISE improves 3D detection across\nego-vehicle, infrastructure, and cooperative views, as well as cooperative 3D\ntracking on the V2X-Seq benchmark; and 3) CRUISE effectively generates\nchallenging corner cases.",
      "url": "http://arxiv.org/abs/2507.18473v1",
      "published_time_eastern_timestamp": 1753368524.0
    },
    {
      "title": "DriftMoE: A Mixture of Experts Approach to Handle Concept Drifts",
      "summary": "Learning from non-stationary data streams subject to concept drift requires\nmodels that can adapt on-the-fly while remaining resource-efficient. Existing\nadaptive ensemble methods often rely on coarse-grained adaptation mechanisms or\nsimple voting schemes that fail to optimally leverage specialized knowledge.\nThis paper introduces DriftMoE, an online Mixture-of-Experts (MoE) architecture\nthat addresses these limitations through a novel co-training framework.\nDriftMoE features a compact neural router that is co-trained alongside a pool\nof incremental Hoeffding tree experts. The key innovation lies in a symbiotic\nlearning loop that enables expert specialization: the router selects the most\nsuitable expert for prediction, the relevant experts update incrementally with\nthe true label, and the router refines its parameters using a multi-hot\ncorrectness mask that reinforces every accurate expert. This feedback loop\nprovides the router with a clear training signal while accelerating expert\nspecialization. We evaluate DriftMoE's performance across nine state-of-the-art\ndata stream learning benchmarks spanning abrupt, gradual, and real-world drifts\ntesting two distinct configurations: one where experts specialize on data\nregimes (multi-class variant), and another where they focus on single-class\nspecialization (task-based variant). Our results demonstrate that DriftMoE\nachieves competitive results with state-of-the-art stream learning adaptive\nensembles, offering a principled and efficient approach to concept drift\nadaptation. All code, data pipelines, and reproducibility scripts are available\nin our public GitHub repository: https://github.com/miguel-ceadar/drift-moe.",
      "url": "http://arxiv.org/abs/2507.18464v1",
      "published_time_eastern_timestamp": 1753367960.0
    },
    {
      "title": "Revisiting Physically Realizable Adversarial Object Attack against\n  LiDAR-based Detection: Clarifying Problem Formulation and Experimental\n  Protocols",
      "summary": "Adversarial robustness in LiDAR-based 3D object detection is a critical\nresearch area due to its widespread application in real-world scenarios. While\nmany digital attacks manipulate point clouds or meshes, they often lack\nphysical realizability, limiting their practical impact. Physical adversarial\nobject attacks remain underexplored and suffer from poor reproducibility due to\ninconsistent setups and hardware differences. To address this, we propose a\ndevice-agnostic, standardized framework that abstracts key elements of physical\nadversarial object attacks, supports diverse methods, and provides open-source\ncode with benchmarking protocols in simulation and real-world settings. Our\nframework enables fair comparison, accelerates research, and is validated by\nsuccessfully transferring simulated attacks to a physical LiDAR system. Beyond\nthe framework, we offer insights into factors influencing attack success and\nadvance understanding of adversarial robustness in real-world LiDAR perception.",
      "url": "http://arxiv.org/abs/2507.18457v1",
      "published_time_eastern_timestamp": 1753367820.0
    },
    {
      "title": "DIFFA: Large Language Diffusion Models Can Listen and Understand",
      "summary": "Recent advances in Large language models (LLMs) have shown remarkable\ncapabilities across textual and multimodal domains. In parallel,\ndiffusion-based language models have emerged as a promising alternative to the\nautoregressive paradigm, offering improved controllability, bidirectional\ncontext modeling, and robust generation. However, their application to the\naudio modality remains underexplored. In this work, we introduce\n\\textbf{DIFFA}, the first diffusion-based Large Audio-Language Model designed\nto perform spoken language understanding. DIFFA integrates a frozen diffusion\nlanguage model with a lightweight dual-adapter architecture that bridges speech\nunderstanding and natural language reasoning. We employ a two-stage training\npipeline: first, aligning semantic representations via an ASR objective; then,\nlearning instruction-following abilities through synthetic audio-caption pairs\nautomatically generated by prompting LLMs. Despite being trained on only 960\nhours of ASR and 127 hours of synthetic instruction data, DIFFA demonstrates\ncompetitive performance on major benchmarks, including MMSU, MMAU, and\nVoiceBench, outperforming several autoregressive open-source baselines. Our\nresults reveal the potential of diffusion-based language models for efficient\nand scalable audio understanding, opening a new direction for speech-driven AI.\nOur code will be available at https://github.com/NKU-HLT/DIFFA.git.",
      "url": "http://arxiv.org/abs/2507.18452v1",
      "published_time_eastern_timestamp": 1753367752.0
    }
  ]
}