{
  "last_updated": "2025-07-19T17:10:58.968091-04:00",
  "papers": [
    {
      "title": "Hierarchical Rectified Flow Matching with Mini-Batch Couplings",
      "summary": "Flow matching has emerged as a compelling generative modeling approach that\nis widely used across domains. To generate data via a flow matching model, an\nordinary differential equation (ODE) is numerically solved via forward\nintegration of the modeled velocity field. To better capture the multi-modality\nthat is inherent in typical velocity fields, hierarchical flow matching was\nrecently introduced. It uses a hierarchy of ODEs that are numerically\nintegrated when generating data. This hierarchy of ODEs captures the\nmulti-modal velocity distribution just like vanilla flow matching is capable of\nmodeling a multi-modal data distribution. While this hierarchy enables to model\nmulti-modal velocity distributions, the complexity of the modeled distribution\nremains identical across levels of the hierarchy. In this paper, we study how\nto gradually adjust the complexity of the distributions across different levels\nof the hierarchy via mini-batch couplings. We show the benefits of mini-batch\ncouplings in hierarchical rectified flow matching via compelling results on\nsynthetic and imaging data. Code is available at\nhttps://riccizz.github.io/HRF_coupling.",
      "url": "http://arxiv.org/abs/2507.13350v1",
      "published_time_eastern_timestamp": 1752775196.0
    },
    {
      "title": "VisionThink: Smart and Efficient Vision Language Model via Reinforcement\n  Learning",
      "summary": "Recent advancements in vision-language models (VLMs) have improved\nperformance by increasing the number of visual tokens, which are often\nsignificantly longer than text tokens. However, we observe that most real-world\nscenarios do not require such an extensive number of visual tokens. While the\nperformance drops significantly in a small subset of OCR-related tasks, models\nstill perform accurately in most other general VQA tasks with only 1/4\nresolution. Therefore, we propose to dynamically process distinct samples with\ndifferent resolutions, and present a new paradigm for visual token compression,\nnamely, VisionThink. It starts with a downsampled image and smartly decides\nwhether it is sufficient for problem solving. Otherwise, the model could output\na special token to request the higher-resolution image. Compared to existing\nEfficient VLM methods that compress tokens using fixed pruning ratios or\nthresholds, VisionThink autonomously decides whether to compress tokens case by\ncase. As a result, it demonstrates strong fine-grained visual understanding\ncapability on OCR-related tasks, and meanwhile saves substantial visual tokens\non simpler tasks. We adopt reinforcement learning and propose the LLM-as-Judge\nstrategy to successfully apply RL to general VQA tasks. Moreover, we carefully\ndesign a reward function and penalty mechanism to achieve a stable and\nreasonable image resize call ratio. Extensive experiments demonstrate the\nsuperiority, efficiency, and effectiveness of our method. Our code is available\nat https://github.com/dvlab-research/VisionThink.",
      "url": "http://arxiv.org/abs/2507.13348v1",
      "published_time_eastern_timestamp": 1752775195.0
    },
    {
      "title": "$π^3$: Scalable Permutation-Equivariant Visual Geometry Learning",
      "summary": "We introduce $\\pi^3$, a feed-forward neural network that offers a novel\napproach to visual geometry reconstruction, breaking the reliance on a\nconventional fixed reference view. Previous methods often anchor their\nreconstructions to a designated viewpoint, an inductive bias that can lead to\ninstability and failures if the reference is suboptimal. In contrast, $\\pi^3$\nemploys a fully permutation-equivariant architecture to predict\naffine-invariant camera poses and scale-invariant local point maps without any\nreference frames. This design makes our model inherently robust to input\nordering and highly scalable. These advantages enable our simple and bias-free\napproach to achieve state-of-the-art performance on a wide range of tasks,\nincluding camera pose estimation, monocular/video depth estimation, and dense\npoint map reconstruction. Code and models are publicly available.",
      "url": "http://arxiv.org/abs/2507.13347v1",
      "published_time_eastern_timestamp": 1752775193.0
    },
    {
      "title": "Imbalance in Balance: Online Concept Balancing in Generation Models",
      "summary": "In visual generation tasks, the responses and combinations of complex\nconcepts often lack stability and are error-prone, which remains an\nunder-explored area. In this paper, we attempt to explore the causal factors\nfor poor concept responses through elaborately designed experiments. We also\ndesign a concept-wise equalization loss function (IMBA loss) to address this\nissue. Our proposed method is online, eliminating the need for offline dataset\nprocessing, and requires minimal code changes. In our newly proposed complex\nconcept benchmark Inert-CompBench and two other public test sets, our method\nsignificantly enhances the concept response capability of baseline models and\nyields highly competitive results with only a few codes.",
      "url": "http://arxiv.org/abs/2507.13345v1",
      "published_time_eastern_timestamp": 1752775187.0
    },
    {
      "title": "Expansion creates spin-glass order in finite-connectivity models: a\n  rigorous and intuitive approach from the theory of LDPC codes",
      "summary": "Complex free-energy landscapes with many local minima separated by large\nbarriers are believed to underlie glassy behavior across diverse physical\nsystems. This is the heuristic picture associated with replica symmetry\nbreaking (RSB) in spin glasses, but RSB has only been rigorously verified for\ncertain mean-field models with all-to-all connectivity. In this work, we give a\nrigorous proof of finite temperature spin glass order for a family of models\nwith local interactions on finite-connectivity, non-Euclidean expander graphs.\nTo this end, we bypass the RSB formalism entirely, and instead exploit the\nmathematical equivalence of such models to certain low-density parity check\n(LDPC) codes. We use code expansion, a property of LDPC codes which guarantees\nextensive energy barriers around ground states. Together with mild additional\nassumptions, this allows us to construct an explicit decomposition of the\nlow-temperature Gibbs state into disjoint components, each hosting an\nasymptotically long-lived state associated with a local minimum of the\nlandscape. Each component carries at most an exponentially small fraction of\nthe total weight, and almost all components do not contain ground states --\nwhich we take together to define spin-glass order. The proof is elementary, and\ntreats various expanding graph topologies on the same footing, including those\nwith short loops where existing approaches such as the cavity method fail. Our\nresults apply rigorously to diluted p-spin glasses for sufficiently large p,\nand while unproven, we also expect our assumptions to hold in a broader family\nof codes. Motivated by this, we numerically study two simple models, on random\nregular graphs and a regular tesselation of hyperbolic space. We show that both\nmodels undergo two transitions as a function of temperature, corresponding to\nthe onset of weak ergodicity breaking and spin glass order, respectively.",
      "url": "http://arxiv.org/abs/2507.13342v1",
      "published_time_eastern_timestamp": 1752775122.0
    },
    {
      "title": "A Framework of Distributed Source Encryption using Mutual Information\n  Security Criterion and the Strong Converse Theorem",
      "summary": "We reinvestigate the general distributed secure source coding based on the\ncommon key cryptosystem proposed by Oohama and Santoso (ITW 2021). They\nproposed a framework of distributed source encryption and derived the necessary\nand sufficient conditions to have reliable and secure transmission. However,\nthe bounds of the rate region, which specifies both necessary and sufficient\nconditions to have reliable and secure transmission under the proposed\ncryptosystem, were derived based on a self-tailored non-standard} security\ncriterion. In this paper we adopt the standard security criterion, i.e.,\nstandard mutual information. We successfully establish the bounds of the rate\nregion based on this security criterion. Information spectrum method and a\nvariant of Birkhoff-von Neumann theorem play an important role in deriving the\nresult.",
      "url": "http://arxiv.org/abs/2507.13294v1",
      "published_time_eastern_timestamp": 1752771532.0
    },
    {
      "title": "Towards Formal Verification of LLM-Generated Code from Natural Language\n  Prompts",
      "summary": "In the past few years LLMs have emerged as a tool that can aid programmers by\ntaking natural language descriptions and generating code based on it. However,\nLLMs often generate incorrect code that users need to fix and the literature\nsuggests users often struggle to detect these errors. In this work we seek to\noffer formal guarantees of correctness to LLM generated code; such guarantees\ncould improve the experience of using AI Code Assistants and potentially enable\nnatural language programming for users with little or no programming knowledge.\nTo address this challenge we propose to incorporate a formal query language\nthat can represent a user's intent in a formally defined but natural\nlanguage-like manner that a user can confirm matches their intent. Then, using\nsuch a query we propose to verify LLM generated code to ensure it matches the\nuser's intent. We implement these ideas in our system, Astrogator, for the\nAnsible programming language which includes such a formal query language, a\ncalculus for representing the behavior of Ansible programs, and a symbolic\ninterpreter which is used for the verification. On a benchmark suite of 21\ncode-generation tasks, our verifier is able to verify correct code in 83% of\ncases and identify incorrect code in 92%.",
      "url": "http://arxiv.org/abs/2507.13290v1",
      "published_time_eastern_timestamp": 1752771282.0
    },
    {
      "title": "Leveraging Pre-Trained Visual Models for AI-Generated Video Detection",
      "summary": "Recent advances in Generative AI (GenAI) have led to significant improvements\nin the quality of generated visual content. As AI-generated visual content\nbecomes increasingly indistinguishable from real content, the challenge of\ndetecting the generated content becomes critical in combating misinformation,\nensuring privacy, and preventing security threats. Although there has been\nsubstantial progress in detecting AI-generated images, current methods for\nvideo detection are largely focused on deepfakes, which primarily involve human\nfaces. However, the field of video generation has advanced beyond DeepFakes,\ncreating an urgent need for methods capable of detecting AI-generated videos\nwith generic content. To address this gap, we propose a novel approach that\nleverages pre-trained visual models to distinguish between real and generated\nvideos. The features extracted from these pre-trained models, which have been\ntrained on extensive real visual content, contain inherent signals that can\nhelp distinguish real from generated videos. Using these extracted features, we\nachieve high detection performance without requiring additional model training,\nand we further improve performance by training a simple linear classification\nlayer on top of the extracted features. We validated our method on a dataset we\ncompiled (VID-AID), which includes around 10,000 AI-generated videos produced\nby 9 different text-to-video models, along with 4,000 real videos, totaling\nover 7 hours of video content. Our evaluation shows that our approach achieves\nhigh detection accuracy, above 90% on average, underscoring its effectiveness.\nUpon acceptance, we plan to publicly release the code, the pre-trained models,\nand our dataset to support ongoing research in this critical area.",
      "url": "http://arxiv.org/abs/2507.13224v1",
      "published_time_eastern_timestamp": 1752766599.0
    },
    {
      "title": "Performance Portable Gradient Computations Using Source Transformation",
      "summary": "Derivative computation is a key component of optimization, sensitivity\nanalysis, uncertainty quantification, and nonlinear solvers. Automatic\ndifferentiation (AD) is a powerful technique for evaluating such derivatives,\nand in recent years, has been integrated into programming environments such as\nJax, PyTorch, and TensorFlow to support derivative computations needed for\ntraining of machine learning models, resulting in widespread use of these\ntechnologies. The C++ language has become the de facto standard for scientific\ncomputing due to numerous factors, yet language complexity has made the\nadoption of AD technologies for C++ difficult, hampering the incorporation of\npowerful differentiable programming approaches into C++ scientific simulations.\nThis is exacerbated by the increasing emergence of architectures such as GPUs,\nwhich have limited memory capabilities and require massive thread-level\nconcurrency. Portable scientific codes rely on domain specific programming\nmodels such as Kokkos making AD for such codes even more complex. In this\npaper, we will investigate source transformation-based automatic\ndifferentiation using Clad to automatically generate portable and efficient\ngradient computations of Kokkos-based code. We discuss the modifications of\nClad required to differentiate Kokkos abstractions. We will illustrate the\nfeasibility of our proposed strategy by comparing the wall-clock time of the\ngenerated gradient code with the wall-clock time of the input function on\ndifferent cutting edge GPU architectures such as NVIDIA H100, AMD MI250x, and\nIntel Ponte Vecchio GPU. For these three architectures and for the considered\nexample, evaluating up to 10 000 entries of the gradient only took up to 2.17x\nthe wall-clock time of evaluating the input function.",
      "url": "http://arxiv.org/abs/2507.13204v1",
      "published_time_eastern_timestamp": 1752765325.0
    },
    {
      "title": "Orbis: Overcoming Challenges of Long-Horizon Prediction in Driving World\n  Models",
      "summary": "Existing world models for autonomous driving struggle with long-horizon\ngeneration and generalization to challenging scenarios. In this work, we\ndevelop a model using simple design choices, and without additional supervision\nor sensors, such as maps, depth, or multiple cameras. We show that our model\nyields state-of-the-art performance, despite having only 469M parameters and\nbeing trained on 280h of video data. It particularly stands out in difficult\nscenarios like turning maneuvers and urban traffic. We test whether discrete\ntoken models possibly have advantages over continuous models based on flow\nmatching. To this end, we set up a hybrid tokenizer that is compatible with\nboth approaches and allows for a side-by-side comparison. Our study concludes\nin favor of the continuous autoregressive model, which is less brittle on\nindividual design choices and more powerful than the model built on discrete\ntokens. Code, models and qualitative results are publicly available at\nhttps://lmb-freiburg.github.io/orbis.github.io/.",
      "url": "http://arxiv.org/abs/2507.13162v1",
      "published_time_eastern_timestamp": 1752762574.0
    },
    {
      "title": "fastWDM3D: Fast and Accurate 3D Healthy Tissue Inpainting",
      "summary": "Healthy tissue inpainting has significant applications, including the\ngeneration of pseudo-healthy baselines for tumor growth models and the\nfacilitation of image registration. In previous editions of the BraTS Local\nSynthesis of Healthy Brain Tissue via Inpainting Challenge, denoising diffusion\nprobabilistic models (DDPMs) demonstrated qualitatively convincing results but\nsuffered from low sampling speed. To mitigate this limitation, we adapted a 2D\nimage generation approach, combining DDPMs with generative adversarial networks\n(GANs) and employing a variance-preserving noise schedule, for the task of 3D\ninpainting. Our experiments showed that the variance-preserving noise schedule\nand the selected reconstruction losses can be effectively utilized for\nhigh-quality 3D inpainting in a few time steps without requiring adversarial\ntraining. We applied our findings to a different architecture, a 3D wavelet\ndiffusion model (WDM3D) that does not include a GAN component. The resulting\nmodel, denoted as fastWDM3D, obtained a SSIM of 0.8571, a MSE of 0.0079, and a\nPSNR of 22.26 on the BraTS inpainting test set. Remarkably, it achieved these\nscores using only two time steps, completing the 3D inpainting process in 1.81\ns per image. When compared to other DDPMs used for healthy brain tissue\ninpainting, our model is up to 800 x faster while still achieving superior\nperformance metrics. Our proposed method, fastWDM3D, represents a promising\napproach for fast and accurate healthy tissue inpainting. Our code is available\nat https://github.com/AliciaDurrer/fastWDM3D.",
      "url": "http://arxiv.org/abs/2507.13146v1",
      "published_time_eastern_timestamp": 1752761451.0
    },
    {
      "title": "Detecting LLM-generated Code with Subtle Modification by Adversarial\n  Training",
      "summary": "With the rapid development of Large Language Models (LLMs), their powerful\ncode-generation capabilities have been widely applied in tasks like code\ncompletion and automated development, demonstrating the value of improving\ncoding efficiency. However, the extensive use of LLM-generated code also raises\nseveral new challenges. On the one hand, issues such as the regulation of code\nprovenance, copyright disputes, and code quality have become increasingly\nconcerning. How to effectively detect LLM-generated code and ensure its\ncompliant and responsible use has become a critical and urgent issue. On the\nother hand, in practical applications, LLM-generated code is often subject to\nmanual modifications, such as variable renaming or structural adjustments.\nAlthough some recent studies have proposed training-based and zero-shot methods\nfor detecting LLM-generated code, these approaches show insufficient robustness\nwhen facing modified LLM-generated code, and there is a lack of an effective\nsolution. To address the real-world scenario where LLM-generated code may\nundergo minor modifications, we propose CodeGPTSensor+, an enhanced version of\nCodeGPTSensor, which employs adversarial training to improve robustness against\ninput perturbations. CodeGPTSensor+ integrates an adversarial sample generation\nmodule, Multi-objective Identifier and Structure Transformation (MIST), which\nsystematically generates both high-quality and representative adversarial\nsamples. This module effectively enhances the model's resistance against\ndiverse adversarial attacks. Experimental results on the HMCorp dataset\ndemonstrate that CodeGPTSensor+ significantly improves detection accuracy on\nthe adversarial test set while maintaining high accuracy on the original test\nset, showcasing superior robustness compared to CodeGPTSensor.",
      "url": "http://arxiv.org/abs/2507.13123v1",
      "published_time_eastern_timestamp": 1752759496.0
    },
    {
      "title": "Generalized Scattering Matrix Framework for Modeling Implantable\n  Antennas in Multilayered Spherical Media",
      "summary": "This paper presents a unified and efficient framework for analyzing antennas\nembedded in spherically stratified media -- a model broadly applicable to\nimplantable antennas in biomedical systems and radome-enclosed antennas in\nengineering applications. The proposed method decouples the modeling of the\nantenna and its surrounding medium by combining the antenna's free-space\ngeneralized scattering matrix (GSM) with a set of extended spherical scattering\noperators (SSOs) that rigorously capture the electromagnetic interactions with\nmultilayered spherical environments. This decoupling enables rapid reevaluation\nunder arbitrary material variations without re-simulating the antenna, offering\nsubstantial computational advantages over traditional dyadic Green's function\n(DGF)-based MoM approaches. The framework supports a wide range of spherical\nmedia, including radially inhomogeneous and uniaxially anisotropic layers.\nExtensive case studies demonstrate excellent agreement with full-wave and\nDGF-based solutions, confirming the method's accuracy, generality, and\nscalability. Code implementations are provided to facilitate adoption and\nfuture development.",
      "url": "http://arxiv.org/abs/2507.13119v1",
      "published_time_eastern_timestamp": 1752759234.0
    },
    {
      "title": "R^2MoE: Redundancy-Removal Mixture of Experts for Lifelong Concept\n  Learning",
      "summary": "Enabling large-scale generative models to continuously learn new visual\nconcepts is essential for personalizing pre-trained models to meet individual\nuser preferences. Existing approaches for continual visual concept learning are\nconstrained by two fundamental challenges: catastrophic forgetting and\nparameter expansion. In this paper, we propose Redundancy-Removal Mixture of\nExperts (R^2MoE), a parameter-efficient framework for lifelong visual concept\nlearning that effectively learns new concepts while incurring minimal parameter\noverhead. Our framework includes three key innovative contributions: First, we\npropose a mixture-of-experts framework with a routing distillation mechanism\nthat enables experts to acquire concept-specific knowledge while preserving the\ngating network's routing capability, thereby effectively mitigating\ncatastrophic forgetting. Second, we propose a strategy for eliminating\nredundant layer-wise experts that reduces the number of expert parameters by\nfully utilizing previously learned experts. Third, we employ a hierarchical\nlocal attention-guided inference approach to mitigate interference between\ngenerated visual concepts. Extensive experiments have demonstrated that our\nmethod generates images with superior conceptual fidelity compared to the\nstate-of-the-art (SOTA) method, achieving an impressive 87.8\\% reduction in\nforgetting rates and 63.3\\% fewer parameters on the CustomConcept 101 dataset.\nOur code is available at {https://github.com/learninginvision/R2MoE}",
      "url": "http://arxiv.org/abs/2507.13107v1",
      "published_time_eastern_timestamp": 1752758560.0
    },
    {
      "title": "MUPAX: Multidimensional Problem Agnostic eXplainable AI",
      "summary": "Robust XAI techniques should ideally be simultaneously deterministic, model\nagnostic, and guaranteed to converge. We propose MULTIDIMENSIONAL PROBLEM\nAGNOSTIC EXPLAINABLE AI (MUPAX), a deterministic, model agnostic explainability\ntechnique, with guaranteed convergency. MUPAX measure theoretic formulation\ngives principled feature importance attribution through structured perturbation\nanalysis that discovers inherent input patterns and eliminates spurious\nrelationships. We evaluate MUPAX on an extensive range of data modalities and\ntasks: audio classification (1D), image classification (2D), volumetric medical\nimage analysis (3D), and anatomical landmark detection, demonstrating dimension\nagnostic effectiveness. The rigorous convergence guarantees extend to any loss\nfunction and arbitrary dimensions, making MUPAX applicable to virtually any\nproblem context for AI. By contrast with other XAI methods that typically\ndecrease performance when masking, MUPAX not only preserves but actually\nenhances model accuracy by capturing only the most important patterns of the\noriginal data. Extensive benchmarking against the state of the XAI art\ndemonstrates MUPAX ability to generate precise, consistent and understandable\nexplanations, a crucial step towards explainable and trustworthy AI systems.\nThe source code will be released upon publication.",
      "url": "http://arxiv.org/abs/2507.13090v1",
      "published_time_eastern_timestamp": 1752757167.0
    },
    {
      "title": "GLAD: Generalizable Tuning for Vision-Language Models",
      "summary": "Pre-trained vision-language models, such as CLIP, show impressive zero-shot\nrecognition ability and can be easily transferred to specific downstream tasks\nvia prompt tuning, even with limited training data. However, existing prompt\ntuning methods face two main challenges: (1) In few-shot scenarios, data\nscarcity often leads to overfitting, making the model sensitive to changes in\nthe input domain. (2) To mitigate overfitting, these methods typically rely on\ncomplex task-specific model architectures and sensitive hyperparameter tuning,\nseverely restricting their general applicability. To address these issues, we\npropose a simpler and more general framework called GLAD (Generalizable LoRA\ntuning with RegulArized GraDient). We show that merely applying LoRA achieves\nperformance in downstream tasks comparable to current state-of-the-art\nprompt-based methods. While LoRA is effective and easy to use, it remains\nsusceptible to overfitting in few-shot learning scenarios. To mitigate this\nrisk, we introduce a gradient-based regularization technique. This technique\neffectively steers the optimization trajectory, encouraging the model to find a\nmore stable parameter region that is robust to variations in data distribution.\nThrough extensive experiments conducted on 15 benchmark datasets, we\ndemonstrate that GLAD outperforms previous tuning approaches in terms of\nbase-to-novel class generalization, image domain generalization, and\ncross-dataset generalization. The code will be publicly available.",
      "url": "http://arxiv.org/abs/2507.13089v1",
      "published_time_eastern_timestamp": 1752757095.0
    },
    {
      "title": "DiffOSeg: Omni Medical Image Segmentation via Multi-Expert Collaboration\n  Diffusion Model",
      "summary": "Annotation variability remains a substantial challenge in medical image\nsegmentation, stemming from ambiguous imaging boundaries and diverse clinical\nexpertise. Traditional deep learning methods producing single deterministic\nsegmentation predictions often fail to capture these annotator biases. Although\nrecent studies have explored multi-rater segmentation, existing methods\ntypically focus on a single perspective -- either generating a probabilistic\n``gold standard'' consensus or preserving expert-specific preferences -- thus\nstruggling to provide a more omni view. In this study, we propose DiffOSeg, a\ntwo-stage diffusion-based framework, which aims to simultaneously achieve both\nconsensus-driven (combining all experts' opinions) and preference-driven\n(reflecting experts' individual assessments) segmentation. Stage I establishes\npopulation consensus through a probabilistic consensus strategy, while Stage II\ncaptures expert-specific preference via adaptive prompts. Demonstrated on two\npublic datasets (LIDC-IDRI and NPC-170), our model outperforms existing\nstate-of-the-art methods across all evaluated metrics. Source code is available\nat https://github.com/string-ellipses/DiffOSeg .",
      "url": "http://arxiv.org/abs/2507.13087v1",
      "published_time_eastern_timestamp": 1752757047.0
    },
    {
      "title": "The Power of Architecture: Deep Dive into Transformer Architectures for\n  Long-Term Time Series Forecasting",
      "summary": "Transformer-based models have recently become dominant in Long-term Time\nSeries Forecasting (LTSF), yet the variations in their architecture, such as\nencoder-only, encoder-decoder, and decoder-only designs, raise a crucial\nquestion: What Transformer architecture works best for LTSF tasks? However,\nexisting models are often tightly coupled with various time-series-specific\ndesigns, making it difficult to isolate the impact of the architecture itself.\nTo address this, we propose a novel taxonomy that disentangles these designs,\nenabling clearer and more unified comparisons of Transformer architectures. Our\ntaxonomy considers key aspects such as attention mechanisms, forecasting\naggregations, forecasting paradigms, and normalization layers. Through\nextensive experiments, we uncover several key insights: bi-directional\nattention with joint-attention is most effective; more complete forecasting\naggregation improves performance; and the direct-mapping paradigm outperforms\nautoregressive approaches. Furthermore, our combined model, utilizing optimal\narchitectural choices, consistently outperforms several existing models,\nreinforcing the validity of our conclusions. We hope these findings offer\nvaluable guidance for future research on Transformer architectural designs in\nLTSF. Our code is available at https://github.com/HALF111/TSF_architecture.",
      "url": "http://arxiv.org/abs/2507.13043v1",
      "published_time_eastern_timestamp": 1752754564.0
    },
    {
      "title": "Resurrect Mask AutoRegressive Modeling for Efficient and Scalable Image\n  Generation",
      "summary": "AutoRegressive (AR) models have made notable progress in image generation,\nwith Masked AutoRegressive (MAR) models gaining attention for their efficient\nparallel decoding. However, MAR models have traditionally underperformed when\ncompared to standard AR models. This study refines the MAR architecture to\nimprove image generation quality. We begin by evaluating various image\ntokenizers to identify the most effective one. Subsequently, we introduce an\nimproved Bidirectional LLaMA architecture by replacing causal attention with\nbidirectional attention and incorporating 2D RoPE, which together form our\nadvanced model, MaskGIL. Scaled from 111M to 1.4B parameters, MaskGIL achieves\na FID score of 3.71, matching state-of-the-art AR models in the ImageNet\n256x256 benchmark, while requiring only 8 inference steps compared to the 256\nsteps of AR models. Furthermore, we develop a text-driven MaskGIL model with\n775M parameters for generating images from text at various resolutions. Beyond\nimage generation, MaskGIL extends to accelerate AR-based generation and enable\nreal-time speech-to-image conversion. Our codes and models are available at\nhttps://github.com/synbol/MaskGIL.",
      "url": "http://arxiv.org/abs/2507.13032v1",
      "published_time_eastern_timestamp": 1752753758.0
    },
    {
      "title": "Rethinking the Embodied Gap in Vision-and-Language Navigation: A\n  Holistic Study of Physical and Visual Disparities",
      "summary": "Recent Vision-and-Language Navigation (VLN) advancements are promising, but\ntheir idealized assumptions about robot movement and control fail to reflect\nphysically embodied deployment challenges. To bridge this gap, we introduce\nVLN-PE, a physically realistic VLN platform supporting humanoid, quadruped, and\nwheeled robots. For the first time, we systematically evaluate several\nego-centric VLN methods in physical robotic settings across different technical\npipelines, including classification models for single-step discrete action\nprediction, a diffusion model for dense waypoint prediction, and a train-free,\nmap-based large language model (LLM) integrated with path planning. Our results\nreveal significant performance degradation due to limited robot observation\nspace, environmental lighting variations, and physical challenges like\ncollisions and falls. This also exposes locomotion constraints for legged\nrobots in complex environments. VLN-PE is highly extensible, allowing seamless\nintegration of new scenes beyond MP3D, thereby enabling more comprehensive VLN\nevaluation. Despite the weak generalization of current models in physical\ndeployment, VLN-PE provides a new pathway for improving cross-embodiment's\noverall adaptability. We hope our findings and tools inspire the community to\nrethink VLN limitations and advance robust, practical VLN models. The code is\navailable at https://crystalsixone.github.io/vln_pe.github.io/.",
      "url": "http://arxiv.org/abs/2507.13019v1",
      "published_time_eastern_timestamp": 1752752760.0
    }
  ]
}