{
  "last_updated": "2025-10-20T02:18:49.956834-04:00",
  "papers": [
    {
      "title": "OmniVinci: Enhancing Architecture and Data for Omni-Modal Understanding\n  LLM",
      "summary": "Advancing machine intelligence requires developing the ability to perceive\nacross multiple modalities, much as humans sense the world. We introduce\nOmniVinci, an initiative to build a strong, open-source, omni-modal LLM. We\ncarefully study the design choices across model architecture and data curation.\nFor model architecture, we present three key innovations: (i) OmniAlignNet for\nstrengthening alignment between vision and audio embeddings in a shared\nomni-modal latent space; (ii) Temporal Embedding Grouping for capturing\nrelative temporal alignment between vision and audio signals; and (iii)\nConstrained Rotary Time Embedding for encoding absolute temporal information in\nomni-modal embeddings. We introduce a curation and synthesis pipeline that\ngenerates 24M single-modal and omni-modal conversations. We find that\nmodalities reinforce one another in both perception and reasoning. Our model,\nOmniVinci, outperforms Qwen2.5-Omni with +19.05 on DailyOmni (cross-modal\nunderstanding), +1.7 on MMAR (audio), and +3.9 on Video-MME (vision), while\nusing just 0.2T training tokens - a 6 times reduction compared to\nQwen2.5-Omni's 1.2T. We finally demonstrate omni-modal advantages in downstream\napplications spanning robotics, medical AI, and smart factory.",
      "url": "http://arxiv.org/abs/2510.15870v1",
      "published_time_eastern_timestamp": 1760723999.0
    },
    {
      "title": "PokeeResearch: Effective Deep Research via Reinforcement Learning from\n  AI Feedback and Robust Reasoning Scaffold",
      "summary": "Tool-augmented large language models (LLMs) are emerging as deep research\nagents, systems that decompose complex queries, retrieve external evidence, and\nsynthesize grounded responses. Yet current agents remain limited by shallow\nretrieval, weak alignment metrics, and brittle tool-use behavior. We introduce\nPokeeResearch-7B, a 7B-parameter deep research agent built under a unified\nreinforcement learning framework for robustness, alignment, and scalability.\nPokeeResearch-7B is trained by an annotation-free Reinforcement Learning from\nAI Feedback (RLAIF) framework to optimize policies using LLM-based reward\nsignals that capture factual accuracy, citation faithfulness, and instruction\nadherence. A chain-of-thought-driven multi-call reasoning scaffold further\nenhances robustness through self-verification and adaptive recovery from tool\nfailures. Among 10 popular deep research benchmarks, PokeeResearch-7B achieves\nstate-of-the-art performance among 7B-scale deep research agents. This\nhighlights that careful reinforcement learning and reasoning design can produce\nefficient, resilient, and research-grade AI agents. The model and inference\ncode is open-sourced under MIT license at\nhttps://github.com/Pokee-AI/PokeeResearchOSS.",
      "url": "http://arxiv.org/abs/2510.15862v1",
      "published_time_eastern_timestamp": 1760723586.0
    },
    {
      "title": "InfiMed-ORBIT: Aligning LLMs on Open-Ended Complex Tasks via\n  Rubric-Based Incremental Training",
      "summary": "Large Language Models (LLMs) have shown substantial advances through\nreinforcement learning (RL), particularly in domains where rewards can be\nprogrammatically verified, such as mathematics and code. In these areas, models\nbenefit from a well-defined operational base guided by explicit rule-based\nobjectives. However, this progress reveals a significant limitation: in\nopen-ended domains where rewards are ambiguous, subjective, or\ncontext-dependent, such as creative writing, scientific reasoning, and notably\nmedical consultation, robust reward functions are lacking, making these areas\nchallenging for current RL strategies. To bridge this gap, we introduce ORBIT,\nan open-ended rubric-based incremental training framework specifically designed\nfor high-stakes medical dialogue. ORBIT integrates syn- thetic dialogue\ngeneration with the dynamic creation of rubrics, employing these rubrics to\ndirect an incremental RL process. In particular, this approach does not depend\non external medical knowledge or manual rules, instead utilizing rubric-guided\nfeedback to shape learning. When implemented on the Qwen3-4B-Instruct model,\nour method can greatly enhance its performance on the HealthBench-Hard\nbenchmark from 7.0 to 27.2 using only 2k samples, thus achieving\nstate-of-the-art results for models of this scale. Our analysis confirms that\nrubric-driven RL fos-ters consistent performance gains across diverse\nconsultation scenarios, going beyond simple numerical improvements. These\nfindings underscore rubric-based feedback as a scalable strategy for advancing\nLLMs in intricate, open-ended tasks.",
      "url": "http://arxiv.org/abs/2510.15859v1",
      "published_time_eastern_timestamp": 1760723488.0
    },
    {
      "title": "Memory-SAM: Human-Prompt-Free Tongue Segmentation via\n  Retrieval-to-Prompt",
      "summary": "Accurate tongue segmentation is crucial for reliable TCM analysis. Supervised\nmodels require large annotated datasets, while SAM-family models remain\nprompt-driven. We present Memory-SAM, a training-free, human-prompt-free\npipeline that automatically generates effective prompts from a small memory of\nprior cases via dense DINOv3 features and FAISS retrieval. Given a query image,\nmask-constrained correspondences to the retrieved exemplar are distilled into\nforeground/background point prompts that guide SAM2 without manual clicks or\nmodel fine-tuning. We evaluate on 600 expert-annotated images (300 controlled,\n300 in-the-wild). On the mixed test split, Memory-SAM achieves mIoU 0.9863,\nsurpassing FCN (0.8188) and a detector-to-box SAM baseline (0.1839). On\ncontrolled data, ceiling effects above 0.98 make small differences less\nmeaningful given annotation variability, while our method shows clear gains\nunder real-world conditions. Results indicate that retrieval-to-prompt enables\ndata-efficient, robust segmentation of irregular boundaries in tongue imaging.\nThe code is publicly available at https://github.com/jw-chae/memory-sam.",
      "url": "http://arxiv.org/abs/2510.15849v1",
      "published_time_eastern_timestamp": 1760722948.0
    },
    {
      "title": "Aiming for Proxima Centauri b: Gravitational effects on relativistic\n  spacecraft trajectories",
      "summary": "How important are gravitational and relativistic effects for interstellar\ntravel? We consider this question in the context of proposed laser-propelled\nspacecraft missions to neighboring stellar destinations. Our analysis applies\nto any spacecraft traveling at relativistic speeds. As a concrete example, we\nfocus on a mission to Proxima Centauri b -- a terrestrial-sized planet in the\nhabitable zone around our nearest stellar neighbor, Proxima Centauri. We employ\na Julia reimplementation of the PoMiN code, an N-body code modeling\nrelativistic gravitational dynamics in the first post-Minkowskian (PM)\napproximation to general relativity (valid to linear order in Newton's constant\n$G$). We compute the gravitational influence of seven different celestial\nbodies and find that the Sun has the greatest influence on the trajectory of\nthe interstellar spacecraft. We also study the differences between Newtonian\nand PM gravity, and find that if mission planners wish to hit Proxima Centauri\nb with an accuracy of better than about 690,000 kilometers, relativistic\neffects must be taken into account. To solve for the precise initial data\nneeded to hit an intended target, we develop numerical fine-tuning methods and\ndemonstrate that these methods can (within a given model) be precise to about a\nfemtometer over a travel distance of $\\sim4.25$ light years. However, we find\nthat for the spacecraft trajectories we consider, higher order general\nrelativistic effects (beyond the first PM approximation) from the Sun can\ndisplace the final position of the spacecraft by tens of kilometers. We also\nconsider the variation in the initial direction of the spacecraft velocity and\nfind that, even with relativistic effects properly taken into account, the miss\ndistances can be dominated by the variation in the initial velocity that could\narise from errors during the launch and boost phase of the spacecraft mission.",
      "url": "http://arxiv.org/abs/2510.15827v1",
      "published_time_eastern_timestamp": 1760720980.0
    },
    {
      "title": "Uno: A One-Stop Solution for Inter- and Intra-Datacenter Congestion\n  Control and Reliable Connectivity",
      "summary": "Cloud computing and AI workloads are driving unprecedented demand for\nefficient communication within and across datacenters. However, the coexistence\nof intra- and inter-datacenter traffic within datacenters plus the disparity\nbetween the RTTs of intra- and inter-datacenter networks complicates congestion\nmanagement and traffic routing. Particularly, faster congestion responses of\nintra-datacenter traffic causes rate unfairness when competing with slower\ninter-datacenter flows. Additionally, inter-datacenter messages suffer from\nslow loss recovery and, thus, require reliability. Existing solutions overlook\nthese challenges and handle inter- and intra-datacenter congestion with\nseparate control loops or at different granularities. We propose Uno, a unified\nsystem for both inter- and intra-DC environments that integrates a transport\nprotocol for rapid congestion reaction and fair rate control with a load\nbalancing scheme that combines erasure coding and adaptive routing. Our\nfindings show that Uno significantly improves the completion times of both\ninter- and intra-DC flows compared to state-of-the-art methods such as Gemini.",
      "url": "http://arxiv.org/abs/2510.15802v1",
      "published_time_eastern_timestamp": 1760718472.0
    },
    {
      "title": "ReCon: Region-Controllable Data Augmentation with Rectification and\n  Alignment for Object Detection",
      "summary": "The scale and quality of datasets are crucial for training robust perception\nmodels. However, obtaining large-scale annotated data is both costly and\ntime-consuming. Generative models have emerged as a powerful tool for data\naugmentation by synthesizing samples that adhere to desired distributions.\nHowever, current generative approaches often rely on complex post-processing or\nextensive fine-tuning on massive datasets to achieve satisfactory results, and\nthey remain prone to content-position mismatches and semantic leakage. To\novercome these limitations, we introduce ReCon, a novel augmentation framework\nthat enhances the capacity of structure-controllable generative models for\nobject detection. ReCon integrates region-guided rectification into the\ndiffusion sampling process, using feedback from a pre-trained perception model\nto rectify misgenerated regions within diffusion sampling process. We further\npropose region-aligned cross-attention to enforce spatial-semantic alignment\nbetween image regions and their textual cues, thereby improving both semantic\nconsistency and overall image fidelity. Extensive experiments demonstrate that\nReCon substantially improve the quality and trainability of generated data,\nachieving consistent performance gains across various datasets, backbone\narchitectures, and data scales. Our code is available at\nhttps://github.com/haoweiz23/ReCon .",
      "url": "http://arxiv.org/abs/2510.15783v1",
      "published_time_eastern_timestamp": 1760717166.0
    },
    {
      "title": "SANR: Scene-Aware Neural Representation for Light Field Image\n  Compression with Rate-Distortion Optimization",
      "summary": "Light field images capture multi-view scene information and play a crucial\nrole in 3D scene reconstruction. However, their high-dimensional nature results\nin enormous data volumes, posing a significant challenge for efficient\ncompression in practical storage and transmission scenarios. Although neural\nrepresentation-based methods have shown promise in light field image\ncompression, most approaches rely on direct coordinate-to-pixel mapping through\nimplicit neural representation (INR), often neglecting the explicit modeling of\nscene structure. Moreover, they typically lack end-to-end rate-distortion\noptimization, limiting their compression efficiency. To address these\nlimitations, we propose SANR, a Scene-Aware Neural Representation framework for\nlight field image compression with end-to-end rate-distortion optimization. For\nscene awareness, SANR introduces a hierarchical scene modeling block that\nleverages multi-scale latent codes to capture intrinsic scene structures,\nthereby reducing the information gap between INR input coordinates and the\ntarget light field image. From a compression perspective, SANR is the first to\nincorporate entropy-constrained quantization-aware training (QAT) into neural\nrepresentation-based light field image compression, enabling end-to-end\nrate-distortion optimization. Extensive experiment results demonstrate that\nSANR significantly outperforms state-of-the-art techniques regarding\nrate-distortion performance with a 65.62\\% BD-rate saving against HEVC.",
      "url": "http://arxiv.org/abs/2510.15775v1",
      "published_time_eastern_timestamp": 1760716843.0
    },
    {
      "title": "EASELAN: An Open-Source Framework for Multimodal Biosignal Annotation\n  and Data Management",
      "summary": "Recent advancements in machine learning and adaptive cognitive systems are\ndriving a growing demand for large and richly annotated multimodal data. A\nprominent example of this trend are fusion models, which increasingly\nincorporate multiple biosignals in addition to traditional audiovisual\nchannels. This paper introduces the EASELAN annotation framework to improve\nannotation workflows designed to address the resulting rising complexity of\nmultimodal and biosignals datasets. It builds on the robust ELAN tool by adding\nnew components tailored to support all stages of the annotation pipeline: From\nstreamlining the preparation of annotation files to setting up additional\nchannels, integrated version control with GitHub, and simplified\npost-processing. EASELAN delivers a seamless workflow designed to integrate\nbiosignals and facilitate rich annotations to be readily exported for further\nanalyses and machine learning-supported model training. The EASELAN framework\nis successfully applied to a high-dimensional biosignals collection initiative\non human everyday activities (here, table setting) for cognitive robots within\nthe DFG-funded Collaborative Research Center 1320 Everyday Activity Science and\nEngineering (EASE). In this paper we discuss the opportunities, limitations,\nand lessons learned when using EASELAN for this initiative. To foster research\non biosignal collection, annotation, and processing, the code of EASELAN is\npublicly available(https://github.com/cognitive-systems-lab/easelan), along\nwith the EASELAN-supported fully annotated Table Setting Database.",
      "url": "http://arxiv.org/abs/2510.15767v1",
      "published_time_eastern_timestamp": 1760716564.0
    },
    {
      "title": "QSilk: Micrograin Stabilization and Adaptive Quantile Clipping for\n  Detail-Friendly Latent Diffusion",
      "summary": "We present QSilk, a lightweight, always-on stabilization layer for latent\ndiffusion that improves high-frequency fidelity while suppressing rare\nactivation spikes. QSilk combines (i) a per-sample micro clamp that gently\nlimits extreme values without washing out texture, and (ii) Adaptive Quantile\nClip (AQClip), which adapts the allowed value corridor per region. AQClip can\noperate in a proxy mode using local structure statistics or in an attention\nentropy guided mode (model confidence). Integrated into the CADE 2.5 rendering\npipeline, QSilk yields cleaner, sharper results at low step counts and\nultra-high resolutions with negligible overhead. It requires no training or\nfine-tuning and exposes minimal user controls. We report consistent qualitative\nimprovements across SD/SDXL backbones and show synergy with CFG/Rescale,\nenabling slightly higher guidance without artifacts.",
      "url": "http://arxiv.org/abs/2510.15761v1",
      "published_time_eastern_timestamp": 1760716230.0
    },
    {
      "title": "Funky: Cloud-Native FPGA Virtualization and Orchestration",
      "summary": "The adoption of FPGAs in cloud-native environments is facing impediments due\nto FPGA limitations and CPU-oriented design of orchestrators, as they lack\nvirtualization, isolation, and preemption support for FPGAs. Consequently,\ncloud providers offer no orchestration services for FPGAs, leading to low\nscalability, flexibility, and resiliency.\n  This paper presents Funky, a full-stack FPGA-aware orchestration engine for\ncloud-native applications. Funky offers primary orchestration services for FPGA\nworkloads to achieve high performance, utilization, scalability, and fault\ntolerance, accomplished by three contributions: (1) FPGA virtualization for\nlightweight sandboxes, (2) FPGA state management enabling task preemption and\ncheckpointing, and (3) FPGA-aware orchestration components following the\nindustry-standard CRI/OCI specifications.\n  We implement and evaluate Funky using four x86 servers with Alveo U50 FPGA\ncards. Our evaluation highlights that Funky allows us to port 23 OpenCL\napplications from the Xilinx Vitis and Rosetta benchmark suites by modifying\n3.4% of the source code while keeping the OCI image sizes 28.7 times smaller\nthan AMD's FPGA-accessible Docker containers. In addition, Funky incurs only\n7.4% performance overheads compared to native execution, while providing\nvirtualization support with strong hypervisor-enforced isolation and\ncloud-native orchestration for a set of distributed FPGAs. Lastly, we evaluate\nFunky's orchestration services in a large-scale cluster using Google production\ntraces, showing its scalability, fault tolerance, and scheduling efficiency.",
      "url": "http://arxiv.org/abs/2510.15755v1",
      "published_time_eastern_timestamp": 1760715552.0
    },
    {
      "title": "NDM: A Noise-driven Detection and Mitigation Framework against Implicit\n  Sexual Intentions in Text-to-Image Generation",
      "summary": "Despite the impressive generative capabilities of text-to-image (T2I)\ndiffusion models, they remain vulnerable to generating inappropriate content,\nespecially when confronted with implicit sexual prompts. Unlike explicit\nharmful prompts, these subtle cues, often disguised as seemingly benign terms,\ncan unexpectedly trigger sexual content due to underlying model biases, raising\nsignificant ethical concerns. However, existing detection methods are primarily\ndesigned to identify explicit sexual content and therefore struggle to detect\nthese implicit cues. Fine-tuning approaches, while effective to some extent,\nrisk degrading the model's generative quality, creating an undesirable\ntrade-off. To address this, we propose NDM, the first noise-driven detection\nand mitigation framework, which could detect and mitigate implicit malicious\nintention in T2I generation while preserving the model's original generative\ncapabilities. Specifically, we introduce two key innovations: first, we\nleverage the separability of early-stage predicted noise to develop a\nnoise-based detection method that could identify malicious content with high\naccuracy and efficiency; second, we propose a noise-enhanced adaptive negative\nguidance mechanism that could optimize the initial noise by suppressing the\nprominent region's attention, thereby enhancing the effectiveness of adaptive\nnegative guidance for sexual mitigation. Experimentally, we validate NDM on\nboth natural and adversarial datasets, demonstrating its superior performance\nover existing SOTA methods, including SLD, UCE, and RECE, etc. Code and\nresources are available at https://github.com/lorraine021/NDM.",
      "url": "http://arxiv.org/abs/2510.15752v1",
      "published_time_eastern_timestamp": 1760715422.0
    },
    {
      "title": "Grassroots Logic Programs: A Secure, Multiagent, Concurrent, Logic\n  Programming Language",
      "summary": "Grassroots platforms are distributed applications run by\\linebreak\ncryptographically-identified people on their networked personal devices, where\nmultiple disjoint platform instances emerge independently and coalesce when\nthey interoperate. Their foundation is the grassroots social graph, upon which\ngrassroots social networks, grassroots cryptocurrencies, and grassroots\ndemocratic federations can be built.\n  Grassroots platforms have yet to be implemented, the key challenge being\nfaulty and malicious participants: without secure programming support, correct\nparticipants cannot reliably identify each other, establish secure\ncommunication, or verify each other's code integrity.\n  We present Grassroots Logic Programs (GLP), a secure, multiagent, concurrent,\nlogic programming language for implementing grassroots platforms. GLP extends\nlogic programs with paired single-reader/single-writer (SRSW) logic variables,\nproviding secure communication channels among cryptographically-identified\npeople through encrypted, signed and attested messages, which enable identity\nand code integrity verification. We present GLP progressively: logic programs,\nconcurrent GLP, multiagent GLP, augmenting it with cryptographic security, and\nproviding smartphone implementation-ready specifications. We prove safety\nproperties including that GLP computations are deductions, SRSW preservation,\nacyclicity, and monotonicity. We prove multiagent GLP is grassroots and that\nGLP streams achieve blockchain security properties. We present a grassroots\nsocial graph protocol establishing authenticated peer-to-peer connections and\ndemonstrate secure grassroots social networking applications.",
      "url": "http://arxiv.org/abs/2510.15747v1",
      "published_time_eastern_timestamp": 1760715267.0
    },
    {
      "title": "Cleaning up the Mess",
      "summary": "A MICRO 2024 best paper runner-up publication (the Mess paper) with all three\nartifact badges awarded (including \"Reproducible\") proposes a new benchmark to\nevaluate real and simulated memory system performance. In this paper, we\ndemonstrate that the Ramulator 2.0 simulation results reported in the Mess\npaper are incorrect and, at the time of the publication of the Mess paper,\nirreproducible. We find that the authors of Mess paper made multiple trivial\nhuman errors in both the configuration and usage of the simulators. We show\nthat by correctly configuring Ramulator 2.0, Ramulator 2.0's simulated memory\nsystem performance actually resembles real system characteristics well, and\nthus a key claimed contribution of the Mess paper is factually incorrect. We\nalso identify that the DAMOV simulation results in the Mess paper use wrong\nsimulation statistics that are unrelated to the simulated DRAM performance.\nMoreover, the Mess paper's artifact repository lacks the necessary sources to\nfully reproduce all the Mess paper's results.\n  Our work corrects the Mess paper's errors regarding Ramulator 2.0 and\nidentifies important issues in the Mess paper's memory simulator evaluation\nmethodology. We emphasize the importance of both carefully and rigorously\nvalidating simulation results and contacting simulator authors and developers,\nin true open source spirit, to ensure these simulators are used with correct\nconfigurations and as intended. We encourage the computer architecture\ncommunity to correct the Mess paper's errors. This is necessary to prevent the\npropagation of inaccurate and misleading results, and to maintain the\nreliability of the scientific record. Our investigation also opens up questions\nabout the integrity of the review and artifact evaluation processes. To aid\nfuture work, our source code and scripts are openly available at https:\n//github.com/CMU-SAFARI/ramulator2/tree/mess.",
      "url": "http://arxiv.org/abs/2510.15744v1",
      "published_time_eastern_timestamp": 1760715190.0
    },
    {
      "title": "Scaling Instruction-Based Video Editing with a High-Quality Synthetic\n  Dataset",
      "summary": "Instruction-based video editing promises to democratize content creation, yet\nits progress is severely hampered by the scarcity of large-scale, high-quality\ntraining data. We introduce Ditto, a holistic framework designed to tackle this\nfundamental challenge. At its heart, Ditto features a novel data generation\npipeline that fuses the creative diversity of a leading image editor with an\nin-context video generator, overcoming the limited scope of existing models. To\nmake this process viable, our framework resolves the prohibitive cost-quality\ntrade-off by employing an efficient, distilled model architecture augmented by\na temporal enhancer, which simultaneously reduces computational overhead and\nimproves temporal coherence. Finally, to achieve full scalability, this entire\npipeline is driven by an intelligent agent that crafts diverse instructions and\nrigorously filters the output, ensuring quality control at scale. Using this\nframework, we invested over 12,000 GPU-days to build Ditto-1M, a new dataset of\none million high-fidelity video editing examples. We trained our model, Editto,\non Ditto-1M with a curriculum learning strategy. The results demonstrate\nsuperior instruction-following ability and establish a new state-of-the-art in\ninstruction-based video editing.",
      "url": "http://arxiv.org/abs/2510.15742v1",
      "published_time_eastern_timestamp": 1760715100.0
    },
    {
      "title": "FACE: A General Framework for Mapping Collaborative Filtering Embeddings\n  into LLM Tokens",
      "summary": "Recently, large language models (LLMs) have been explored for integration\nwith collaborative filtering (CF)-based recommendation systems, which are\ncrucial for personalizing user experiences. However, a key challenge is that\nLLMs struggle to interpret the latent, non-semantic embeddings produced by CF\napproaches, limiting recommendation effectiveness and further applications. To\naddress this, we propose FACE, a general interpretable framework that maps CF\nembeddings into pre-trained LLM tokens. Specifically, we introduce a\ndisentangled projection module to decompose CF embeddings into concept-specific\nvectors, followed by a quantized autoencoder to convert continuous embeddings\ninto LLM tokens (descriptors). Then, we design a contrastive alignment\nobjective to ensure that the tokens align with corresponding textual signals.\nHence, the model-agnostic FACE framework achieves semantic alignment without\nfine-tuning LLMs and enhances recommendation performance by leveraging their\npre-trained capabilities. Empirical results on three real-world recommendation\ndatasets demonstrate performance improvements in benchmark models, with\ninterpretability studies confirming the interpretability of the descriptors.\nCode is available in https://github.com/YixinRoll/FACE.",
      "url": "http://arxiv.org/abs/2510.15729v1",
      "published_time_eastern_timestamp": 1760714394.0
    },
    {
      "title": "Unimedvl: Unifying Medical Multimodal Understanding And Generation\n  Through Observation-Knowledge-Analysis",
      "summary": "Medical diagnostic applications require models that can process multimodal\nmedical inputs (images, patient histories, lab results) and generate diverse\noutputs including both textual reports and visual content (annotations,\nsegmentation masks, and images). Despite this need, existing medical AI systems\ndisrupt this unified process: medical image understanding models interpret\nimages but cannot generate visual outputs, while medical image generation\nmodels synthesize images but cannot provide textual explanations. This leads to\ngaps in data representation, feature integration, and task-level multimodal\ncapabilities. To this end, we propose a multi-level framework that draws\ninspiration from diagnostic workflows through the\nObservation-Knowledge-Analysis (OKA) paradigm. Specifically, at the observation\nlevel, we construct UniMed-5M, a dataset comprising over 5.6M samples that\nreformat diverse unimodal data into multimodal pairs for foundational\nobservation. At the knowledge level, we propose Progressive Curriculum Learning\nthat systematically introduces medical multimodal knowledge. At the analysis\nlevel, we introduce UniMedVL, the first medical unified multimodal model for\nthe simultaneous analysis of image understanding and generation tasks within a\nsingle architecture. UniMedVL achieves superior performance on five medical\nimage understanding benchmarks, while matching specialized models in generation\nquality across eight medical imaging modalities. Crucially, our unified\narchitecture enables bidirectional knowledge sharing: generation tasks enhance\nvisual understanding features, demonstrating that integrating traditionally\nseparate capabilities within a single medical framework unlocks improvements\nacross diverse medical vision-language tasks. Code is available at\nhttps://github.com/uni-medical/UniMedVL.",
      "url": "http://arxiv.org/abs/2510.15710v1",
      "published_time_eastern_timestamp": 1760712898.0
    },
    {
      "title": "GraphMind: Interactive Novelty Assessment System for Accelerating\n  Scientific Discovery",
      "summary": "Large Language Models (LLMs) show strong reasoning and text generation\ncapabilities, prompting their use in scientific literature analysis, including\nnovelty assessment. While evaluating novelty of scientific papers is crucial\nfor peer review, it requires extensive knowledge of related work, something not\nall reviewers have. While recent work on LLM-assisted scientific literature\nanalysis supports literature comparison, existing approaches offer limited\ntransparency and lack mechanisms for result traceability via an information\nretrieval module. To address this gap, we introduce $\\textbf{GraphMind}$, an\neasy-to-use interactive web tool designed to assist users in evaluating the\nnovelty of scientific papers or drafted ideas. Specially, $\\textbf{GraphMind}$\nenables users to capture the main structure of a scientific paper, explore\nrelated ideas through various perspectives, and assess novelty via providing\nverifiable contextual insights. $\\textbf{GraphMind}$ enables users to annotate\nkey elements of a paper, explore related papers through various relationships,\nand assess novelty with contextual insight. This tool integrates external APIs\nsuch as arXiv and Semantic Scholar with LLMs to support annotation, extraction,\nretrieval and classification of papers. This combination provides users with a\nrich, structured view of a scientific idea's core contributions and its\nconnections to existing work. $\\textbf{GraphMind}$ is available at\nhttps://oyarsa.github.io/graphmind and a demonstration video at\nhttps://youtu.be/wKbjQpSvwJg. The source code is available at\nhttps://github.com/oyarsa/graphmind.",
      "url": "http://arxiv.org/abs/2510.15706v1",
      "published_time_eastern_timestamp": 1760712547.0
    },
    {
      "title": "MirrorFuzz: Leveraging LLM and Shared Bugs for Deep Learning Framework\n  APIs Fuzzing",
      "summary": "Deep learning (DL) frameworks serve as the backbone for a wide range of\nartificial intelligence applications. However, bugs within DL frameworks can\ncascade into critical issues in higher-level applications, jeopardizing\nreliability and security. While numerous techniques have been proposed to\ndetect bugs in DL frameworks, research exploring common API patterns across\nframeworks and the potential risks they entail remains limited. Notably, many\nDL frameworks expose similar APIs with overlapping input parameters and\nfunctionalities, rendering them vulnerable to shared bugs, where a flaw in one\nAPI may extend to analogous APIs in other frameworks. To address this\nchallenge, we propose MirrorFuzz, an automated API fuzzing solution to discover\nshared bugs in DL frameworks. MirrorFuzz operates in three stages: First,\nMirrorFuzz collects historical bug data for each API within a DL framework to\nidentify potentially buggy APIs. Second, it matches each buggy API in a\nspecific framework with similar APIs within and across other DL frameworks.\nThird, it employs large language models (LLMs) to synthesize code for the API\nunder test, leveraging the historical bug data of similar APIs to trigger\nanalogous bugs across APIs. We implement MirrorFuzz and evaluate it on four\npopular DL frameworks (TensorFlow, PyTorch, OneFlow, and Jittor). Extensive\nevaluation demonstrates that MirrorFuzz improves code coverage by 39.92\\% and\n98.20\\% compared to state-of-the-art methods on TensorFlow and PyTorch,\nrespectively. Moreover, MirrorFuzz discovers 315 bugs, 262 of which are newly\nfound, and 80 bugs are fixed, with 52 of these bugs assigned CNVD IDs.",
      "url": "http://arxiv.org/abs/2510.15690v1",
      "published_time_eastern_timestamp": 1760711640.0
    },
    {
      "title": "Mixture of Experts Approaches in Dense Retrieval Tasks",
      "summary": "Dense Retrieval Models (DRMs) are a prominent development in Information\nRetrieval (IR). A key challenge with these neural Transformer-based models is\nthat they often struggle to generalize beyond the specific tasks and domains\nthey were trained on. To address this challenge, prior research in IR\nincorporated the Mixture-of-Experts (MoE) framework within each Transformer\nlayer of a DRM, which, though effective, substantially increased the number of\nadditional parameters. In this paper, we propose a more efficient design, which\nintroduces a single MoE block (SB-MoE) after the final Transformer layer. To\nassess the retrieval effectiveness of SB-MoE, we perform an empirical\nevaluation across three IR tasks. Our experiments involve two evaluation\nsetups, aiming to assess both in-domain effectiveness and the model's zero-shot\ngeneralizability. In the first setup, we fine-tune SB-MoE with four different\nunderlying DRMs on seven IR benchmarks and evaluate them on their respective\ntest sets. In the second setup, we fine-tune SB-MoE on MSMARCO and perform\nzero-shot evaluation on thirteen BEIR datasets. Additionally, we perform\nfurther experiments to analyze the model's dependency on its hyperparameters\n(i.e., the number of employed and activated experts) and investigate how this\nvariation affects SB-MoE's performance. The obtained results show that SB-MoE\nis particularly effective for DRMs with lightweight base models, such as\nTinyBERT and BERT-Small, consistently exceeding standard model fine-tuning\nacross benchmarks. For DRMs with more parameters, such as BERT-Base and\nContriever, our model requires a larger number of training samples to achieve\nimproved retrieval performance. Our code is available online at:\nhttps://github.com/FaySokli/SB-MoE.",
      "url": "http://arxiv.org/abs/2510.15683v1",
      "published_time_eastern_timestamp": 1760710999.0
    }
  ]
}