{
  "last_updated": "2025-09-20T11:10:01.855884-04:00",
  "papers": [
    {
      "title": "Lost in Translation? Vocabulary Alignment for Source-Free Domain\n  Adaptation in Open-Vocabulary Semantic Segmentation",
      "summary": "We introduce VocAlign, a novel source-free domain adaptation framework\nspecifically designed for VLMs in open-vocabulary semantic segmentation. Our\nmethod adopts a student-teacher paradigm enhanced with a vocabulary alignment\nstrategy, which improves pseudo-label generation by incorporating additional\nclass concepts. To ensure efficiency, we use Low-Rank Adaptation (LoRA) to\nfine-tune the model, preserving its original capabilities while minimizing\ncomputational overhead. In addition, we propose a Top-K class selection\nmechanism for the student model, which significantly reduces memory\nrequirements while further improving adaptation performance. Our approach\nachieves a notable 6.11 mIoU improvement on the CityScapes dataset and\ndemonstrates superior performance on zero-shot segmentation benchmarks, setting\na new standard for source-free adaptation in the open-vocabulary setting.",
      "url": "http://arxiv.org/abs/2509.15225v1",
      "published_time_eastern_timestamp": 1758218398.0
    },
    {
      "title": "Calibration-Aware Prompt Learning for Medical Vision-Language Models",
      "summary": "Medical Vision-Language Models (Med-VLMs) have demonstrated remarkable\nperformance across diverse medical imaging tasks by leveraging large-scale\nimage-text pretraining. However, their confidence calibration is largely\nunexplored, and so remains a significant challenge. As such, miscalibrated\npredictions can lead to overconfident errors, undermining clinical trust and\ndecision-making reliability. To address this, we introduce CalibPrompt, the\nfirst framework to calibrate Med-VLMs during prompt tuning. CalibPrompt\noptimizes a small set of learnable prompts with carefully designed calibration\nobjectives under scarce labeled data regime. First, we study a regularizer that\nattempts to align the smoothed accuracy with the predicted model confidences.\nSecond, we introduce an angular separation loss to maximize textual feature\nproximity toward improving the reliability in confidence estimates of\nmultimodal Med-VLMs. Extensive experiments on four publicly available Med-VLMs\nand five diverse medical imaging datasets reveal that CalibPrompt consistently\nimproves calibration without drastically affecting clean accuracy. Our code is\navailable at https://github.com/iabh1shekbasu/CalibPrompt.",
      "url": "http://arxiv.org/abs/2509.15226v1",
      "published_time_eastern_timestamp": 1758218398.0
    },
    {
      "title": "Depth AnyEvent: A Cross-Modal Distillation Paradigm for Event-Based\n  Monocular Depth Estimation",
      "summary": "Event cameras capture sparse, high-temporal-resolution visual information,\nmaking them particularly suitable for challenging environments with high-speed\nmotion and strongly varying lighting conditions. However, the lack of large\ndatasets with dense ground-truth depth annotations hinders learning-based\nmonocular depth estimation from event data. To address this limitation, we\npropose a cross-modal distillation paradigm to generate dense proxy labels\nleveraging a Vision Foundation Model (VFM). Our strategy requires an event\nstream spatially aligned with RGB frames, a simple setup even available\noff-the-shelf, and exploits the robustness of large-scale VFMs. Additionally,\nwe propose to adapt VFMs, either a vanilla one like Depth Anything v2 (DAv2),\nor deriving from it a novel recurrent architecture to infer depth from\nmonocular event cameras. We evaluate our approach with synthetic and real-world\ndatasets, demonstrating that i) our cross-modal paradigm achieves competitive\nperformance compared to fully supervised methods without requiring expensive\ndepth annotations, and ii) our VFM-based models achieve state-of-the-art\nperformance.",
      "url": "http://arxiv.org/abs/2509.15224v1",
      "published_time_eastern_timestamp": 1758218391.0
    },
    {
      "title": "ScaleCUA: Scaling Open-Source Computer Use Agents with Cross-Platform\n  Data",
      "summary": "Vision-Language Models (VLMs) have enabled computer use agents (CUAs) that\noperate GUIs autonomously, showing great potential, yet progress is limited by\nthe lack of large-scale, open-source computer use data and foundation models.\nIn this work, we introduce ScaleCUA, a step toward scaling open-source CUAs. It\noffers a large-scale dataset spanning 6 operating systems and 3 task domains,\nbuilt via a closed-loop pipeline uniting automated agents with human experts.\nTrained on this scaled-up data, ScaleCUA can operate seamlessly across\nplatforms. Specifically, it delivers strong gains over baselines (+26.6 on\nWebArena-Lite-v2, +10.7 on ScreenSpot-Pro) and sets new state-of-the-art\nresults (94.4% on MMBench-GUI L1-Hard, 60.6% on OSWorld-G, 47.4% on\nWebArena-Lite-v2). These findings underscore the power of data-driven scaling\nfor general-purpose computer use agents. We will release data, models, and code\nto advance future research: https://github.com/OpenGVLab/ScaleCUA.",
      "url": "http://arxiv.org/abs/2509.15221v1",
      "published_time_eastern_timestamp": 1758218362.0
    },
    {
      "title": "Lightweight and Accurate Multi-View Stereo with Confidence-Aware\n  Diffusion Model",
      "summary": "To reconstruct the 3D geometry from calibrated images, learning-based\nmulti-view stereo (MVS) methods typically perform multi-view depth estimation\nand then fuse depth maps into a mesh or point cloud. To improve the\ncomputational efficiency, many methods initialize a coarse depth map and then\ngradually refine it in higher resolutions. Recently, diffusion models achieve\ngreat success in generation tasks. Starting from a random noise, diffusion\nmodels gradually recover the sample with an iterative denoising process. In\nthis paper, we propose a novel MVS framework, which introduces diffusion models\nin MVS. Specifically, we formulate depth refinement as a conditional diffusion\nprocess. Considering the discriminative characteristic of depth estimation, we\ndesign a condition encoder to guide the diffusion process. To improve\nefficiency, we propose a novel diffusion network combining lightweight 2D U-Net\nand convolutional GRU. Moreover, we propose a novel confidence-based sampling\nstrategy to adaptively sample depth hypotheses based on the confidence\nestimated by diffusion model. Based on our novel MVS framework, we propose two\nnovel MVS methods, DiffMVS and CasDiffMVS. DiffMVS achieves competitive\nperformance with state-of-the-art efficiency in run-time and GPU memory.\nCasDiffMVS achieves state-of-the-art performance on DTU, Tanks & Temples and\nETH3D. Code is available at: https://github.com/cvg/diffmvs.",
      "url": "http://arxiv.org/abs/2509.15220v1",
      "published_time_eastern_timestamp": 1758218359.0
    }
  ]
}