{
  "last_updated": "2025-06-15T05:12:04.663100-04:00",
  "papers": [
    {
      "title": "AutoMind: Adaptive Knowledgeable Agent for Automated Data Science",
      "summary": "Large Language Model (LLM) agents have shown great potential in addressing\nreal-world data science problems. LLM-driven data science agents promise to\nautomate the entire machine learning pipeline, yet their real-world\neffectiveness remains limited. Existing frameworks depend on rigid, pre-defined\nworkflows and inflexible coding strategies; consequently, they excel only on\nrelatively simple, classical problems and fail to capture the empirical\nexpertise that human practitioners bring to complex, innovative tasks. In this\nwork, we introduce AutoMind, an adaptive, knowledgeable LLM-agent framework\nthat overcomes these deficiencies through three key advances: (1) a curated\nexpert knowledge base that grounds the agent in domain expert knowledge, (2) an\nagentic knowledgeable tree search algorithm that strategically explores\npossible solutions, and (3) a self-adaptive coding strategy that dynamically\ntailors code generation to task complexity. Evaluations on two automated data\nscience benchmarks demonstrate that AutoMind delivers superior performance\nversus state-of-the-art baselines. Additional analyses confirm favorable\neffectiveness, efficiency, and qualitative solution quality, highlighting\nAutoMind as an efficient and robust step toward fully automated data science.",
      "url": "http://arxiv.org/abs/2506.10974v1",
      "published_time_eastern_timestamp": 1749751172.0
    },
    {
      "title": "Principled Approaches for Extending Neural Architectures to Function\n  Spaces for Operator Learning",
      "summary": "A wide range of scientific problems, such as those described by\ncontinuous-time dynamical systems and partial differential equations (PDEs),\nare naturally formulated on function spaces. While function spaces are\ntypically infinite-dimensional, deep learning has predominantly advanced\nthrough applications in computer vision and natural language processing that\nfocus on mappings between finite-dimensional spaces. Such fundamental\ndisparities in the nature of the data have limited neural networks from\nachieving a comparable level of success in scientific applications as seen in\nother fields. Neural operators are a principled way to generalize neural\nnetworks to mappings between function spaces, offering a pathway to replicate\ndeep learning's transformative impact on scientific problems. For instance,\nneural operators can learn solution operators for entire classes of PDEs, e.g.,\nphysical systems with different boundary conditions, coefficient functions, and\ngeometries. A key factor in deep learning's success has been the careful\nengineering of neural architectures through extensive empirical testing.\nTranslating these neural architectures into neural operators allows operator\nlearning to enjoy these same empirical optimizations. However, prior neural\noperator architectures have often been introduced as standalone models, not\ndirectly derived as extensions of existing neural network architectures. In\nthis paper, we identify and distill the key principles for constructing\npractical implementations of mappings between infinite-dimensional function\nspaces. Using these principles, we propose a recipe for converting several\npopular neural architectures into neural operators with minimal modifications.\nThis paper aims to guide practitioners through this process and details the\nsteps to make neural operators work in practice. Our code can be found at\nhttps://github.com/neuraloperator/NNs-to-NOs",
      "url": "http://arxiv.org/abs/2506.10973v1",
      "published_time_eastern_timestamp": 1749751171.0
    },
    {
      "title": "Beyond Attention or Similarity: Maximizing Conditional Diversity for\n  Token Pruning in MLLMs",
      "summary": "In multimodal large language models (MLLMs), the length of input visual\ntokens is often significantly greater than that of their textual counterparts,\nleading to a high inference cost. Many works aim to address this issue by\nremoving redundant visual tokens. However, current approaches either rely on\nattention-based pruning, which retains numerous duplicate tokens, or use\nsimilarity-based pruning, overlooking the instruction relevance, consequently\ncausing suboptimal performance. In this paper, we go beyond attention or\nsimilarity by proposing a novel visual token pruning method named CDPruner,\nwhich maximizes the conditional diversity of retained tokens. We first define\nthe conditional similarity between visual tokens conditioned on the\ninstruction, and then reformulate the token pruning problem with determinantal\npoint process (DPP) to maximize the conditional diversity of the selected\nsubset. The proposed CDPruner is training-free and model-agnostic, allowing\neasy application to various MLLMs. Extensive experiments across diverse MLLMs\nshow that CDPruner establishes new state-of-the-art on various vision-language\nbenchmarks. By maximizing conditional diversity through DPP, the selected\nsubset better represents the input images while closely adhering to user\ninstructions, thereby preserving strong performance even with high reduction\nratios. When applied to LLaVA, CDPruner reduces FLOPs by 95\\% and CUDA latency\nby 78\\%, while maintaining 94\\% of the original accuracy. Our code is available\nat https://github.com/Theia-4869/CDPruner.",
      "url": "http://arxiv.org/abs/2506.10967v1",
      "published_time_eastern_timestamp": 1749751149.0
    },
    {
      "title": "MMMG: A Massive, Multidisciplinary, Multi-Tier Generation Benchmark for\n  Text-to-Image Reasoning",
      "summary": "In this paper, we introduce knowledge image generation as a new task,\nalongside the Massive Multi-Discipline Multi-Tier Knowledge-Image Generation\nBenchmark (MMMG) to probe the reasoning capability of image generation models.\nKnowledge images have been central to human civilization and to the mechanisms\nof human learning--a fact underscored by dual-coding theory and the\npicture-superiority effect. Generating such images is challenging, demanding\nmultimodal reasoning that fuses world knowledge with pixel-level grounding into\nclear explanatory visuals. To enable comprehensive evaluation, MMMG offers\n4,456 expert-validated (knowledge) image-prompt pairs spanning 10 disciplines,\n6 educational levels, and diverse knowledge formats such as charts, diagrams,\nand mind maps. To eliminate confounding complexity during evaluation, we adopt\na unified Knowledge Graph (KG) representation. Each KG explicitly delineates a\ntarget image's core entities and their dependencies. We further introduce\nMMMG-Score to evaluate generated knowledge images. This metric combines factual\nfidelity, measured by graph-edit distance between KGs, with visual clarity\nassessment. Comprehensive evaluations of 16 state-of-the-art text-to-image\ngeneration models expose serious reasoning deficits--low entity fidelity, weak\nrelations, and clutter--with GPT-4o achieving an MMMG-Score of only 50.20,\nunderscoring the benchmark's difficulty. To spur further progress, we release\nFLUX-Reason (MMMG-Score of 34.45), an effective and open baseline that combines\na reasoning LLM with diffusion models and is trained on 16,000 curated\nknowledge image-prompt pairs.",
      "url": "http://arxiv.org/abs/2506.10963v1",
      "published_time_eastern_timestamp": 1749751089.0
    },
    {
      "title": "ChineseHarm-Bench: A Chinese Harmful Content Detection Benchmark",
      "summary": "Large language models (LLMs) have been increasingly applied to automated\nharmful content detection tasks, assisting moderators in identifying policy\nviolations and improving the overall efficiency and accuracy of content review.\nHowever, existing resources for harmful content detection are predominantly\nfocused on English, with Chinese datasets remaining scarce and often limited in\nscope. We present a comprehensive, professionally annotated benchmark for\nChinese content harm detection, which covers six representative categories and\nis constructed entirely from real-world data. Our annotation process further\nyields a knowledge rule base that provides explicit expert knowledge to assist\nLLMs in Chinese harmful content detection. In addition, we propose a\nknowledge-augmented baseline that integrates both human-annotated knowledge\nrules and implicit knowledge from large language models, enabling smaller\nmodels to achieve performance comparable to state-of-the-art LLMs. Code and\ndata are available at https://github.com/zjunlp/ChineseHarm-bench.",
      "url": "http://arxiv.org/abs/2506.10960v1",
      "published_time_eastern_timestamp": 1749751025.0
    },
    {
      "title": "SWE-Factory: Your Automated Factory for Issue Resolution Training Data\n  and Evaluation Benchmarks",
      "summary": "Constructing large-scale datasets for the GitHub issue resolution task is\ncrucial for both training and evaluating the software engineering capabilities\nof Large Language Models (LLMs). However, the traditional process for creating\nsuch benchmarks is notoriously challenging and labor-intensive, particularly in\nthe stages of setting up evaluation environments, grading test outcomes, and\nvalidating task instances. In this paper, we propose SWE-Factory, an automated\npipeline designed to address these challenges. To tackle these issues, our\npipeline integrates three core automated components. First, we introduce\nSWE-Builder, a multi-agent system that automates evaluation environment\nconstruction, which employs four specialized agents that work in a\ncollaborative, iterative loop and leverages an environment memory pool to\nenhance efficiency. Second, we introduce a standardized, exit-code-based\ngrading method that eliminates the need for manually writing custom parsers.\nFinally, we automate the fail2pass validation process using these reliable exit\ncode signals. Experiments on 671 issues across four programming languages show\nthat our pipeline can effectively construct valid task instances; for example,\nwith GPT-4.1-mini, our SWE-Builder constructs 269 valid instances at $0.045 per\ninstance, while with Gemini-2.5-flash, it achieves comparable performance at\nthe lowest cost of $0.024 per instance. We also demonstrate that our\nexit-code-based grading achieves 100% accuracy compared to manual inspection,\nand our automated fail2pass validation reaches a precision of 0.92 and a recall\nof 1.00. We hope our automated pipeline will accelerate the collection of\nlarge-scale, high-quality GitHub issue resolution datasets for both training\nand evaluation. Our code and datasets are released at\nhttps://github.com/DeepSoftwareAnalytics/swe-factory.",
      "url": "http://arxiv.org/abs/2506.10954v1",
      "published_time_eastern_timestamp": 1749750857.0
    },
    {
      "title": "Execution Guided Line-by-Line Code Generation",
      "summary": "We present a novel approach to neural code generation that incorporates\nreal-time execution signals into the language model generation process. While\nlarge language models (LLMs) have demonstrated impressive code generation\ncapabilities, they typically do not utilize execution feedback during\ninference, a critical signal that human programmers regularly leverage. Our\nmethod, Execution-Guided Classifier-Free Guidance (EG-CFG), dynamically\nincorporates execution signals as the model generates code, providing\nline-by-line feedback that guides the generation process toward executable\nsolutions. EG-CFG employs a multi-stage process: first, we conduct beam search\nto sample candidate program completions for each line; second, we extract\nexecution signals by executing these candidates against test cases; and\nfinally, we incorporate these signals into the prompt during generation. By\nmaintaining consistent signals across tokens within the same line and\nrefreshing signals at line boundaries, our approach provides coherent guidance\nwhile preserving syntactic structure. Moreover, the method naturally supports\nnative parallelism at the task level in which multiple agents operate in\nparallel, exploring diverse reasoning paths and collectively generating a broad\nset of candidate solutions. Our experiments across diverse coding tasks\ndemonstrate that EG-CFG significantly improves code generation performance\ncompared to standard approaches, achieving state-of-the-art results across\nvarious levels of complexity, from foundational problems to challenging\ncompetitive programming tasks. Our code is available at:\nhttps://github.com/boazlavon/eg_cfg",
      "url": "http://arxiv.org/abs/2506.10948v1",
      "published_time_eastern_timestamp": 1749750605.0
    },
    {
      "title": "Spurious Rewards: Rethinking Training Signals in RLVR",
      "summary": "We show that reinforcement learning with verifiable rewards (RLVR) can elicit\nstrong mathematical reasoning in certain models even with spurious rewards that\nhave little, no, or even negative correlation with the correct answer. For\nexample, RLVR improves MATH-500 performance for Qwen2.5-Math-7B in absolute\npoints by 21.4% (random reward), 13.8% (format reward), 24.1% (incorrect\nlabel), 26.0% (1-shot RL), and 27.1% (majority voting) -- nearly matching the\n29.1% gained with ground truth rewards. However, the spurious rewards that work\nfor Qwen often fail to yield gains with other model families like Llama3 or\nOLMo2. In particular, we find code reasoning -- thinking in code without actual\ncode execution -- to be a distinctive Qwen2.5-Math behavior that becomes\nsignificantly more frequent after RLVR, from 65% to over 90%, even with\nspurious rewards. Overall, we hypothesize that, given the lack of useful reward\nsignal, RLVR must somehow be surfacing useful reasoning representations learned\nduring pretraining, although the exact mechanism remains a topic for future\nwork. We suggest that future RLVR research should possibly be validated on\ndiverse models rather than a single de facto choice, as we show that it is easy\nto get significant performance gains on Qwen models even with completely\nspurious reward signals.",
      "url": "http://arxiv.org/abs/2506.10947v1",
      "published_time_eastern_timestamp": 1749750595.0
    },
    {
      "title": "Non-Abelian dynamics on a cube: improving quantum compilation through\n  qudit-based simulations",
      "summary": "Recent developments in mapping lattice gauge theories relevant to the\nStandard Model onto digital quantum computers identify scalable paths with\nwell-defined quantum compilation challenges toward the continuum. As an entry\npoint to these challenges, we address the simulation of SU(2) lattice gauge\ntheory. Using qudit registers to encode the digitized gauge field, we provide\nquantum resource estimates, in terms of elementary qudit gates, for arbitrarily\nhigh local gauge field truncations. We then demonstrate an end-to-end\nsimulation of real-time, qutrit-digitized SU(2) dynamics on a cube. Through\noptimizing the simulation, we improved circuit decompositions for\nuniformly-controlled qudit rotations, an algorithmic primitive for general\napplications of quantum computing. The decompositions also apply to\nmixed-dimensional qudit systems, which we found advantageous for compiling\nlattice gauge theory simulations. Furthermore, we parallelize the evolution of\nopposite faces in anticipation of similar opportunities arising in\nthree-dimensional lattice volumes. This work details an ambitious executable\nfor future qudit hardware and attests to the value of codesign strategies\nbetween lattice gauge theory simulation and quantum compilation.",
      "url": "http://arxiv.org/abs/2506.10945v1",
      "published_time_eastern_timestamp": 1749750548.0
    },
    {
      "title": "Self-Adapting Language Models",
      "summary": "Large language models (LLMs) are powerful but static; they lack mechanisms to\nadapt their weights in response to new tasks, knowledge, or examples. We\nintroduce Self-Adapting LLMs (SEAL), a framework that enables LLMs to\nself-adapt by generating their own finetuning data and update directives. Given\na new input, the model produces a self-edit-a generation that may restructure\nthe information in different ways, specify optimization hyperparameters, or\ninvoke tools for data augmentation and gradient-based updates. Through\nsupervised finetuning (SFT), these self-edits result in persistent weight\nupdates, enabling lasting adaptation. To train the model to produce effective\nself-edits, we use a reinforcement learning loop with the downstream\nperformance of the updated model as the reward signal. Unlike prior approaches\nthat rely on separate adaptation modules or auxiliary networks, SEAL directly\nuses the model's own generation to control its adaptation process. Experiments\non knowledge incorporation and few-shot generalization show that SEAL is a\npromising step toward language models capable of self-directed adaptation. Our\nwebsite and code is available at https://jyopari.github.io/posts/seal.",
      "url": "http://arxiv.org/abs/2506.10943v1",
      "published_time_eastern_timestamp": 1749750493.0
    },
    {
      "title": "M4V: Multi-Modal Mamba for Text-to-Video Generation",
      "summary": "Text-to-video generation has significantly enriched content creation and\nholds the potential to evolve into powerful world simulators. However, modeling\nthe vast spatiotemporal space remains computationally demanding, particularly\nwhen employing Transformers, which incur quadratic complexity in sequence\nprocessing and thus limit practical applications. Recent advancements in\nlinear-time sequence modeling, particularly the Mamba architecture, offer a\nmore efficient alternative. Nevertheless, its plain design limits its direct\napplicability to multi-modal and spatiotemporal video generation tasks. To\naddress these challenges, we introduce M4V, a Multi-Modal Mamba framework for\ntext-to-video generation. Specifically, we propose a multi-modal diffusion\nMamba (MM-DiM) block that enables seamless integration of multi-modal\ninformation and spatiotemporal modeling through a multi-modal token\nre-composition design. As a result, the Mamba blocks in M4V reduce FLOPs by 45%\ncompared to the attention-based alternative when generating videos at\n768$\\times$1280 resolution. Additionally, to mitigate the visual quality\ndegradation in long-context autoregressive generation processes, we introduce a\nreward learning strategy that further enhances per-frame visual realism.\nExtensive experiments on text-to-video benchmarks demonstrate M4V's ability to\nproduce high-quality videos while significantly lowering computational costs.\nCode and models will be publicly available at\nhttps://huangjch526.github.io/M4V_project.",
      "url": "http://arxiv.org/abs/2506.10915v1",
      "published_time_eastern_timestamp": 1749749380.0
    },
    {
      "title": "The Diffusion Duality",
      "summary": "Uniform-state discrete diffusion models hold the promise of fast text\ngeneration due to their inherent ability to self-correct. However, they are\ntypically outperformed by autoregressive models and masked diffusion models. In\nthis work, we narrow this performance gap by leveraging a key insight:\nUniform-state diffusion processes naturally emerge from an underlying Gaussian\ndiffusion. Our method, Duo, transfers powerful techniques from Gaussian\ndiffusion to improve both training and sampling. First, we introduce a\ncurriculum learning strategy guided by the Gaussian process, doubling training\nspeed by reducing variance. Models trained with curriculum learning surpass\nautoregressive models in zero-shot perplexity on 3 of 7 benchmarks. Second, we\npresent Discrete Consistency Distillation, which adapts consistency\ndistillation from the continuous to the discrete setting. This algorithm\nunlocks few-step generation in diffusion language models by accelerating\nsampling by two orders of magnitude. We provide the code and model checkpoints\non the project page: http://s-sahoo.github.io/duo",
      "url": "http://arxiv.org/abs/2506.10892v1",
      "published_time_eastern_timestamp": 1749747335.0
    },
    {
      "title": "Med-URWKV: Pure RWKV With ImageNet Pre-training For Medical Image\n  Segmentation",
      "summary": "Medical image segmentation is a fundamental and key technology in\ncomputer-aided diagnosis and treatment. Previous methods can be broadly\nclassified into three categories: convolutional neural network (CNN) based,\nTransformer based, and hybrid architectures that combine both. However, each of\nthem has its own limitations, such as restricted receptive fields in CNNs or\nthe computational overhead caused by the quadratic complexity of Transformers.\nRecently, the Receptance Weighted Key Value (RWKV) model has emerged as a\npromising alternative for various vision tasks, offering strong long-range\nmodeling capabilities with linear computational complexity. Some studies have\nalso adapted RWKV to medical image segmentation tasks, achieving competitive\nperformance. However, most of these studies focus on modifications to the\nVision-RWKV (VRWKV) mechanism and train models from scratch, without exploring\nthe potential advantages of leveraging pre-trained VRWKV models for medical\nimage segmentation tasks. In this paper, we propose Med-URWKV, a pure\nRWKV-based architecture built upon the U-Net framework, which incorporates\nImageNet-based pretraining to further explore the potential of RWKV in medical\nimage segmentation tasks. To the best of our knowledge, Med-URWKV is the first\npure RWKV segmentation model in the medical field that can directly reuse a\nlarge-scale pre-trained VRWKV encoder. Experimental results on seven datasets\ndemonstrate that Med-URWKV achieves comparable or even superior segmentation\nperformance compared to other carefully optimized RWKV models trained from\nscratch. This validates the effectiveness of using a pretrained VRWKV encoder\nin enhancing model performance. The codes will be released.",
      "url": "http://arxiv.org/abs/2506.10858v1",
      "published_time_eastern_timestamp": 1749745158.0
    },
    {
      "title": "New class of time-periodic solutions to the 1D cubic wave equation",
      "summary": "In recent papers (arXiv:2407.16507, arXiv:2408.05158) we presented results\nsuggesting the existence of a new class of time-periodic solutions to the\ndefocusing cubic wave equation on a one-dimensional interval with Dirichlet\nboundary conditions. Here we confirm these findings by rigorously constructing\nsolutions from this class. The proof uses rational arithmetic computations to\nverify essential operator bounds.",
      "url": "http://arxiv.org/abs/2506.10839v1",
      "published_time_eastern_timestamp": 1749743799.0
    },
    {
      "title": "Evaluating Large Language Models on Non-Code Software Engineering Tasks",
      "summary": "Large Language Models (LLMs) have demonstrated remarkable capabilities in\ncode understanding and generation; however, their effectiveness on non-code\nSoftware Engineering (SE) tasks remains underexplored. We present the first\ncomprehensive benchmark, which we name `Software Engineering Language\nUnderstanding' (SELU), for evaluating LLMs on 17 non-code tasks, spanning from\nidentifying whether a requirement is functional or non-functional to estimating\nthe effort and complexity of backlog items. SELU covers classification,\nregression, Named Entity Recognition (NER), and Masked Language Modeling (MLM)\ntargets, with data drawn from diverse sources such as code repositories, issue\ntracking systems, and developer forums. We fine-tune 22 open-source LLMs,\nprompt two proprietary alternatives, and train two baselines. Performance is\nmeasured using metrics such as F1-macro, SMAPE, F1-micro, and accuracy, and\ncompared via the Bayesian signed-rank test. Our results show that\nmoderate-scale decoder-only models consistently form a top-tier, exhibiting\nhigh mean performance and low across-task variance, while domain adaptation via\ncode-focused pre-training might yield only modest improvements. These insights\nguide model selection for non-code SE workflows and highlight directions for\nexpanding SELU to generative and design-oriented scenarios.",
      "url": "http://arxiv.org/abs/2506.10833v1",
      "published_time_eastern_timestamp": 1749743552.0
    },
    {
      "title": "ReCUT: Balancing Reasoning Length and Accuracy in LLMs via Stepwise\n  Trails and Preference Optimization",
      "summary": "Recent advances in Chain-of-Thought (CoT) prompting have substantially\nimproved the reasoning capabilities of Large Language Models (LLMs). However,\nthese methods often suffer from overthinking, leading to unnecessarily lengthy\nor redundant reasoning traces. Existing approaches attempt to mitigate this\nissue through curating multiple reasoning chains for training LLMs, but their\neffectiveness is often constrained by the quality of the generated data and\nprone to overfitting. To address the challenge, we propose Reasoning\nCompression ThroUgh Stepwise Trials (ReCUT), a novel method aimed at balancing\nthe accuracy and length of reasoning trajectory. Specifically, ReCUT employs a\nstepwise exploration mechanism and a long-short switched sampling strategy,\nenabling LLMs to incrementally generate diverse reasoning paths. These paths\nare evaluated and used to construct preference pairs to train two specialized\nmodels (Gemini LLMs)-one optimized for reasoning accuracy, the other for\nshorter reasoning. A final integrated model is obtained by interpolating the\nparameters of these two models. Experimental results across multiple math\nreasoning datasets and backbone models demonstrate that ReCUT significantly\nreduces reasoning lengths by approximately 30-50%, while maintaining or\nimproving reasoning accuracy compared to various baselines. All codes and data\nwill be released via https://github.com/NEUIR/ReCUT.",
      "url": "http://arxiv.org/abs/2506.10822v1",
      "published_time_eastern_timestamp": 1749742981.0
    },
    {
      "title": "Occlusion-Aware 3D Hand-Object Pose Estimation with Masked AutoEncoders",
      "summary": "Hand-object pose estimation from monocular RGB images remains a significant\nchallenge mainly due to the severe occlusions inherent in hand-object\ninteractions. Existing methods do not sufficiently explore global structural\nperception and reasoning, which limits their effectiveness in handling occluded\nhand-object interactions. To address this challenge, we propose an\nocclusion-aware hand-object pose estimation method based on masked\nautoencoders, termed as HOMAE. Specifically, we propose a target-focused\nmasking strategy that imposes structured occlusion on regions of hand-object\ninteraction, encouraging the model to learn context-aware features and reason\nabout the occluded structures. We further integrate multi-scale features\nextracted from the decoder to predict a signed distance field (SDF), capturing\nboth global context and fine-grained geometry. To enhance geometric perception,\nwe combine the implicit SDF with an explicit point cloud derived from the SDF,\nleveraging the complementary strengths of both representations. This fusion\nenables more robust handling of occluded regions by combining the global\ncontext from the SDF with the precise local geometry provided by the point\ncloud. Extensive experiments on challenging DexYCB and HO3Dv2 benchmarks\ndemonstrate that HOMAE achieves state-of-the-art performance in hand-object\npose estimation. We will release our code and model.",
      "url": "http://arxiv.org/abs/2506.10816v1",
      "published_time_eastern_timestamp": 1749742247.0
    },
    {
      "title": "Unsupervised Deformable Image Registration with Structural Nonparametric\n  Smoothing",
      "summary": "Learning-based deformable image registration (DIR) accelerates alignment by\namortizing traditional optimization via neural networks. Label supervision\nfurther enhances accuracy, enabling efficient and precise nonlinear alignment\nof unseen scans. However, images with sparse features amid large smooth\nregions, such as retinal vessels, introduce aperture and large-displacement\nchallenges that unsupervised DIR methods struggle to address. This limitation\noccurs because neural networks predict deformation fields in a single forward\npass, leaving fields unconstrained post-training and shifting the\nregularization burden entirely to network weights. To address these issues, we\nintroduce SmoothProper, a plug-and-play neural module enforcing smoothness and\npromoting message passing within the network's forward pass. By integrating a\nduality-based optimization layer with tailored interaction terms, SmoothProper\nefficiently propagates flow signals across spatial locations, enforces\nsmoothness, and preserves structural consistency. It is model-agnostic,\nseamlessly integrates into existing registration frameworks with minimal\nparameter overhead, and eliminates regularizer hyperparameter tuning.\nPreliminary results on a retinal vessel dataset exhibiting aperture and\nlarge-displacement challenges demonstrate our method reduces registration error\nto 1.88 pixels on 2912x2912 images, marking the first unsupervised DIR approach\nto effectively address both challenges. The source code will be available at\nhttps://github.com/tinymilky/SmoothProper.",
      "url": "http://arxiv.org/abs/2506.10813v1",
      "published_time_eastern_timestamp": 1749741963.0
    },
    {
      "title": "Mitigating Negative Interference in Multilingual Sequential Knowledge\n  Editing through Null-Space Constraints",
      "summary": "Efficiently updating multilingual knowledge in large language models (LLMs),\nwhile preserving consistent factual representations across languages, remains a\nlong-standing and unresolved challenge. While deploying separate editing\nsystems for each language might seem viable, this approach incurs substantial\ncosts due to the need to manage multiple models. A more efficient solution\ninvolves integrating knowledge updates across all languages into a unified\nmodel. However, performing sequential edits across languages often leads to\ndestructive parameter interference, significantly degrading multilingual\ngeneralization and the accuracy of injected knowledge. To address this\nchallenge, we propose LangEdit, a novel null-space constrained framework\ndesigned to precisely isolate language-specific knowledge updates. The core\ninnovation of LangEdit lies in its ability to project parameter updates for\neach language onto the orthogonal complement of previous updated subspaces.\nThis approach mathematically guarantees update independence while preserving\nmultilingual generalization capabilities. We conduct a comprehensive evaluation\nacross three model architectures, six languages, and four downstream tasks,\ndemonstrating that LangEdit effectively mitigates parameter interference and\noutperforms existing state-of-the-art editing methods. Our results highlight\nits potential for enabling efficient and accurate multilingual knowledge\nupdates in LLMs. The code is available at\nhttps://github.com/VRCMF/LangEdit.git.",
      "url": "http://arxiv.org/abs/2506.10800v1",
      "published_time_eastern_timestamp": 1749741345.0
    },
    {
      "title": "FASCIST-O-METER: Classifier for Neo-fascist Discourse Online",
      "summary": "Neo-fascism is a political and societal ideology that has been having\nremarkable growth in the last decade in the United States of America (USA), as\nwell as in other Western societies. It poses a grave danger to democracy and\nthe minorities it targets, and it requires active actions against it to avoid\nescalation. This work presents the first-of-its-kind neo-fascist coding scheme\nfor digital discourse in the USA societal context, overseen by political\nscience researchers. Our work bridges the gap between Natural Language\nProcessing (NLP) and political science against this phenomena. Furthermore, to\ntest the coding scheme, we collect a tremendous amount of activity on the\ninternet from notable neo-fascist groups (the forums of Iron March and\nStormfront.org), and the guidelines are applied to a subset of the collected\nposts. Through crowdsourcing, we annotate a total of a thousand posts that are\nlabeled as neo-fascist or non-neo-fascist. With this labeled data set, we\nfine-tune and test both Small Language Models (SLMs) and Large Language Models\n(LLMs), obtaining the very first classification models for neo-fascist\ndiscourse. We find that the prevalence of neo-fascist rhetoric in this kind of\nforum is ever-present, making them a good target for future research. The\nsocietal context is a key consideration for neo-fascist speech when conducting\nNLP research. Finally, the work against this kind of political movement must be\npressed upon and continued for the well-being of a democratic society.\nDisclaimer: This study focuses on detecting neo-fascist content in text,\nsimilar to other hate speech analyses, without labeling individuals or\norganizations.",
      "url": "http://arxiv.org/abs/2506.10789v1",
      "published_time_eastern_timestamp": 1749740538.0
    }
  ]
}