{
  "last_updated": "2025-06-29T23:51:04.186705-04:00",
  "papers": [
    {
      "title": "Derivation of Tissue Properties from Basis-Vector Model Weights for\n  Dual-Energy CT-Based Monte Carlo Proton Beam Dose Calculations",
      "summary": "We propose a novel method, basis vector model material indexing (BVM-MI), for\npredicting atomic composition and mass density from two independent basis\nvector model weights derived from dual-energy CT (DECT) for Monte Carlo (MC)\ndose planning. BVM-MI employs multiple linear regression on BVM weights and\ntheir quotient to predict elemental composition and mass density for 70\nrepresentative tissues. Predicted values were imported into the TOPAS MC code\nto simulate proton dose deposition to a uniform cylinder phantom composed of\neach tissue type. The performance of BVM-MI was compared to the conventional\nHounsfield Unit material indexing method (HU-MI), which estimates elemental\ncomposition and density based on CT numbers (HU). Evaluation metrics included\nabsolute errors in predicted elemental compositions and relative percent errors\nin calculated mass density and mean excitation energy. Dose distributions were\nassessed by quantifying absolute error in the depth of 80% maximum scored dose\n(R80) and relative percent errors in stopping power (SP) between MC simulations\nusing HU-MI, BVM-MI, and benchmark compositions. Lateral dose profiles were\nanalyzed at R80 and Bragg Peak (RBP) depths for three tissues showing the\nlargest discrepancies in R80 depth. BVM-MI outperformed HU-MI in elemental\ncomposition predictions, with mean RMSEs of 1.30% (soft tissue) and 0.1% (bony\ntissue), compared to 4.20% and 1.9% for HU-MI. R80 depth RMSEs were 0.2 mm\n(soft) and 0.1 mm (bony) for BVM-MI, vs. 1.8 mm and 0.7 mm for HU-MI. Lateral\ndose profile analysis showed overall smaller dose errors for BVM-MI across\ncore, halo, and proximal aura regions. In conclusion, fully utilizing the\ntwo-parameter BVM space for material indexing led to significantly improved\nTOPAS MC dose calculations over the conventional HU-MI method, demonstrating\nBVM-MI's potential to enhance proton therapy planning.",
      "url": "http://arxiv.org/abs/2506.22425v1",
      "published_time_eastern_timestamp": 1751046425.0
    },
    {
      "title": "The Automated LLM Speedrunning Benchmark: Reproducing NanoGPT\n  Improvements",
      "summary": "Rapid advancements in large language models (LLMs) have the potential to\nassist in scientific progress. A critical capability toward this endeavor is\nthe ability to reproduce existing work. To evaluate the ability of AI agents to\nreproduce results in an active research area, we introduce the Automated LLM\nSpeedrunning Benchmark, leveraging the research community contributions on the\nNanoGPT speedrun, a competition to train a GPT-2 model in the shortest time.\nEach of the 19 speedrun tasks provides the agent with the previous records\ntraining script, optionally paired with one of three hint formats, ranging from\npseudocode to paper-like descriptions of the new records improvements. Records\nexecute quickly by design and speedrun improvements encompass diverse\ncode-level changes, ranging from high-level algorithmic advancements to\nhardware-aware optimizations. These features make the benchmark both accessible\nand realistic for the frontier problem of improving LLM training. We find that\nrecent reasoning LLMs combined with SoTA scaffolds struggle to reimplement\nalready-known innovations in our benchmark, even when given detailed hints. Our\nbenchmark thus provides a simple, non-saturated measure of an LLMs ability to\nautomate scientific reproduction, a necessary (but not sufficient) skill for an\nautonomous research agent.",
      "url": "http://arxiv.org/abs/2506.22419v1",
      "published_time_eastern_timestamp": 1751046272.0
    },
    {
      "title": "Refining Czech GEC: Insights from a Multi-Experiment Approach",
      "summary": "We present a grammar error correction (GEC) system that achieves state of the\nart for the Czech language. Our system is based on a neural network translation\napproach with the Transformer architecture, and its key feature is its\nreal-time synthetic generation pipeline, which dynamically augments sentences\nwith artificial errors by introducing both language-agnostic and Czech-specific\nerrors. We conduct a comprehensive series of experiments, investigating the\nCzech GEC corpora as bases for synthetic error introduction, several error\ngeneration strategies, domain balancing, tokenization granularity, model size,\nand data scaling during fine-tuning. Additionally, we evaluate the performance\nof large language models (LLMs) on Czech GEC in both end-user and expert\nfine-tuning scenarios. Our best-performing model is superior both in\nperformance and computational efficiency. The source code and the trained model\nlinks are available on https://github.com/ufal/tsd2025-gec.",
      "url": "http://arxiv.org/abs/2506.22402v1",
      "published_time_eastern_timestamp": 1751044900.0
    },
    {
      "title": "Dehazing Light Microscopy Images with Guided Conditional Flow Matching:\n  finding a sweet spot between fidelity and realism",
      "summary": "Fluorescence microscopy is a major driver of scientific progress in the life\nsciences. Although high-end confocal microscopes are capable of filtering\nout-of-focus light, cheaper and more accessible microscopy modalities, such as\nwidefield microscopy, can not, which consequently leads to hazy image data.\nComputational dehazing is trying to combine the best of both worlds, leading to\ncheap microscopy but crisp-looking images. The perception-distortion trade-off\ntells us that we can optimize either for data fidelity, e.g. low MSE or high\nPSNR, or for data realism, measured by perceptual metrics such as LPIPS or FID.\nExisting methods either prioritize fidelity at the expense of realism, or\nproduce perceptually convincing results that lack quantitative accuracy. In\nthis work, we propose HazeMatching, a novel iterative method for dehazing light\nmicroscopy images, which effectively balances these objectives. Our goal was to\nfind a balanced trade-off between the fidelity of the dehazing results and the\nrealism of individual predictions (samples). We achieve this by adapting the\nconditional flow matching framework by guiding the generative process with a\nhazy observation in the conditional velocity field. We evaluate HazeMatching on\n5 datasets, covering both synthetic and real data, assessing both distortion\nand perceptual quality. Our method is compared against 7 baselines, achieving a\nconsistent balance between fidelity and realism on average. Additionally, with\ncalibration analysis, we show that HazeMatching produces well-calibrated\npredictions. Note that our method does not need an explicit degradation\noperator to exist, making it easily applicable on real microscopy data. All\ndata used for training and evaluation and our code will be publicly available\nunder a permissive license.",
      "url": "http://arxiv.org/abs/2506.22397v1",
      "published_time_eastern_timestamp": 1751044243.0
    },
    {
      "title": "What Makes ChatGPT Effective for Software Issue Resolution? An Empirical\n  Study of Developer-ChatGPT Conversations in GitHub",
      "summary": "Conversational large-language models are extensively used for issue\nresolution tasks. However, not all developer-LLM conversations are useful for\neffective issue resolution. In this paper, we analyze 686 developer-ChatGPT\nconversations shared within GitHub issue threads to identify characteristics\nthat make these conversations effective for issue resolution. First, we analyze\nthe conversations and their corresponding issues to distinguish helpful from\nunhelpful conversations. We begin by categorizing the types of tasks developers\nseek help with to better understand the scenarios in which ChatGPT is most\neffective. Next, we examine a wide range of conversational, project, and\nissue-related metrics to uncover factors associated with helpful conversations.\nFinally, we identify common deficiencies in unhelpful ChatGPT responses to\nhighlight areas that could inform the design of more effective developer-facing\ntools. We found that only 62% of the ChatGPT conversations were helpful for\nsuccessful issue resolution. ChatGPT is most effective for code generation and\ntools/libraries/APIs recommendations, but struggles with code explanations.\nHelpful conversations tend to be shorter, more readable, and exhibit stronger\nsemantic and linguistic alignment. Larger, more popular projects and more\nexperienced developers benefit more from ChatGPT. At the issue level, ChatGPT\nperforms best on simpler problems with limited developer activity and faster\nresolution, typically well-scoped tasks like compilation errors. The most\ncommon deficiencies in unhelpful ChatGPT responses include incorrect\ninformation and lack of comprehensiveness. Our findings have wide implications\nincluding guiding developers on effective interaction strategies for issue\nresolution, informing the development of tools or frameworks to support optimal\nprompt design, and providing insights on fine-tuning LLMs for issue resolution\ntasks.",
      "url": "http://arxiv.org/abs/2506.22390v1",
      "published_time_eastern_timestamp": 1751043648.0
    },
    {
      "title": "DiffSoundStream: Efficient Speech Tokenization via Diffusion Decoding",
      "summary": "Token-based language modeling is a prominent approach for speech generation,\nwhere tokens are obtained by quantizing features from self-supervised learning\n(SSL) models and extracting codes from neural speech codecs, generally referred\nto as semantic tokens and acoustic tokens. These tokens are often modeled\nautoregressively, with the inference speed being constrained by the token rate.\nIn this work, we propose DiffSoundStream, a solution that improves the\nefficiency of speech tokenization in non-streaming scenarios through two\ntechniques: (1) conditioning the neural codec on semantic tokens to minimize\nredundancy between semantic and acoustic tokens, and (2) leveraging latent\ndiffusion models to synthesize high-quality waveforms from semantic and\ncoarse-level acoustic tokens. Experiments show that at 50 tokens per second,\nDiffSoundStream achieves speech quality on par with a standard SoundStream\nmodel operating at twice the token rate. Additionally, we achieve step-size\ndistillation using just four diffusion sampling steps with only a minor quality\nloss.",
      "url": "http://arxiv.org/abs/2506.22362v1",
      "published_time_eastern_timestamp": 1751041387.0
    },
    {
      "title": "Concept-Level AI for Telecom: Moving Beyond Large Language Models",
      "summary": "The telecommunications and networking domain stands at the precipice of a\ntransformative era, driven by the necessity to manage increasingly complex,\nhierarchical, multi administrative domains (i.e., several operators on the same\npath) and multilingual systems. Recent research has demonstrated that Large\nLanguage Models (LLMs), with their exceptional general-purpose text analysis\nand code generation capabilities, can be effectively applied to certain telecom\nproblems (e.g., auto-configuration of data plan to meet certain application\nrequirements). However, due to their inherent token-by-token processing and\nlimited capacity for maintaining extended context, LLMs struggle to fulfill\ntelecom-specific requirements such as cross-layer dependency cascades (i.e.,\nover OSI), temporal-spatial fault correlation, and real-time distributed\ncoordination. In contrast, Large Concept Models (LCMs), which reason at the\nabstraction level of semantic concepts rather than individual lexical tokens,\noffer a fundamentally superior approach for addressing these telecom\nchallenges. By employing hyperbolic latent spaces for hierarchical\nrepresentation and encapsulating complex multi-layered network interactions\nwithin concise concept embeddings, LCMs overcome critical shortcomings of LLMs\nin terms of memory efficiency, cross-layer correlation, and native multimodal\nintegration. This paper argues that adopting LCMs is not simply an incremental\nstep, but a necessary evolutionary leap toward achieving robust and effective\nAI-driven telecom management.",
      "url": "http://arxiv.org/abs/2506.22359v1",
      "published_time_eastern_timestamp": 1751041218.0
    },
    {
      "title": "A Deep Learning framework for building damage assessment using VHR SAR\n  and geospatial data: demonstration on the 2023 Turkiye Earthquake",
      "summary": "Building damage identification shortly after a disaster is crucial for\nguiding emergency response and recovery efforts. Although optical satellite\nimagery is commonly used for disaster mapping, its effectiveness is often\nhampered by cloud cover or the absence of pre-event acquisitions. To overcome\nthese challenges, we introduce a novel multimodal deep learning (DL) framework\nfor detecting building damage using single-date very high resolution (VHR)\nSynthetic Aperture Radar (SAR) imagery from the Italian Space Agency (ASI)\nCOSMO SkyMed (CSK) constellation, complemented by auxiliary geospatial data.\nOur method integrates SAR image patches, OpenStreetMap (OSM) building\nfootprints, digital surface model (DSM) data, and structural and exposure\nattributes from the Global Earthquake Model (GEM) to improve detection accuracy\nand contextual interpretation. Unlike existing approaches that depend on pre\nand post event imagery, our model utilizes only post event data, facilitating\nrapid deployment in critical scenarios. The framework effectiveness is\ndemonstrated using a new dataset from the 2023 earthquake in Turkey, covering\nmultiple cities with diverse urban settings. Results highlight that\nincorporating geospatial features significantly enhances detection performance\nand generalizability to previously unseen areas. By combining SAR imagery with\ndetailed vulnerability and exposure information, our approach provides reliable\nand rapid building damage assessments without the dependency from available\npre-event data. Moreover, the automated and scalable data generation process\nensures the framework's applicability across diverse disaster-affected regions,\nunderscoring its potential to support effective disaster management and\nrecovery efforts. Code and data will be made available upon acceptance of the\npaper.",
      "url": "http://arxiv.org/abs/2506.22338v1",
      "published_time_eastern_timestamp": 1751039398.0
    },
    {
      "title": "Less Greedy Equivalence Search",
      "summary": "Greedy Equivalence Search (GES) is a classic score-based algorithm for causal\ndiscovery from observational data. In the sample limit, it recovers the Markov\nequivalence class of graphs that describe the data. Still, it faces two\nchallenges in practice: computational cost and finite-sample accuracy. In this\npaper, we develop Less Greedy Equivalence Search (LGES), a variant of GES that\nretains its theoretical guarantees while partially addressing these\nlimitations. LGES modifies the greedy step: rather than always applying the\nhighest-scoring insertion, it avoids edge insertions between variables for\nwhich the score implies some conditional independence. This more targeted\nsearch yields up to a \\(10\\)-fold speed-up and a substantial reduction in\nstructural error relative to GES. Moreover, LGES can guide the search using\nprior assumptions, while correcting these assumptions when contradicted by the\ndata. Finally, LGES can exploit interventional data to refine the learned\nobservational equivalence class. We prove that LGES recovers the true\nequivalence class in the sample limit from observational and interventional\ndata, even with misspecified prior assumptions. Experiments demonstrate that\nLGES outperforms GES and other baselines in speed, accuracy, and robustness to\nmisspecified assumptions. Our code is available at\nhttps://github.com/CausalAILab/lges.",
      "url": "http://arxiv.org/abs/2506.22331v1",
      "published_time_eastern_timestamp": 1751038788.0
    },
    {
      "title": "Under the Hood of BlotchyQuasar: DLL-Based RAT Campaigns Against Latin\n  America",
      "summary": "A sophisticated malspam campaign was recently uncovered targeting Latin\nAmerican countries, with a particular focus on Brazil. This operation utilizes\na highly deceptive phishing email to trick users into executing a malicious MSI\nfile, initiating a multi-stage infection. The core of the attack leverages DLL\nside-loading, where a legitimate executable from Valve Corporation is used to\nload a trojanized DLL, thereby bypassing standard security defenses.\n  Once active, the malware, a variant of QuasarRAT known as BlotchyQuasar, is\ncapable of a wide range of malicious activities. It is designed to steal\nsensitive browser-stored credentials and banking information, the latter\nthrough fake login windows mimicking well-known Brazilian banks. The threat\nestablishes persistence by modifying the Windows registry , captures user\nkeystrokes through keylogging , and exfiltrates stolen data to a\nCommand-and-Control (C2) server using encrypted payloads. Despite its advanced\ncapabilities, the malware code exhibits signs of rushed development, with\ninefficiencies and poor error handling that suggest the threat actors\nprioritized rapid deployment over meticulous design. Nonetheless, the campaign\nextensive reach and sophisticated mechanisms pose a serious and immediate\nthreat to the targeted regions, underscoring the need for robust cybersecurity\ndefenses.",
      "url": "http://arxiv.org/abs/2506.22323v1",
      "published_time_eastern_timestamp": 1751038570.0
    },
    {
      "title": "DIGS: Dynamic CBCT Reconstruction using Deformation-Informed 4D Gaussian\n  Splatting and a Low-Rank Free-Form Deformation Model",
      "summary": "3D Cone-Beam CT (CBCT) is widely used in radiotherapy but suffers from motion\nartifacts due to breathing. A common clinical approach mitigates this by\nsorting projections into respiratory phases and reconstructing images per\nphase, but this does not account for breathing variability. Dynamic CBCT\ninstead reconstructs images at each projection, capturing continuous motion\nwithout phase sorting. Recent advancements in 4D Gaussian Splatting (4DGS)\noffer powerful tools for modeling dynamic scenes, yet their application to\ndynamic CBCT remains underexplored. Existing 4DGS methods, such as HexPlane,\nuse implicit motion representations, which are computationally expensive. While\nexplicit low-rank motion models have been proposed, they lack spatial\nregularization, leading to inconsistencies in Gaussian motion. To address these\nlimitations, we introduce a free-form deformation (FFD)-based spatial basis\nfunction and a deformation-informed framework that enforces consistency by\ncoupling the temporal evolution of Gaussian's mean position, scale, and\nrotation under a unified deformation field. We evaluate our approach on six\nCBCT datasets, demonstrating superior image quality with a 6x speedup over\nHexPlane. These results highlight the potential of deformation-informed 4DGS\nfor efficient, motion-compensated CBCT reconstruction. The code is available at\nhttps://github.com/Yuliang-Huang/DIGS.",
      "url": "http://arxiv.org/abs/2506.22280v1",
      "published_time_eastern_timestamp": 1751035739.0
    },
    {
      "title": "COOCO -- Common Objects Out-of-Context -- Semantic Violation in Scenes:\n  Investigating Multimodal Context in Referential Communication",
      "summary": "Natural scenes provide us with rich contexts for object recognition and\nreference. In particular, knowing what type of scene one is looking at\ngenerates expectations about which objects will occur, and what their spatial\nconfiguration should be. Do Vision-Language Models (VLMs) learn to rely on\nscene contexts in a similar way, when generating references to objects? To\naddress this question, we introduce the \\textit{Common Objects Out-of-Context\n(COOCO)} dataset and test to what extent VLMs rely on scene context to refer to\nobjects under different degrees of scene-object congruency, and different\nperturbations. Our findings show that models leverage scene context adaptively,\ndepending on both the semantic relatedness between object and scene and the\nlevel of noise. In particular, models rely more on context under high\ntarget-scene congruence or when objects are degraded. Attention analysis\nreveals that successful object categorisation involves increased focus on the\ntarget in mid-level layers, especially under moderate noise, suggesting that\nVLMs dynamically balance local and contextual information for reference\ngeneration. We make our dataset, code and models available at\n\\href{https://github.com/cs-nlp-uu/scenereg}{https://github.com/cs-nlp-uu/scenereg}.",
      "url": "http://arxiv.org/abs/2506.22274v1",
      "published_time_eastern_timestamp": 1751035485.0
    },
    {
      "title": "On the Feasibility of Distributed Phase Synchronization for Coherent\n  Signal Superposition",
      "summary": "In this study, we analyze the feasibility of distributed phase\nsynchronization for coherent signal superposition, a fundamental enabler for\nparadigms such as coherent over-the-air computation (OAC), distributed\nbeamforming, and interference alignment, under mobility and hardware\nimpairments. With the focus on coherent OAC, we introduce phase-coded pilots\n(PCPs), a strategy where the radios communicate with each other to eliminate\nthe round-trip phase change in the uplink (UL) and downlink (DL) to align the\nphase of the received symbol at a desired angle. In this study, considering a\ncarrier frequency offset (CFO)-resilient multi-user procedure, we derive the\nstatistics of the phase deviations to assess how fast the phase coherency\ndegrades. Our results show that residual CFO is a major factor determining the\nduration of phase coherency, in addition to the non-negligible effects of\nmobility and the number of nodes in the network. We also provide a\nproof-of-concept demonstration for coherent signal superposition by using\noff-the-shelf radios to demonstrate the feasibility of PCPs in practice.",
      "url": "http://arxiv.org/abs/2506.22252v1",
      "published_time_eastern_timestamp": 1751034001.0
    },
    {
      "title": "Leveraging In-Context Learning for Political Bias Testing of LLMs",
      "summary": "A growing body of work has been querying LLMs with political questions to\nevaluate their potential biases. However, this probing method has limited\nstability, making comparisons between models unreliable. In this paper, we\nargue that LLMs need more context. We propose a new probing task, Questionnaire\nModeling (QM), that uses human survey data as in-context examples. We show that\nQM improves the stability of question-based bias evaluation, and demonstrate\nthat it may be used to compare instruction-tuned models to their base versions.\nExperiments with LLMs of various sizes indicate that instruction tuning can\nindeed change the direction of bias. Furthermore, we observe a trend that\nlarger models are able to leverage in-context examples more effectively, and\ngenerally exhibit smaller bias scores in QM. Data and code are publicly\navailable.",
      "url": "http://arxiv.org/abs/2506.22232v1",
      "published_time_eastern_timestamp": 1751032177.0
    },
    {
      "title": "Adapting University Policies for Generative AI: Opportunities,\n  Challenges, and Policy Solutions in Higher Education",
      "summary": "The rapid proliferation of generative artificial intelligence (AI) tools -\nespecially large language models (LLMs) such as ChatGPT - has ushered in a\ntransformative era in higher education. Universities in developed regions are\nincreasingly integrating these technologies into research, teaching, and\nassessment. On one hand, LLMs can enhance productivity by streamlining\nliterature reviews, facilitating idea generation, assisting with coding and\ndata analysis, and even supporting grant proposal drafting. On the other hand,\ntheir use raises significant concerns regarding academic integrity, ethical\nboundaries, and equitable access. Recent empirical studies indicate that nearly\n47% of students use LLMs in their coursework - with 39% using them for exam\nquestions and 7% for entire assignments - while detection tools currently\nachieve around 88% accuracy, leaving a 12% error margin. This article\ncritically examines the opportunities offered by generative AI, explores the\nmultifaceted challenges it poses, and outlines robust policy solutions.\nEmphasis is placed on redesigning assessments to be AI-resilient, enhancing\nstaff and student training, implementing multi-layered enforcement mechanisms,\nand defining acceptable use. By synthesizing data from recent research and case\nstudies, the article argues that proactive policy adaptation is imperative to\nharness AI's potential while safeguarding the core values of academic integrity\nand equity.",
      "url": "http://arxiv.org/abs/2506.22231v1",
      "published_time_eastern_timestamp": 1751032142.0
    },
    {
      "title": "Cardiovascular disease classification using radiomics and geometric\n  features from cardiac CT",
      "summary": "Automatic detection and classification of Cardiovascular disease (CVD) from\nComputed Tomography (CT) images play an important part in facilitating\nbetter-informed clinical decisions. However, most of the recent deep learning\nbased methods either directly work on raw CT data or utilize it in pair with\nanatomical cardiac structure segmentation by training an end-to-end classifier.\nAs such, these approaches become much more difficult to interpret from a\nclinical perspective. To address this challenge, in this work, we break down\nthe CVD classification pipeline into three components: (i) image segmentation,\n(ii) image registration, and (iii) downstream CVD classification. Specifically,\nwe utilize the Atlas-ISTN framework and recent segmentation foundational models\nto generate anatomical structure segmentation and a normative healthy atlas.\nThese are further utilized to extract clinically interpretable radiomic\nfeatures as well as deformation field based geometric features (through atlas\nregistration) for CVD classification. Our experiments on the publicly available\nASOCA dataset show that utilizing these features leads to better CVD\nclassification accuracy (87.50\\%) when compared against classification model\ntrained directly on raw CT images (67.50\\%). Our code is publicly available:\nhttps://github.com/biomedia-mira/grc-net",
      "url": "http://arxiv.org/abs/2506.22226v1",
      "published_time_eastern_timestamp": 1751031785.0
    },
    {
      "title": "EFRame: Deeper Reasoning via Exploration-Filtering-Replay Reinforcement\n  Learning Framework",
      "summary": "Recent advances in reinforcement learning (RL) have significantly enhanced\nthe reasoning capabilities of large language models (LLMs). Group Relative\nPolicy Optimization (GRPO), an efficient variant of PPO that lowers RL's\ncomputational cost, still faces limited exploration, low sample efficiency and\ninstability, constraining its performance on complex reasoning tasks. To\naddress these limitations, we introduce EFRame, an Exploration-Filtering-Replay\nframework that systematically augments GRPO along three critical dimensions.\nEFRame performs additional rollouts to explore high-quality trajectories,\napplies online filtering to eliminate low-quality samples that introduce noise\nand variance, and leverages experience replay to repeatedly exploit rare but\ninformative samples. EFRame establishes a complete and stable learning cycle,\nguiding the model through a structured transition from exploration to\nconvergence. Our experiments across a variety of reasoning benchmarks\ndemonstrate that EFRame not only improves the robustness and efficiency of\ntraining, but also enables access to deeper reasoning capabilities that remain\nunattainable under vanilla GRPO. Furthermore, EFRame enables a more\nfine-grained categorization of training samples, allowing for a deeper analysis\nof how different types of samples contribute to the learning process in RL. Our\ncode is available at https://github.com/597358816/EFRame.",
      "url": "http://arxiv.org/abs/2506.22200v1",
      "published_time_eastern_timestamp": 1751029745.0
    },
    {
      "title": "Exploring Modularity of Agentic Systems for Drug Discovery",
      "summary": "Large-language models (LLMs) and agentic systems present exciting\nopportunities to accelerate drug discovery and design. In this study, we\ncritically examine the modularity of LLM-based agentic systems for drug\ndiscovery, i.e., whether parts of the agentic system such as the LLM are\ninterchangeable, a topic that has received limited attention in drug discovery\napplications. We compare the performance of different large language models\n(LLMs) and the effectiveness of tool-calling agents versus code-generating\nagents in this domain. Our case study, comparing performance in orchestrating\ntools for chemistry and drug discovery using an LLM-as-a-judge score, shows\nthat Claude-3.5-Sonnet, Claude-3.7-Sonnet and GPT-4o outperform alternative\nlanguage models such as Llama-3.1-8B, Llama-3.1-70B, GPT-3.5-Turbo, and\nNova-Micro. Although we confirm that code-generating agents outperform the\ntool-calling ones on average, we show that this is highly question and model\ndependent. Furthermore, the impact of replacing system prompts is dependent on\nthe specific question asked and the model used, underscoring that -- even in\nthis particular domain -- one cannot just replace language models without\nconsidering prompt re-engineering. Our study highlights the necessity of\nfurther research into the modularity of agentic systems to enable the\ndevelopment of stable and scalable solutions for real-world problems.",
      "url": "http://arxiv.org/abs/2506.22189v1",
      "published_time_eastern_timestamp": 1751029020.0
    },
    {
      "title": "Training Language Model to Critique for Better Refinement",
      "summary": "Large language models (LLMs) have demonstrated remarkable evaluation and\ncritique capabilities, providing insightful feedback and identifying flaws in\nvarious tasks. However, limited research has explored which types of critiques\nare most effective for improving model responses or how to generate such\ncritiques. To address this gap, we introduce \\textbf{R}efinement-oriented\n\\textbf{C}ritique \\textbf{O}ptimization (RCO), a novel framework designed to\ntrain critic models using refinement signals. RCO uses a feedback loop where\ncritiques, generated by the critic model, guide the actor model in refining its\nresponses. The critique utility (CU) quantifies the effectiveness of these\nrefinements, serving as the reward signal for training the critic model. By\nfocusing on critiques that lead to better refinements, RCO eliminates the need\nfor direct critique preference assessment, ensuring that critiques driving\nmeaningful improvements are rewarded. We evaluate RCO across five tasks, i.e.,\ndialog generation, summarization, question answering, mathematical reasoning,\nand code generation, and show that it significantly outperforms traditional\nmethods and open-source models in terms of critique quality and refinement\noutcomes. Our contributions include the introduction of RCO, a novel\nsupervision scheme based on refined response preferences, and comprehensive\nexperimental results that highlight the method's effectiveness in enhancing LLM\ncritique-refinement loops.",
      "url": "http://arxiv.org/abs/2506.22157v1",
      "published_time_eastern_timestamp": 1751026257.0
    },
    {
      "title": "RetFiner: A Vision-Language Refinement Scheme for Retinal Foundation\n  Models",
      "summary": "The rise of imaging techniques such as optical coherence tomography (OCT) and\nadvances in deep learning (DL) have enabled clinicians and researchers to\nstreamline retinal disease staging. A popular DL approach is self-supervised\nlearning (SSL), where models learn from vast amounts of unlabeled data,\navoiding costly annotation. SSL has allowed the development of foundation\nmodels (FMs), large models that can be used for a variety of downstream tasks.\nHowever, existing FMs for OCT, trained solely on image data, lack a\ncomprehensive and robust semantic understanding of images, as evidenced by\ntheir downstream performance (especially for complex tasks), and thus require\nsupervised fine-tuning (which may be unfeasible) to better adapt to specific\napplications and populations. To address this, we propose RetFiner, an SSL\nvision-language refinement scheme that improves the representations of existing\nFMs and enables their efficient and direct adaptation to specific populations\nfor improved downstream performance. Our method uses a diverse set of training\nobjectives which take advantage of the rich supervisory signal found in textual\ndata. We tested RetFiner on the retinal FMs RETFound, UrFound, and VisionFM,\nshowing significant improvements in linear probing performance on seven highly\ndiverse OCT classification tasks, with an average increase of 5.8, 3.9, and 2.1\npercentage points over their baselines, respectively. Our code and model\nweights are publicly available at https://github.com/ronnief1/RetFiner.",
      "url": "http://arxiv.org/abs/2506.22149v1",
      "published_time_eastern_timestamp": 1751025234.0
    }
  ]
}